<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>Face to face office | Matrix207&#39;s Blog</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="From http://www.douban.com/note/221426825/
&amp;#x9762;&amp;#x5BF9;&amp;#x9762;&amp;#x7684;&amp;#x529E;&amp;#x516C;&amp;#x5BA4;&amp;#x2014;&amp;#x2014;&amp;#x7EAA;&amp;#x5FF5;&amp;#x827E;&amp;#x4F26;&amp;#x2022;&amp;#x56FE;&amp;#x7075;&amp;#x767E;&amp;#x5E74;&amp;#x8BDE;&amp;#x8F">
<meta property="og:type" content="article">
<meta property="og:title" content="Face to face office">
<meta property="og:url" content="http://matrix207.github.com/2013/08/06/face-to-face-office/index.html">
<meta property="og:site_name" content="Matrix207's Blog">
<meta property="og:description" content="From http://www.douban.com/note/221426825/
&amp;#x9762;&amp;#x5BF9;&amp;#x9762;&amp;#x7684;&amp;#x529E;&amp;#x516C;&amp;#x5BA4;&amp;#x2014;&amp;#x2014;&amp;#x7EAA;&amp;#x5FF5;&amp;#x827E;&amp;#x4F26;&amp;#x2022;&amp;#x56FE;&amp;#x7075;&amp;#x767E;&amp;#x5E74;&amp;#x8BDE;&amp;#x8F">
<meta property="og:image" content="http://img3.douban.com/view/note/large/public/p221426825-1.jpg">
<meta property="og:image" content="http://img3.douban.com/view/note/large/public/p221426825-2.jpg">
<meta property="og:image" content="http://img3.douban.com/view/note/large/public/p221426825-4.jpg">
<meta property="og:image" content="http://img3.douban.com/view/note/large/public/p221426825-5.jpg">
<meta property="og:image" content="http://img3.douban.com/view/note/large/public/p221426825-7.jpg">
<meta property="og:image" content="http://img4.douban.com/view/note/large/public/p221426825-8.jpg">
<meta property="og:image" content="http://img5.douban.com/view/note/large/public/p221426825-9.jpg">
<meta property="og:image" content="http://img3.douban.com/view/note/large/public/p221426825-10.jpg">
<meta property="og:updated_time" content="2016-04-24T10:18:01.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Face to face office">
<meta name="twitter:description" content="From http://www.douban.com/note/221426825/
&amp;#x9762;&amp;#x5BF9;&amp;#x9762;&amp;#x7684;&amp;#x529E;&amp;#x516C;&amp;#x5BA4;&amp;#x2014;&amp;#x2014;&amp;#x7EAA;&amp;#x5FF5;&amp;#x827E;&amp;#x4F26;&amp;#x2022;&amp;#x56FE;&amp;#x7075;&amp;#x767E;&amp;#x5E74;&amp;#x8BDE;&amp;#x8F">
<meta name="twitter:image" content="http://img3.douban.com/view/note/large/public/p221426825-1.jpg">
  
    <link rel="alternate" href="/atom.xml" title="Matrix207&#39;s Blog" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">Matrix207&#39;s Blog</a>
      </h1>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
          <a class="main-nav-link" href="/about">About</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="Search"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://matrix207.github.com"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-face-to-face-office" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2013/08/06/face-to-face-office/" class="article-date">
  <time datetime="2013-08-05T16:00:00.000Z" itemprop="datePublished">2013-08-06</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/math/">math</a>
  </div>

  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      Face to face office
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>From <a href="http://www.douban.com/note/221426825/" target="_blank" rel="external">http://www.douban.com/note/221426825/</a></p>
<p>&#x9762;&#x5BF9;&#x9762;&#x7684;&#x529E;&#x516C;&#x5BA4;&#x2014;&#x2014;&#x7EAA;&#x5FF5;&#x827E;&#x4F26;&#x2022;&#x56FE;&#x7075;&#x767E;&#x5E74;&#x8BDE;&#x8FB0; 1912.6.23-2012.6.23</p>
<p>&#xFF08;&#x8F7D;&#x4E8E;&#x300A;&#x4E0A;&#x6D77;&#x6587;&#x5316;&#x300B;2012&#x5E74;&#x7B2C;5&#x671F;&#xFF09;</p>
<p>##&#x4E00;&#x3001;&#x5DE6;&#x8FB9;&#x7684;&#x529E;&#x516C;&#x5BA4;</p>
<p>&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x6559;&#x6388;&#x6BCF;&#x5E74;&#x6362;&#x4E00;&#x90E8;&#x65B0;&#x51EF;&#x8FEA;&#x62C9;&#x514B;&#x3002;&#x65E9;&#x4E0A;&#x5341;&#x70B9;&#xFF0C;&#x4ED6;&#x628A;&#x7231;&#x8F66;&#x505C;&#x5728;&#x5E15;&#x5C14;&#x739B;&#x7269;&#x7406;&#x5B9E;&#x9A8C;&#x5BA4;&#x95E8;&#x53E3;&#xFF0C;&#x795E;&#x91C7;&#x5955;&#x5955;&#x5730;&#x8D70;&#x8FDB;&#x9694;&#x58C1;&#x6570;&#x5B66;&#x7CFB;&#x7684;&#x529E;&#x516C;&#x5BA4;&#x3002;&#x90A3;&#x65F6;&#x5019;&#x666E;&#x6797;&#x65AF;&#x987F;&#x9AD8;&#x7B49;&#x7814;&#x7A76;&#x9662;&#x624D;&#x521A;&#x6210;&#x7ACB;&#xFF0C;&#x548C;&#x6570;&#x5B66;&#x7CFB;&#x6324;&#x5728;&#x4E00;&#x5E62;&#x53EB;&#x4F5C;Fine Hall&#x7684;&#x697C;&#x2014;&#x2014; &#x201C;&#x8FD8;&#x4E0D;&#x9519;&#x7684;&#x697C;&#x201D;&#x3002;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x6559;&#x6388;&#x603B;&#x662F;&#x7A7F;&#x4E00;&#x8EAB;&#x7B14;&#x633A;&#x7684;&#x897F;&#x88C5;&#xFF0C;&#x4EE5;&#x514D;&#x522B;&#x4EBA;&#x628A;&#x4ED6;&#x9519;&#x5F53;&#x6210;&#x5B66;&#x751F;&#x3002;&#x4ED6;&#x592A;&#x5E74;&#x8F7B;&#xFF0C;&#x4E09;&#x5341;&#x51FA;&#x5934;&#xFF0C;&#x5374;&#x5DF2;&#x7ECF;&#x5230;&#x8FBE;&#x4E86;&#x5B66;&#x672F;&#x9876;&#x5CF0;&#xFF0C;&#x548C;&#x4E94;&#x5341;&#x591A;&#x5C81;&#x7684;&#x7269;&#x7406;&#x5B66;&#x5BB6;&#x7231;&#x56E0;&#x65AF;&#x5766;&#x3001;&#x6570;&#x5B66;&#x5BB6;&#x7EF4;&#x5E03;&#x4F26;(Oswald Veblen)&#x3001;&#x6570;&#x5B66;&#x5BB6;&#x4E9A;&#x5386;&#x5C71;&#x5927;(James Alexander)&#x4E00;&#x8D77;&#x6210;&#x4E86;&#x9AD8;&#x7B49;&#x7814;&#x7A76;&#x9662;&#x6700;&#x521D;&#x4EFB;&#x547D;&#x7684;&#x56DB;&#x4F4D;&#x6559;&#x6388;&#x3002;</p>
<p><img src="http://img3.douban.com/view/note/large/public/p221426825-1.jpg" alt="John von Neumann, 1903-1957"></p>
<p>&#x5341;&#x516B;&#x5C81;&#x90A3;&#x5E74;&#xFF0C;&#x4ED6;&#x72B9;&#x592A;&#x88D4;&#x7684;&#x7236;&#x6BCD;&#x8BD5;&#x56FE;&#x628A;&#x957F;&#x5B50;&#x62C9;&#x51FA;&#x5BF9;&#x6570;&#x5B66;&#x7684;&#x6267;&#x8FF7;&#x5B66;&#x4E9B;&#x66F4;&#x5B9E;&#x9645;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E8E;&#x662F;&#x4ED6;&#x4EEC;&#x8FBE;&#x6210;&#x4E86;&#x59A5;&#x534F;&#xFF0C;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x540C;&#x65F6;&#x5728;&#x4E09;&#x6240;&#x5927;&#x5B66;&#x6CE8;&#x518C;&#xFF1A;&#x5728;&#x82CF;&#x9ECE;&#x58EB;&#x8054;&#x90A6;&#x7406;&#x5DE5;&#x5B66;&#x9662;&#xFF08;ETH&#xFF09;&#x5B66;&#x4E60;&#x5316;&#x5B66;&#x5DE5;&#x7A0B;&#xFF0C;&#x6BCF;&#x665A;&#x5B8C;&#x6210;&#x67CF;&#x6797;&#x5927;&#x5B66;&#x6570;&#x5B66;&#x4E13;&#x4E1A;&#x7684;&#x4F5C;&#x4E1A;&#xFF0C;&#x5728;&#x6BCF;&#x4E2A;&#x5B66;&#x671F;&#x672B;&#x56DE;&#x5E03;&#x8FBE;&#x4F69;&#x65AF;&#x5927;&#x5B66;&#x53C2;&#x52A0;&#x4ED6;&#x4ECE;&#x6CA1;&#x4E0A;&#x8FC7;&#x8BFE;&#x7684;&#x6570;&#x5B66;&#x8003;&#x8BD5;&#x3002;&#x4E8C;&#x5341;&#x4E8C;&#x5C81;&#x90A3;&#x5E74;&#x4ED6;&#x4E0D;&#x4F46;&#x4ECE;&#x82CF;&#x9ECE;&#x58EB;&#x8054;&#x90A6;&#x7406;&#x5DE5;&#x62FF;&#x5230;&#x5316;&#x5B66;&#x5DE5;&#x7A0B;&#x5B66;&#x4F4D;&#xFF0C;&#x8FD8;&#x901A;&#x8FC7;&#x4E86;&#x5927;&#x536B;&#x2022;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#x5750;&#x9547;&#x7684;&#x6570;&#x5B66;&#x535A;&#x58EB;&#x7B54;&#x8FA9;&#x3002;&#x6574;&#x573A;&#x7B54;&#x8FA9;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#x53EA;&#x95EE;&#x4E86;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x201C;&#x6211;&#x4ECE;&#x6765;&#x6CA1;&#x89C1;&#x8FC7;&#x8FD9;&#x4E48;&#x6F02;&#x4EAE;&#x7684;&#x665A;&#x793C;&#x670D;&#xFF0C;&#x4F60;&#x7684;&#x88C1;&#x7F1D;&#x662F;&#x8C01;&#xFF1F;&#x201D;&#x4E8E;&#x662F;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#x4E86;&#xFF0C;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#x94A6;&#x70B9;&#x7684;&#x5E74;&#x8F7B;&#x4EBA;&#xFF0C;&#x4E0D;&#x4F46;&#x5199;&#x4E86;&#x5B8C;&#x7F8E;&#x7684;&#x535A;&#x58EB;&#x8BBA;&#x6587;&#xFF0C;&#x8FD8;&#x662F;&#x4E2A;&#x7FE9;&#x7FE9;&#x4F73;&#x516C;&#x5B50;&#x3002;</p>
<p>&#x535A;&#x58EB;&#x6BD5;&#x4E1A;&#x540E;&#x7684;&#x4E09;&#x5E74;&#xFF0C;&#x9AD8;&#x4EA7;&#x7684;&#x4E09;&#x5E74;&#xFF01;&#x4ED6;&#x5728;&#x67CF;&#x6797;&#x5927;&#x5B66;&#x548C;&#x6C49;&#x5821;&#x5927;&#x5B66;&#x7684;&#x4E09;&#x5E74;&#x4E00;&#x5171;&#x53D1;&#x8868;&#x4E86;&#x4E8C;&#x5341;&#x4E94;&#x7BC7;&#x8BBA;&#x6587;&#xFF01;&#x5305;&#x62EC;&#x4E00;&#x672C;&#x516B;&#x5341;&#x5E74;&#x540E;&#x4ECD;&#x7136;&#x91CD;&#x5370;&#x7684;&#x91CF;&#x5B50;&#x529B;&#x5B66;&#x6559;&#x79D1;&#x4E66;&#xFF0C;&#x53EF;&#x662F;&#x2026;&#x2026;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x9AD8;&#x901F;&#x524D;&#x884C;&#x7684;&#x5929;&#x624D;&#x8FD9;&#x4E9B;&#x5149;&#x8363;&#x4E5F;&#x5DF2;&#x7ECF;&#x662F;&#x9648;&#x5E74;&#x5F80;&#x4E8B;&#x3002;&#x4E8C;&#x5341;&#x4E03;&#x5C81;&#x4E0A;&#xFF0C;&#x7EB3;&#x7CB9;&#x521A;&#x521A;&#x62AC;&#x5934;&#x800C;&#x7F8E;&#x56FD;&#x4E5F;&#x6070;&#x597D;&#x8D70;&#x51FA;&#x4E86;&#x5927;&#x8427;&#x6761;&#xFF0C;&#x7EF4;&#x5E03;&#x4F26;&#x4EE3;&#x8868;&#x666E;&#x6797;&#x65AF;&#x987F;&#x53BB;&#x6B27;&#x6D32;&#x62DB;&#x5175;&#x4E70;&#x9A6C;&#xFF0C;&#x5DE5;&#x8D44;&#x5F00;&#x4EF7;&#x662F;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x5728;&#x5FB7;&#x56FD;&#x6323;&#x7684;&#x516B;&#x500D;&#x8FD8;&#x591A;&#x3002;&#x8E0F;&#x8FDB;&#x7F8E;&#x5229;&#x575A;&#x7B2C;&#x4E00;&#x5929;&#xFF0C;&#x4ED6;&#x6253;&#x8DA3;&#x5730;&#x5BF9;&#x540C;&#x884C;&#x7684;&#x5308;&#x7259;&#x5229;&#x8001;&#x4E61;&#x7EF4;&#x683C;&#x7EB3;(Eugene Wigner, 1963&#x5E74;&#x8BFA;&#x8D1D;&#x5C14;&#x7269;&#x7406;&#x5B66;&#x5956;)&#x8BF4;&#xFF1A;&#x201C;&#x6211;&#x4EEC;&#x8BE5;&#x8BA9;&#x81EA;&#x5DF1;&#x66F4;&#x50CF;&#x7F8E;&#x56FD;&#x4EBA;&#x3002;&#x201D;&#x5F53;&#x5373;&#xFF0C;&#x7EF4;&#x683C;&#x7EB3;&#x6539;&#x540D;&#x53EB;&#x201C;&#x5C24;&#x91D1;&#x201D;(Eugene)&#xFF0C;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x6539;&#x540D;&#x53EB;&#x201C;&#x7EA6;&#x7FF0;&#x201D;(John)&#xFF0C;&#x548C;&#x7A0D;&#x5FAE;&#x719F;&#x4E00;&#x70B9;&#x7684;&#x4EBA;&#x5C31;&#x52FE;&#x80A9;&#x642D;&#x80CC;&#x5730;&#x8BF4;&#x201C;&#x4F60;&#x4EEC;&#x53EB;&#x6211;&#x5F3A;&#x5C3C;(Johnny)&#x5427;&#x3002;&#x201D;</p>
<p>&#x5F3A;&#x5C3C;&#xFF0C;&#x5F3A;&#x5C3C;&#x3002;&#x5F3A;&#x5C3C;&#x2022;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x5C31;&#x4E0D;&#x7740;&#x75D5;&#x8FF9;&#x5730;&#x6DF7;&#x8FDB;&#x4E86;&#x6EE1;&#x5927;&#x8857;&#x90FD;&#x662F;&#x5F3A;&#x5C3C;&#x7684;&#x7F8E;&#x5229;&#x575A;&#x5927;&#x7194;&#x7089;&#xFF0C;&#x8FD8;&#x6709;&#x8C01;&#x77E5;&#x9053;&#x4ED6;&#x521A;&#x51FA;&#x751F;&#x65F6;&#x90A3;&#x4E2A;&#x5351;&#x5FAE;&#x7684;&#x5308;&#x7259;&#x5229;&#x540D;&#x201C;&#x4E9A;&#x8BFA;&#x65AF;&#x201D;(Janos) &#xFF1F;&#x8FD8;&#x6709;&#x8C01;&#x77E5;&#x9053;&#x4ED6;&#x5728;&#x5FB7;&#x56FD;&#x90A3;&#x51E0;&#x5E74;&#x65E5;&#x8033;&#x66FC;&#x5316;&#x7684;&#x201C;&#x7EA6;&#x6C49;&#x7EB3;&#x201D;(Johann)&#xFF1F; &#x4E0D;&#x8FC7;&#x4ED6;&#x6539;&#x4E86;&#x540D;&#x5B57;&#xFF0C;&#x5374;&#x6B7B;&#x6D3B;&#x4E0D;&#x80AF;&#x628A;&#x59D3;&#x6C0F;&#x91CC;&#x7684;&#x201C;&#x51AF;&#x201D;&#x53BB;&#x6389;&#x3002;&#x4E8C;&#x5341;&#x51E0;&#x5E74;&#x524D;&#x4ED6;&#x6709;&#x94B1;&#x7684;&#x72B9;&#x592A;&#x8001;&#x7238;&#x5411;&#x884C;&#x5C06;&#x5C31;&#x6728;&#x7684;&#x8001;&#x7687;&#x5E1D;&#x5F17;&#x6717;&#x8328;&#x2022;&#x7EA6;&#x745F;&#x592B;&#x4E70;&#x4E86;&#x8FD9;&#x4E2A;&#x8D35;&#x65CF;&#x79F0;&#x53F7;&#xFF0C;&#x4E8E;&#x662F;&#x5E26;&#x7740;&#x66B4;&#x53D1;&#x6237;&#x6C14;&#x606F;&#x7684;&#x8BFA;&#x4F9D;&#x66FC;&#x5BB6;&#x65CF;&#x5C31;&#x8F6C;&#x773C;&#x53D8;&#x6210;&#x4E86;&#x4EE3;&#x4EE3;&#x76F8;&#x4F20;&#x7684;&#x8D35;&#x65CF;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#xFF0C;&#x591A;&#x4E8F;&#x5965;&#x5308;&#x5E1D;&#x56FD;&#x56FD;&#x5E93;&#x7A7A;&#x865A;&#x7B49;&#x94B1;&#x7528;&#xFF0C;&#x5426;&#x5219;&#x5341;&#x8DB3;&#x7684;&#x72B9;&#x592A;&#x8840;&#x7EDF;&#x600E;&#x4E48;&#x80FD;&#x6350;&#x4E0A;&#x8FD9;&#x4E2A;&#x9AD8;&#x8D35;&#x7684;&#x540D;&#x5934;&#xFF1F;&#x4E00;&#x5230;&#x5468;&#x672B;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x80AF;&#x5B9A;&#x8BF7;&#x6559;&#x6388;&#x4EEC;&#x4E0A;&#x4ED6;&#x5BBD;&#x655E;&#x5962;&#x4F88;&#x7684;&#x5927;&#x5B85;&#x559D;&#x9152;&#x8DF3;&#x821E;&#xFF0C;&#x5BBE;&#x5BA2;&#x76C8;&#x95E8;&#x676F;&#x89E5;&#x4EA4;&#x9519;&#xFF0C; &#x201C;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x8BF7;&#x5BA2;&#x8C01;&#x4E0D;&#x53BB;&#xFF01;&#x201D;&#x8BB2;&#x51FA;&#x8FD9;&#x8BDD;&#xFF0C;&#x5C31;&#x597D;&#x8C61;&#x8BF7;&#x5BA2;&#x505A;&#x4E1C;&#x7684;&#x662F;&#x5965;&#x5308;&#x5E1D;&#x56FD;&#x7684;&#x67D0;&#x4E2A;&#x6700;&#x5C0A;&#x8D35;&#x7684;&#x65E5;&#x8033;&#x66FC;&#x88D4;&#x516C;&#x7235;&#x3002;</p>
<p>##&#x4E8C;&#x3001;&#x53F3;&#x8FB9;&#x7684;&#x529E;&#x516C;&#x5BA4;</p>
<p>&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x6559;&#x6388;&#x5BF9;&#x9762;&#x7684;&#x529E;&#x516C;&#x5BA4;&#x5750;&#x7740;&#x535A;&#x58EB;&#x751F;&#x827E;&#x4F26;&#x2022;&#x56FE;&#x7075;&#x3002;&#x5F00;&#x6717;&#x5916;&#x5411;&#x7684;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x6559;&#x6388;&#x548C;&#x5B64;&#x50FB;&#x7D27;&#x5F20;&#x7684;&#x56FE;&#x7075;&#x6CA1;&#x4EC0;&#x4E48;&#x95F2;&#x8BDD;&#x597D;&#x804A;&#xFF0C;&#x53EA;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x603B;&#x7A7F;&#x4E00;&#x8EAB;&#x4E71;&#x7CDF;&#x7CDF;&#x8FD0;&#x52A8;&#x886B;&#x7684;&#x5E74;&#x8F7B;&#x4EBA;&#x524D;&#x51E0;&#x5929;&#x5DEE;&#x70B9;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x90A3;&#x90E8;&#x4E8C;&#x624B;&#x798F;&#x7279;&#x8F66;&#x5012;&#x8F66;&#x8FDB;&#x4E86;&#x5361;&#x8010;&#x57FA;&#x6E56;&#x3002;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x6559;&#x6388;&#x6A2A;&#x7A7F;&#x5927;&#x897F;&#x6D0B;&#x5FC5;&#x4E70;&#x5934;&#x7B49;&#x8231;&#xFF0C;&#x5E38;&#x5E74;&#x897F;&#x88C5;&#x9769;&#x5C65;&#xFF0C;&#x6BCF;&#x5E74;&#x6362;&#x4E00;&#x90E8;&#x5D2D;&#x65B0;&#x7684;&#x51EF;&#x8FEA;&#x62C9;&#x514B;&#xFF0C;&#x7565;&#x7565;&#x53D1;&#x798F;&#xFF0C;&#x8BA8;&#x538C;&#x8FD0;&#x52A8;&#xFF0C;&#x6709;&#x4E00;&#x6B21;&#x59BB;&#x5B50;&#x60F3;&#x8BA9;&#x4ED6;&#x5B66;&#x6ED1;&#x96EA;&#x4ED6;&#x607C;&#x7F9E;&#x6210;&#x6012;&#x751A;&#x81F3;&#x4EE5;&#x79BB;&#x5A5A;&#x5A01;&#x80C1;&#x3002;&#x4E0E;&#x4ED6;&#x6070;&#x6070;&#x76F8;&#x53CD;&#xFF0C;&#x535A;&#x58EB;&#x751F;&#x56FE;&#x7075;&#x5219;&#x5728;&#x51E0;&#x4E2A;&#x6708;&#x524D;&#x5750;&#x7740;&#x672B;&#x7B49;&#x7532;&#x677F;&#x8231;&#x4ECE;&#x82F1;&#x56FD;&#x6F02;&#x5230;&#x7F8E;&#x56FD;&#x3002;&#x4ED6;&#x5E38;&#x5E74;&#x4E00;&#x4EF6;&#x5957;&#x5934;&#x886B;&#xFF0C;&#x5F00;&#x4E00;&#x90E8;&#x72B6;&#x51B5;&#x582A;&#x5FE7;&#x7684;&#x4E8C;&#x624B;&#x798F;&#x7279;&#xFF0C;&#x8EAB;&#x6750;&#x7626;&#x524A;&#xFF0C;&#x70ED;&#x7231;&#x8FD0;&#x52A8;&#xFF0C;&#x662F;&#x8DD1;&#x8D62;&#x8FC7;&#x5965;&#x8FD0;&#x4F1A;&#x9009;&#x624B;&#x7684;&#x9A6C;&#x62C9;&#x677E;&#x5065;&#x5C06;&#x3002;&#x4E00;&#x5230;&#x5468;&#x672B;&#xFF0C;&#x4ED6;&#x548C;&#x540C;&#x5B66;&#x6253;&#x5792;&#x7403;&#x6BD4;&#x8D5B;&#xFF0C;&#x5206;&#x6210;&#x4E24;&#x4E2A;&#x961F;&#xFF0C;&#x201C;&#x5927;&#x82F1;&#x5E1D;&#x56FD;&#x961F;&#x201D;&#x5BF9;&#x51B3;&#x201C;&#x53DB;&#x53D8;&#x6B96;&#x6C11;&#x5730;&#x961F;&#x201D;&#x3002;</p>
<p><img src="http://img3.douban.com/view/note/large/public/p221426825-2.jpg" alt="Alan Turing, 1912-1954"></p>
<p>&#x521A;&#x6765;&#x666E;&#x6797;&#x65AF;&#x987F;&#x90A3;&#x4F1A;&#x513F;&#x4ED6;&#x4E0D;&#x662F;&#x6CA1;&#x8BD5;&#x8FC7;&#x53BB;&#x4EA4;&#x670B;&#x53CB;&#xFF0C;&#x62E5;&#x62B1;&#x65B0;&#x751F;&#x6D3B;&#xFF0C;&#x53EF;&#x662F;&#x4E0A;&#x4E2A;&#x6708;&#x5F53;&#x4E00;&#x540D;&#x5361;&#x8F66;&#x53F8;&#x673A;&#x7406;&#x6240;&#x5F53;&#x7136;&#x5730;&#x628A;&#x81EA;&#x5DF1;&#x6CB9;&#x817B;&#x817B;&#x7684;&#x624B;&#x642D;&#x5728;&#x4ED6;&#x80A9;&#x4E0A;&#x76F4;&#x547C;&#x5176;&#x540D;&#x548C;&#x4ED6;&#x4F83;&#x5927;&#x5C71;&#x65F6;&#xFF0C;&#x5802;&#x5802;&#x5251;&#x6865;&#x5927;&#x5B66;&#x56FD;&#x738B;&#x5B66;&#x9662;&#x7684;&#x6BD5;&#x4E1A;&#x751F;&#x7740;&#x5B9E;&#x4E3A;&#x8FD9;&#x79CD;&#x7C97;&#x9C81;&#x7684;&#x98CE;&#x6C14;&#x5413;&#x4E86;&#x4E00;&#x8DF3;&#x3002;&#x522B;&#x8BEF;&#x4F1A;&#x4E86;&#xFF0C;&#x4ED6;&#x4E0D;&#x50CF;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x6559;&#x6388;&#x90A3;&#x6837;&#x516C;&#x5B50;&#x6D3E;&#x5934;&#xFF0C;&#x4ED6;&#x7238;&#x7238;&#x4E0D;&#x8FC7;&#x662F;&#x5927;&#x82F1;&#x5E1D;&#x56FD;&#x9A7B;&#x5370;&#x5EA6;&#x7684;&#x4E00;&#x4E2A;&#x5C0F;&#x516C;&#x52A1;&#x5458;&#xFF0C;&#x53EF;&#x662F;&#x82F1;&#x4F26;&#x5C9B;&#x56FD;&#x7684;&#x6559;&#x517B;&#x8BA9;&#x4ED6;&#x89C9;&#x5F97;&#x4E00;&#x4E2A;&#x964C;&#x751F;&#x4EBA;&#x628A;&#x810F;&#x624B;&#x642D;&#x5728;&#x4F60;&#x4ED6;&#x80A9;&#x4E0A;&#x5B9E;&#x5728;&#x6709;&#x70B9;&#x4EB2;&#x6635;&#x8FC7;&#x5206;&#x3002;&#x4ED6;&#x4E5F;&#x8BA8;&#x538C;&#x964C;&#x751F;&#x4EBA;&#x53EB;&#x4ED6;&#x201C;&#x827E;&#x4F26;&#x201D;&#xFF0C;&#x8FD8;&#x662F;&#x201C;&#x56FE;&#x7075;&#x5148;&#x751F;&#x201D;&#x66F4;&#x59A5;&#x5F53;&#x4E9B;&#x3002;&#x9664;&#x4E86;&#x96BE;&#x4EE5;&#x9002;&#x5E94;&#x7F8E;&#x56FD;&#x7684;&#x65B0;&#x73AF;&#x5883;&#xFF0C;&#x56FE;&#x7075;&#x5148;&#x751F;&#x8FD8;&#x6709;&#x66F4;&#x7CDF;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x90A3;&#x4E2A;&#x5E74;&#x4EE3;&#x7684;&#x4F53;&#x9762;&#x793E;&#x4F1A;&#x91CC;&#x6B62;&#x4E8E;&#x624B;&#x52BF;&#x548C;&#x773C;&#x795E;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x558F;&#xFF0C;&#x4F60;&#x77E5;&#x9053;&#x7684;&#xFF0C;&#x4ED6;&#x6709;&#x70B9;&#x90A3;&#x4E2A;&#x2026;&#x2026;&#x5C31;&#x662F;&#x90A3;&#x4E2A;&#x2026;&#x2026;&#x90A3;&#x4E2A;&#x554A;&#x2026;&#x2026;&#x4F60;&#x6653;&#x5F97;&#x6211;&#x5728;&#x8BB2;&#x4EC0;&#x4E48;&#x554A;&#x3002;</p>
<p>&#x6570;&#x5B66;&#x5929;&#x624D;&#x827E;&#x4F26;&#x2022;&#x56FE;&#x7075;&#x5148;&#x751F;&#x662F;&#x4E2A;&#x65E0;&#x53EF;&#x6551;&#x836F;&#x7684;&#x540C;&#x6027;&#x604B;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x65E0;&#x53EF;&#x6551;&#x836F;&#x7684;&#x95EE;&#x9898;&#x662F;&#x8FD9;&#x6837;&#x5F00;&#x59CB;&#x7684;&#xFF1A;&#x5F53;&#x56FE;&#x7075;&#x8FD8;&#x5728;&#x8C22;&#x4F2F;&#x6069;&#x7537;&#x6821; (Sherborne School )&#x8BFB;&#x9AD8;&#x4E2D;&#xFF0C;&#x4ED6;&#x8BA4;&#x8BC6;&#x4E86;&#x6BD4;&#x81EA;&#x5DF1;&#x9AD8;&#x4E00;&#x7EA7;&#x7684;&#x514B;&#x91CC;&#x65AF;&#x6258;&#x5F17;&#x2022;&#x9A6C;&#x5C14;&#x5B54; (Christopher Morcom)&#x3002;&#x7626;&#x5F31;&#x7684;&#x3001;&#x8FC7;&#x4E8E;&#x7626;&#x5F31;&#x7684;&#x9A6C;&#x5C14;&#x5B54;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B66;&#x5E74;&#x90FD;&#x56E0;&#x75C5;&#x957F;&#x671F;&#x7F3A;&#x8BFE;&#xFF0C;&#x53EF;&#x4ED6;&#x806A;&#x660E;&#x7684;&#x5934;&#x8111;&#x7ADF;&#x7136;&#x4F7F;&#x4ED6;&#x5728;&#x5076;&#x5C14;&#x4E0A;&#x5B66;&#x7684;&#x51E0;&#x5929;&#x80FD;&#x8865;&#x4E0A;&#x6240;&#x6709;&#x529F;&#x8BFE;&#xFF0C;&#x95E8;&#x95E8;&#x8003;&#x8BD5;&#x6210;&#x7EE9;&#x7B2C;&#x4E00;&#x3002;&#x662F;&#x8FD9;&#x6837;&#x6BEB;&#x4E0D;&#x8D39;&#x529B;&#x7684;&#x806A;&#x6167;&#x5438;&#x5F15;&#x4E86;&#x56FE;&#x7075;&#xFF0C;&#x800C;&#x5F53;&#x4ED6;&#x66F4;&#x63A5;&#x8FD1;&#x9A6C;&#x5C14;&#x5B54;&#xFF0C;&#x60CA;&#x559C;&#x5730;&#x53D1;&#x73B0;&#x4ED6;&#x548C;&#x81EA;&#x5DF1;&#x4E00;&#x6837;&#xFF0C;&#x5BF9;&#x79D1;&#x5B66;&#x6709;&#x7740;&#x81EA;&#x53D1;&#x800C;&#x6D53;&#x539A;&#x7684;&#x5174;&#x8DA3;&#x3002;&#x5728;&#x9A6C;&#x5C14;&#x5B54;&#x5076;&#x5C14;&#x4E0A;&#x5B66;&#x7684;&#x65E5;&#x5B50;&#x91CC;&#xFF0C;&#x4ED6;&#x4EEC;&#x5750;&#x5728;&#x76F8;&#x90BB;&#x7684;&#x5EA7;&#x4F4D;&#x542C;&#x8BFE;&#xFF0C;&#x53C8;&#x4E00;&#x8D77;&#x53BB;&#x56FE;&#x4E66;&#x9986;&#x5199;&#x4F5C;&#x4E1A;&#xFF0C;&#x4EE5;&#x4FBF;&#x80FD;&#x4E0D;&#x65AD;&#x8BA8;&#x8BBA;&#x79D1;&#x5B66;&#x95EE;&#x9898;&#xFF1A;&#x9A6C;&#x5C14;&#x5B54;&#x8BF4;&#x5982;&#x4F55;&#x5728;&#x5BB6;&#x91CC;&#x642D;&#x5316;&#x5B66;&#x5B9E;&#x9A8C;&#x5BA4;&#x7814;&#x7A76;&#x7898;&#xFF0C;&#x56FE;&#x7075;&#x8BF4;&#x5982;&#x4F55;&#x624B;&#x7B97;&#x5706;&#x5468;&#x7387;&#x5230;&#x5C0F;&#x6570;&#x70B9;&#x540E;36&#x4F4D;&#xFF0C;&#x9A6C;&#x5C14;&#x5B54;&#x8BF4;&#x4F60;&#x77E5;&#x4E0D;&#x77E5;&#x9053;&#x859B;&#x5B9A;&#x8C14;&#x7684;&#x91CF;&#x5B50;&#x529B;&#x5B66;&#x6709;&#x8DA3;&#x6781;&#x4E86;&#xFF0C;&#x56FE;&#x7075;&#x8BF4;&#x4F60;&#x77E5;&#x4E0D;&#x77E5;&#x9053;&#x7231;&#x56E0;&#x65AF;&#x5766;&#x7684;&#x76F8;&#x5BF9;&#x8BBA;&#x4E5F;&#x6709;&#x8DA3;&#x6781;&#x4E86;&#x3002;&#x4ED6;&#x4EEC;&#x8C08;&#x68A6;&#x60F3;&#xFF0C;&#x5E94;&#x8BE5;&#x505A;&#x6570;&#x5B66;&#x5BB6;&#x8FD8;&#x662F;&#x7269;&#x7406;&#x5B66;&#x5BB6;&#xFF0C;&#x5982;&#x4F55;&#x4E3A;&#x79D1;&#x5B66;&#x505A;&#x51FA;&#x771F;&#x6B63;&#x7684;&#x8D21;&#x732E;&#x2026;&#x2026;&#x665A;&#x949F;&#x54CD;&#x4E86;&#xFF0C;&#x4ED6;&#x4EEC;&#x56DE;&#x5404;&#x81EA;&#x7684;&#x5BBF;&#x820D;&#x7761;&#x89C9;&#xFF0C;&#x53C8;&#x5728;&#x51CC;&#x6668;&#x722C;&#x8D77;&#x6765;&#x7AD9;&#x5230;&#x9633;&#x53F0;&#x4E0A;&#x7528;&#x5929;&#x6587;&#x671B;&#x8FDC;&#x955C;&#x770B;&#x661F;&#x661F;&#xFF0C;&#x5E76;&#x5199;&#x4FE1;&#x628A;&#x89C2;&#x6D4B;&#x7ED3;&#x679C;&#x544A;&#x8BC9;&#x5BF9;&#x65B9;&#xFF1A;&#x201C;&#x6211;&#x4ECE;&#x6CA1;&#x89C1;&#x8FC7;&#x66F4;&#x597D;&#x7684;&#x6728;&#x661F;&#x3002;&#x4ECA;&#x591C;&#x6211;&#x770B;&#x5230;&#x4E86;&#x4E94;&#x4E2A;&#x73AF;&#xFF0C;&#x751A;&#x81F3;&#x80FD;&#x770B;&#x6E05;&#x4E2D;&#x95F4;&#x90A3;&#x4E2A;&#x73AF;&#x4E0A;&#x7684;&#x6591;&#x3002;&#x201D;&#x201C;&#x6211;&#x4ECA;&#x591C;&#x770B;&#x5230;&#x4E86;&#x4ED9;&#x5973;&#x5EA7;&#xFF0C;&#x4F46;&#x4E00;&#x4F1A;&#x513F;&#x5C31;&#x6D88;&#x5931;&#x4E86;&#x3002;&#x201D;&#x90A3;&#x4E2A;&#x51AC;&#x5929;&#xFF0C;&#x6BD5;&#x4E1A;&#x73ED;&#x7684;&#x9A6C;&#x5C14;&#x5B54;&#x5DF2;&#x987A;&#x5229;&#x62FF;&#x5230;&#x4E86;&#x5251;&#x6865;&#x4E09;&#x4E00;&#x5B66;&#x9662;&#x7684;&#x5956;&#x5B66;&#x91D1;&#x3002;&#x56FE;&#x7075;&#x8FD8;&#x6709;&#x4E00;&#x5E74;&#x6BD5;&#x4E1A;&#xFF0C;&#x9A6C;&#x5C14;&#x5B54;&#x9F13;&#x52B1;&#x4ED6;&#x6765;&#x5E74;&#x62A5;&#x8003;&#x5251;&#x6865;&#xFF0C;&#x201C;&#x56E0;&#x4E3A;&#x90A3;&#x91CC;&#x7684;&#x79D1;&#x5B66;&#x6700;&#x597D;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x80FD;&#x7ECF;&#x5E38;&#x770B;&#x89C1;&#x4F60;&#x3002;&#x201D;&#x8FD9;&#x53E5;&#x5609;&#x52C9;&#x8BF4;&#x51FA;&#x53E3;&#x4E0D;&#x5230;&#x4E00;&#x4E2A;&#x6708;&#xFF0C;&#x4E00;&#x4E2A;&#x6674;&#x6717;&#x7684;&#x51CC;&#x6668;&#xFF0C;&#x56FE;&#x7075;&#x8D77;&#x5E8A;&#x770B;&#x89C1;&#x6708;&#x4EAE;&#x521A;&#x5DE7;&#x7ECF;&#x8FC7;&#x5BF9;&#x697C;&#x9A6C;&#x5C14;&#x5B54;&#x7684;&#x7A97;&#x6237;&#x843D;&#x4E0B;&#x3002;&#x201C;&#x4ECA;&#x665A;&#x7684;&#x6708;&#x4EAE;&#x683C;&#x5916;&#x7F8E;&#x3002;&#x201D;&#x4ED6;&#x5199;&#x5728;&#x8BB0;&#x4E8B;&#x672C;&#x4E0A;&#x9884;&#x5907;&#x7B2C;&#x4E8C;&#x5929;&#x544A;&#x8BC9;&#x9A6C;&#x5C14;&#x5B54;&#xFF0C;&#x4ED6;&#x8FD8;&#x4E0D;&#x77E5;&#x9053;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x6709;&#x90A3;&#x4E00;&#x5929;&#x4E86;&#x3002;&#x90A3;&#x4E2A;&#x51CC;&#x6668;&#xFF0C;&#x514B;&#x91CC;&#x65AF;&#x6258;&#x5F17;&#x2022;&#x9A6C;&#x5C14;&#x5B54;&#x66B4;&#x75C5;&#x592D;&#x6298;&#x3002;</p>
<p>&#x843D;&#x846C;&#x65E5;&#xFF0C;&#x65F6;&#x5E74;&#x5341;&#x4E03;&#x5C81;&#x7684;&#x56FE;&#x7075;&#x6000;&#x7740;&#x5DE8;&#x5927;&#x7684;&#x60B2;&#x75DB;&#x5199;&#x4FE1;&#x7ED9;&#x9A6C;&#x5C14;&#x5B54;&#x7684;&#x6BCD;&#x4EB2;&#xFF1A;</p>
<p>1930&#x5E74;2&#x6708;15&#x65E5;<br>&#x4EB2;&#x7231;&#x7684;&#x9A6C;&#x5C14;&#x5B54;&#x592A;&#x592A;&#xFF0C;<br>&#x6211;&#x56E0;&#x4E3A;&#x514B;&#x91CC;&#x65AF;&#x800C;&#x5F88;&#x96BE;&#x8FC7;&#x3002;&#x4E00;&#x5E74;&#x6765;&#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x5B66;&#x4E60;&#xFF0C;&#x6211;&#x4ECE;&#x6765;&#x6CA1;&#x4EA4;&#x8FC7;&#x50CF;&#x4ED6;&#x90A3;&#x4E48;&#x806A;&#x660E;&#x3001;&#x8FF7;&#x4EBA;&#x3001;&#x53C8;&#x8C26;&#x5351;&#x7684;&#x670B;&#x53CB;&#x3002;&#x6211;&#x548C;&#x4ED6;&#x5206;&#x4EAB;&#x4E86;&#x7814;&#x7A76;&#x7684;&#x4E50;&#x8DA3;&#x8FD8;&#x6709;&#x5BF9;&#x5929;&#x6587;&#x7684;&#x70ED;&#x7231;&#xFF08;&#x8FD9;&#x662F;&#x4ED6;&#x5F15;&#x53D1;&#x7684;&#xFF09;&#xFF0C;&#x6211;&#x60F3;&#x4ED6;&#x4E5F;&#x662F;&#x8FD9;&#x4E48;&#x89C9;&#x5F97;&#x7684;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x5C3D;&#x7BA1;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x4E50;&#x8DA3;&#x56E0;&#x4E3A;&#x4ED6;&#x7684;&#x6B7B;&#x800C;&#x6D88;&#x901D;&#x4E86;&#xFF0C;&#x5373;&#x4F7F;&#x8FD9;&#x4E00;&#x5207;&#x4E0D;&#x518D;&#x56E0;&#x4E3A;&#x4ED6;&#x800C;&#x90A3;&#x4E48;&#x6709;&#x8DA3;&#xFF0C;&#x6211;&#x4E5F;&#x8981;&#x6295;&#x5165;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x7CBE;&#x529B;&#x5230;&#x7814;&#x7A76;&#x4E0A;&#xFF0C;&#x5C31;&#x8C61;&#x4ED6;&#x4ECD;&#x7136;&#x6D3B;&#x7740;&#x3002;&#x4ED6;&#x4F1A;&#x5E0C;&#x671B;&#x6211;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#x3002;&#x6211;&#x6DF1;&#x77E5;&#x4F60;&#x6B64;&#x523B;&#x7684;&#x60B2;&#x75DB;&#x3002;<br>&#x4F60;&#x5FE0;&#x8BDA;&#x7684;&#xFF0C;<br>&#x827E;&#x4F26;&#x2022;&#x56FE;&#x7075;<br>&#x53C8;&#x53CA;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x7ED9;&#x6211;&#x4E00;&#x5F20;&#x514B;&#x91CC;&#x65AF;&#x7684;&#x5C0F;&#x7167;&#x7247;&#x6211;&#x5C06;&#x5341;&#x5206;&#x611F;&#x6FC0;&#x3002;&#x6211;&#x613F;&#x4EE5;&#x6B64;&#x6765;&#x7F05;&#x6000;&#x4ED6;&#x7684;&#x699C;&#x6837;&#x548C;&#x6210;&#x5C31;&#xFF0C;&#x7763;&#x4FC3;&#x6211;&#x66F4;&#x4ED4;&#x7EC6;&#x66F4;&#x4F18;&#x79C0;&#x3002;&#x6211;&#x4F1A;&#x601D;&#x5FF5;&#x4ED6;&#x7684;&#x9762;&#x5BB9;&#xFF0C;&#x4ED6;&#x8D70;&#x5728;&#x6211;&#x8EAB;&#x8FB9;&#x65F6;&#x5FAE;&#x7B11;&#x7684;&#x6A21;&#x6837;&#x3002;&#x5E78;&#x597D;&#x6211;&#x4FDD;&#x5B58;&#x7740;&#x4ED6;&#x6240;&#x6709;&#x7684;&#x4FE1;&#x3002;</p>
<p>&#x9A6C;&#x5C14;&#x5B54;&#x6B7B;&#x540E;&#x4E00;&#x5E74;&#xFF0C;&#x56FE;&#x7075;&#x7684;&#x672A;&#x6765;&#x51B3;&#x5B9A;&#x4E86;&#xFF0C;&#x4ED6;&#x8981;&#x53BB;&#x5251;&#x6865;&#x56FD;&#x738B;&#x5B66;&#x9662;&#x5B66;&#x6570;&#x5B66;&#xFF0C;&#x5C31;&#x50CF;&#x7ED9;&#x9A6C;&#x5C14;&#x5B54;&#x592A;&#x592A;&#x7684;&#x4FE1;&#x91CC;&#x6240;&#x627F;&#x8BFA;&#x7684;&#xFF0C;&#x201C;&#x4EE5;&#x6B64;&#x7F05;&#x6000;&#x4ED6;&#x7684;&#x699C;&#x6837;&#x548C;&#x6210;&#x5C31;&#x3002;&#x201D;&#x8FD9;&#x4E00;&#x5E74;&#x4E2D;&#xFF0C;&#x65E0;&#x6570;&#x6B21;&#x5BF9;&#x9A6C;&#x5C14;&#x5B54;&#x7684;&#x54C0;&#x601D;&#x6050;&#x6015;&#x4E5F;&#x8BA9;&#x4ED6;&#x6E10;&#x6E10;&#x660E;&#x767D;&#x4E86;&#x6BD4;&#x53CB;&#x8C0A;&#x66F4;&#x6DF1;&#x7684;&#x611F;&#x60C5;&#x3002;&#x662F;&#x7231;&#x60C5;&#x5417;&#xFF1F;&#x56FE;&#x7075;&#x65E0;&#x6CD5;&#x56DE;&#x7B54;&#xFF0C;&#x4E5F;&#x4E0D;&#x5C51;&#x56DE;&#x7B54;&#x3002;&#x843D;&#x846C;&#x65E5;&#x90A3;&#x5C01;&#x75DB;&#x5207;&#x7684;&#x4FE1;&#xFF0C;&#x8FD8;&#x6709;&#x8FD9;&#x4E00;&#x5E74;&#x6765;&#xFF08;&#x4EE5;&#x53CA;&#x4ED6;&#x7684;&#x4F59;&#x751F;&#xFF09;&#x4E3A;&#x4E86;&#x7EAA;&#x5FF5;&#x9A6C;&#x5C14;&#x5B54;&#x800C;&#x7A81;&#x98DE;&#x731B;&#x8FDB;&#x7684;&#x5B66;&#x4E1A;&#x90FD;&#x8BF4;&#x660E;&#x4E86;&#x8FD9;&#x4EFD;&#x611F;&#x60C5;&#x6BD4;&#x7231;&#x60C5;&#x66F4;&#x9AD8;&#xFF1A;&#x4ED6;&#x5728;&#x7AED;&#x5C3D;&#x6240;&#x80FD;&#x633D;&#x7559;&#x6B7B;&#x8005;&#x3002;&#x53C8;&#x6709;&#x8C01;&#x4F1A;&#x4E3A;&#x90A3;&#x4E48;&#x7F8E;&#x597D;&#x7684;&#x611F;&#x60C5;&#x800C;&#x60CA;&#x614C;&#x5462;&#xFF1F;&#x4E8E;&#x662F;&#x56FE;&#x7075;&#x5766;&#x7136;&#x63A5;&#x53D7;&#x4E86;&#xFF0C;&#x5E76;&#x5728;&#x4F59;&#x751F;&#x4ECE;&#x672A;&#x8BD5;&#x56FE;&#x906E;&#x63A9;&#x81EA;&#x5DF1;&#x7684;&#x6027;&#x53D6;&#x5411;&#x3002;</p>
<p>##&#x4E09;&#x3001;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#x7684;&#x843D;&#x65E5;</p>
<p>&#x6BCF;&#x4E2A;&#x6E05;&#x6668;&#x548C;&#x9EC4;&#x660F;&#xFF0C;&#x56FE;&#x7075;&#x4E60;&#x60EF;&#x4E00;&#x4E2A;&#x4EBA;&#x6CBF;&#x7740;&#x6CB3;&#x8FB9;&#x957F;&#x8DD1;&#x601D;&#x8003;&#x95EE;&#x9898;&#x3002;&#x53BB;&#x5E74;&#x590F;&#x5929;&#xFF0C;&#x5F53;&#x4ED6;&#x8FD8;&#x5728;&#x5251;&#x6865;&#x56FD;&#x738B;&#x5B66;&#x9662;&#x8BFB;&#x672C;&#x79D1;&#xFF0C;&#x67D0;&#x6B21;&#x957F;&#x8DD1;&#x5230;&#x7CBE;&#x75B2;&#x529B;&#x7AED;&#x5730;&#x8EBA;&#x5012;&#x5728;&#x8349;&#x5730;&#x4E0A;&#xFF0C;&#x659C;&#x9633;&#x897F;&#x7167;&#xFF0C;&#x8FD0;&#x52A8;&#x8BA9;&#x4ED6;&#x795E;&#x601D;&#x51DD;&#x805A;&#xFF0C;&#x4ED6;&#x8111;&#x4E2D;&#x7ECF;&#x5386;&#x4E86;&#x4E00;&#x573A;&#x98CE;&#x66B4;&#xFF0C;&#x5FFD;&#x7136;&#x610F;&#x8BC6;&#x5230;&#x4E86;&#x56DE;&#x7B54;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#x5224;&#x5B9A;&#x95EE;&#x9898;&#xFF08;Entscheidungsproblem&#xFF09;&#x7684;&#x529E;&#x6CD5;&#x3002;&#x4ED6;&#x5174;&#x594B;&#x5730;&#x4E00;&#x8DC3;&#x800C;&#x8D77;&#x8DD1;&#x56DE;&#x5BDD;&#x5BA4;&#x5199;&#x4E0B;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x7EEA;&#x3002;&#x4ED6;&#x7684;&#x8EAB;&#x540E;&#xFF0C;&#x7167;&#x8000;&#x4E16;&#x754C;&#x6570;&#x5B66;&#x754C;&#x4E09;&#x5341;&#x4F59;&#x5E74;&#x4E4B;&#x4E45;&#x7684;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#x7684;&#x592A;&#x9633;&#xFF0C;&#x7EC8;&#x4E8E;&#x843D;&#x5C71;&#x4E86;&#x3002;</p>
<p>&#x5927;&#x536B;&#x2022;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#xFF0C;&#x90A3;&#x4E2A;&#x65F6;&#x4EE3;&#x6700;&#x53D7;&#x5C0A;&#x656C;&#x7684;&#x6570;&#x5B66;&#x5BB6;&#xFF0C;&#x51ED;&#x4E00;&#x5DF1;&#x4E4B;&#x529B;&#x4F7F;&#x6570;&#x5B66;&#x8D70;&#x4E0A;&#x4E86;&#x66F4;&#x4E25;&#x8C28;&#x7CFB;&#x7EDF;&#x7684;&#x73B0;&#x4EE3;&#x4E4B;&#x8DEF;&#x3002;1900&#x5E74;&#xFF0C;38&#x5C81;&#x7684;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#x5982;&#x4E00;&#x4F4D;&#x65B0;&#x4EFB;&#x7684;&#x6B66;&#x6797;&#x76DF;&#x4E3B;&#xFF0C;&#x632F;&#x81C2;&#x4E00;&#x547C;&#xFF0C;&#x56DB;&#x65B9;&#x54CD;&#x5E94;&#x3002;&#x4ED6;&#x5728;&#x56FD;&#x9645;&#x6570;&#x5B66;&#x5927;&#x4F1A;&#x4E0A;&#x63D0;&#x51FA;&#x4E86;&#x8457;&#x540D;&#x7684;&#x201C;&#x4E8C;&#x5341;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#x201D;&#xFF0C;&#x7ACB;&#x5373;&#x6210;&#x4E3A;&#x4E86;&#x6570;&#x5B66;&#x754C;&#x96C6;&#x4F53;&#x594B;&#x6597;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x7B2C;&#x516B;&#x4E2A;&#x95EE;&#x9898;&#x9ECE;&#x66FC;&#x731C;&#x60F3;/&#x54E5;&#x5FB7;&#x5DF4;&#x8D6B;&#x731C;&#x60F3;&#x66F4;&#x662F;&#x6210;&#x4E86;&#x6570;&#x5B66;&#x7684;&#x6842;&#x51A0;&#x3002;&#x4E8C;&#x5341;&#x516B;&#x5E74;&#x540E;&#xFF0C;&#x66AE;&#x5E74;&#x7684;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#x53C8;&#x63D0;&#x51FA;&#x4E86;&#x4E09;&#x4E2A;&#x6570;&#x7406;&#x903B;&#x8F91;&#x4E0A;&#x7684;&#x5927;&#x95EE;&#x9898;&#xFF0C;&#x7B80;&#x5355;&#x8BF4;&#x6765;&#x8FD9;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#x5206;&#x522B;&#x662F;&#xFF1A;1&#xFF09;&#x6570;&#x5B66;&#x662F;&#x5B8C;&#x5907;&#x7684;&#x5417;&#xFF1F;2&#xFF09;&#x6570;&#x5B66;&#x662F;&#x76F8;&#x5BB9;&#x7684;&#x5417;&#xFF1F;3&#xFF09;&#x6570;&#x5B66;&#x662F;&#x53EF;&#x5224;&#x5B9A;&#x7684;&#x5417;&#xFF1F;&#x5176;&#x4E2D;&#x7684;&#x7B2C;&#x4E09;&#x95EE;&#x9898;&#xFF0C;&#x5373;&#x88AB;&#x79F0;&#x4F5C;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#x7684;&#x5224;&#x5B9A;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x8BF4; 1900&#x5E74;&#x7684;&#x4E8C;&#x5341;&#x4E09;&#x4E2A;&#x96BE;&#x9898;&#x6D0B;&#x6EA2;&#x7740;&#x58EE;&#x5E74;&#x4EBA;&#x7684;&#x8E0C;&#x8E87;&#x6EE1;&#x5FD7;&#xFF0C;&#x90A3;&#x4E48;1928&#x5E74;&#x7684;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#x5DF2;&#x7ECF;&#x662F;&#x4E00;&#x4E2A;&#x8001;&#x4EBA;&#x5BF9;&#x79E9;&#x5E8F;&#x548C;&#x6761;&#x7406;&#x7684;&#x5411;&#x5F80;&#x3002;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#x5341;&#x5206;&#x5E0C;&#x671B;&#xFF0C;&#x8FD9;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x7B54;&#x6848;&#x90FD;&#x662F;&#x80AF;&#x5B9A;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x5C06;&#x4F7F;&#x6570;&#x5B66;&#x5EFA;&#x7ACB;&#x5728;&#x5B8C;&#x7F8E;&#x4E25;&#x8C28;&#x7684;&#x903B;&#x8F91;&#x7684;&#x57FA;&#x77F3;&#x4E0A;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E98;&#x53E4;&#x4E0D;&#x53D8;&#x7684;&#x771F;&#x7406;&#x5B58;&#x5728;&#x3002;</p>
<p>&#x53EF;&#x60DC;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E95;&#x4E95;&#x6709;&#x6761;&#x7684;&#x903B;&#x8F91;&#x7F8E;&#x68A6;&#x53EA;&#x505A;&#x4E86;&#x4E09;&#x5E74;&#xFF0C;&#x5E74;&#x8F7B;&#x7684;&#x5965;&#x5730;&#x5229;&#x4EBA;&#x54E5;&#x5FB7;&#x5C14;&#x5C31;&#x53D1;&#x8868;&#x4E86;&#x9707;&#x60CA;&#x6570;&#x5B66;&#x754C;&#x7684;&#x54E5;&#x5FB7;&#x5C14;&#x4E0D;&#x5B8C;&#x5907;&#x5B9A;&#x7406;&#xFF1A;&#x6570;&#x5B66;&#x4E0D;&#x53EF;&#x80FD;&#x65E2;&#x662F;&#x5B8C;&#x5907;&#x7684;&#x53C8;&#x662F;&#x76F8;&#x5BB9;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x5B9A;&#x7406;&#x4EE5;&#x5341;&#x5206;&#x6709;&#x8DA3;&#x7684;&#x5F62;&#x5F0F;&#x5426;&#x5B9A;&#x4E86;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;1928&#x5E74;&#x7684;&#x7B2C;&#x4E00;&#x548C;&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x5230;1935&#x5E74;&#x590F;&#x5929;&#xFF0C;&#x8EBA;&#x5728;&#x8349;&#x5730;&#x4E0A;&#x4F11;&#x606F;&#x7684;&#x56FE;&#x7075;&#x7ECF;&#x5386;&#x4E86;&#x4E00;&#x573A;&#x5934;&#x8111;&#x98CE;&#x66B4;&#xFF0C;&#x4ED6;&#x60F3;&#x5230;&#x4E86;&#x5426;&#x5B9A;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#x7B2C;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x529E;&#x6CD5;&#xFF1A;&#x7528;&#x673A;&#x5668;&#x3002;&#x4ED6;&#x60F3;&#x8C61;&#x7740;&#x4E00;&#x79CD;&#x865A;&#x6784;&#x7684;&#x201C;&#x56FE;&#x7075;&#x673A;&#x201D;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x4E00;&#x6761;&#x65E0;&#x9650;&#x957F;&#x7684;&#x7EB8;&#x5E26;&#x5B50;&#x4E0A;&#x7684;&#x8BFB;&#x53D6;&#x547D;&#x4EE4;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x4ECE;&#x800C;&#x6A21;&#x62DF;&#x4EBA;&#x7C7B;&#x6240;&#x53EF;&#x80FD;&#x8FDB;&#x884C;&#x7684;&#x4EFB;&#x4F55;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x3002;&#x56FE;&#x7075;&#x8BC1;&#x660E;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x7528;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x6765;&#x5224;&#x5B9A;&#x4E00;&#x53F0;&#x7ED9;&#x5B9A;&#x7684;&#x56FE;&#x7075;&#x673A;&#x662F;&#x5426;&#x4F1A;&#x505C;&#x673A;&#xFF0C;&#x6240;&#x4EE5;&#x505C;&#x673A;&#x95EE;&#x9898;&#x662F;&#x4E00;&#x4E2A;&#x65E0;&#x6CD5;&#x5224;&#x5B9A;&#x7684;&#x6570;&#x5B66;&#x95EE;&#x9898;&#xFF0C;&#x5373;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#x7684;&#x7B2C;&#x4E09;&#x4E2A;&#x547D;&#x9898;&#x7B54;&#x6848;&#x4E3A;&#x5426;&#x3002;</p>
<p>&#x5DE7;&#x5408;&#x7684;&#x662F;&#xFF0C;&#x7B2C;&#x4E8C;&#x5E74;&#x6625;&#x5929;&#xFF0C;&#x6B63;&#x5F53;&#x56FE;&#x7075;&#x628A;&#x5173;&#x4E8E;&#x5224;&#x5B9A;&#x95EE;&#x9898;&#x7684;&#x8BBA;&#x6587;&#x521D;&#x7A3F;&#x4EA4;&#x7ED9;&#x5BFC;&#x5E08;&#x7EBD;&#x66FC;(Max Newman)&#x8FC7;&#x76EE;&#x65F6;&#xFF0C;&#x5927;&#x6D0B;&#x5F7C;&#x5CB8;&#xFF0C;&#x666E;&#x6797;&#x65AF;&#x987F;&#x5927;&#x5B66;&#x7684;&#x963F;&#x9686;&#x4F50;&#x2022;&#x90B1;&#x5947;(Alonzo Church)&#x6559;&#x6388;&#x2014;&#x2014;&#x903B;&#x8F91;&#x754C;&#x6570;&#x4E00;&#x6570;&#x4E8C;&#x7684;&#x5B66;&#x8005;&#x2014;&#x2014;&#x62A2;&#x5148;&#x4E00;&#x6B65;&#x53D1;&#x8868;&#x4E86;&#x65B0;&#x8BBA;&#x6587;&#xFF0C;&#x5229;&#x7528;&#x81EA;&#x521B;&#x7684;&#x3BB;&#x6F14;&#x7B97;(lambda calculus)&#x5426;&#x5B9A;&#x4E86;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#x5224;&#x5B9A;&#x95EE;&#x9898;&#x3002;&#x770B;&#x5230;&#x90B1;&#x5947;&#x5982;&#x6B64;&#x5DE7;&#x5408;&#x7684;&#x8BBA;&#x6587;&#xFF0C;&#x5BFC;&#x5E08;&#x7EBD;&#x66FC;&#x987A;&#x6C34;&#x63A8;&#x821F;&#x5199;&#x4FE1;&#x63A8;&#x8350;&#x56FE;&#x7075;&#x53BB;&#x505A;&#x535A;&#x58EB;&#x751F;&#x3002;1936&#x5E74;&#x590F;&#xFF0C;&#x90B1;&#x5947;&#x7684;&#x65B0;&#x535A;&#x58EB;&#x751F;&#x56FE;&#x7075;&#x6765;&#x5230;&#x4E86;&#x666E;&#x6797;&#x65AF;&#x987F;&#x3002;</p>
<p><img src="http://img3.douban.com/view/note/large/public/p221426825-4.jpg" alt="&#x56FE;&#x7075;&#x5728;&#x666E;&#x6797;&#x65AF;&#x987F;&#x5927;&#x5B66;&#x7684;&#x6863;&#x6848; Firestone Library, Princeton University, June 2012"></p>
<p>11&#x6708;&#xFF0C;&#x56FE;&#x7075;&#x5173;&#x4E8E;&#x5224;&#x5B9A;&#x95EE;&#x9898;&#x7684;&#x8BBA;&#x6587;&#xFF0C;&#x5373;&#x591A;&#x5E74;&#x540E;&#x5C06;&#x58F0;&#x540D;&#x5927;&#x566A;&#x7684; On Computable Numbers, with an Application to the Entscheidungsproblem &#x7EC8;&#x4E8E;&#x53D1;&#x8868;&#xFF0C;&#x5B66;&#x754C;&#x53CD;&#x5E94;&#x6781;&#x5176;&#x51B7;&#x6DE1;&#x3002;12&#x6708;&#x56FE;&#x7075;&#x5728;&#x666E;&#x6797;&#x65AF;&#x987F;&#x6570;&#x5B66;&#x4FF1;&#x4E50;&#x90E8;&#x505A;&#x4E86;&#x5173;&#x4E8E;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x7684;&#x6F14;&#x8BB2;&#xFF0C;&#x542C;&#x4F17;&#x4E0D;&#x8DB3;&#x5341;&#x4EBA;&#x3002;&#x8FD9;&#x7BC7;&#x89E3;&#x51B3;&#x4E86;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#x7B2C;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x8BBA;&#x6587;&#x4E3A;&#x4F55;&#x906D;&#x5230;&#x5982;&#x6B64;&#x51B7;&#x9047;&#xFF1F;&#x6709;&#x51E0;&#x4E2A;&#x539F;&#x56E0;&#xFF1A;&#x5176;&#x4E00;&#xFF0C;&#x54E5;&#x5FB7;&#x5C14;&#x4E0D;&#x5B8C;&#x5907;&#x5B9A;&#x7406;&#x5982;&#x6B64;&#x6709;&#x8DA3;&#x5965;&#x5999;&#xFF0C;&#x5DF2;&#x7ECF;&#x5438;&#x5F15;&#x8D70;&#x4E86;&#x5B66;&#x754C;&#x5173;&#x4E8E;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#x4E09;&#x95EE;&#x9898;&#x7684;&#x5927;&#x90E8;&#x5206;&#x5174;&#x8DA3;&#xFF1B;&#x5176;&#x4E8C;&#xFF0C;&#x90B1;&#x5947;&#x5F53;&#x5E74;&#x6625;&#x5929;&#x7684;&#x8BBA;&#x6587;&#x5DF2;&#x7ECF;&#x7387;&#x5148;&#x89E3;&#x51B3;&#x4E86;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#x5224;&#x5B9A;&#x95EE;&#x9898;&#xFF0C;&#x867D;&#x7136;&#x56FE;&#x7075;&#x7684;&#x89E3;&#x6CD5;&#x5929;&#x5DEE;&#x5730;&#x522B;&#xFF0C;&#x4E5F;&#x6BD4;&#x90B1;&#x5947;&#x7684;&#x89E3;&#x6CD5;&#x7B80;&#x6D01;&#x5F97;&#x591A;&#xFF1B;&#x5176;&#x4E09;&#xFF0C;&#x7528;&#x201C;&#x673A;&#x5668;&#x201D;&#x89E3;&#x51B3;&#x6570;&#x7406;&#x903B;&#x8F91;&#x95EE;&#x9898;&#xFF0C;&#x5B9E;&#x5219;&#x662F;&#x6B64;&#x7BC7;&#x8BBA;&#x6587;&#x6700;&#x95EA;&#x5149;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x53EF;&#x662F;&#x8FC7;&#x4E8E;&#x65B0;&#x9896;&#xFF0C;&#x4E0D;&#x5BB9;&#x6613;&#x88AB;&#x4E3B;&#x6D41;&#x5B66;&#x754C;&#x63A5;&#x53D7;&#xFF1B;&#x5176;&#x56DB;&#xFF0C;&#x6050;&#x6015;&#x4E5F;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x539F;&#x56E0;&#xFF1A;&#x548C;&#x8457;&#x540D;&#x6559;&#x6388;&#x90B1;&#x5947;&#x6BD4;&#x8D77;&#x6765;&#xFF0C;&#x56FE;&#x7075;&#x624D;&#x521D;&#x51FA;&#x8305;&#x5E90;&#x3002;&#x4ED6;&#x5728;&#x5BB6;&#x4E66;&#x4E2D;&#x6124;&#x6124;&#x8BF4;&#xFF1A;&#x201C;&#x53EA;&#x6709;&#x540D;&#x4EBA;&#x624D;&#x4F1A;&#x5438;&#x5F15;&#x542C;&#x4F17;&#x3002;(One should have a reputation if one hopes to be listened to.)&#x201D;</p>
<p>&#x4E0D;&#xFF0C;&#x4E0D;&#x5B8C;&#x5168;&#x5982;&#x6B64;&#x3002;&#x81F3;&#x5C11;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x4EBA;&#x4F1A;&#x8BA4;&#x771F;&#x9605;&#x8BFB;&#x65E0;&#x540D;&#x5C0F;&#x5352;&#x7684;&#x8BBA;&#x6587;&#x3002;&#x5BF9;&#x95E8;&#x529E;&#x516C;&#x5BA4;&#x7684;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x6559;&#x6388;&#x2014;&#x2014;&#x56FE;&#x7075;&#x9ED8;&#x9ED8;&#x4EF0;&#x6155;&#x53C8;&#x7F9E;&#x4E8E;&#x5F00;&#x53E3;&#x7684;&#x5076;&#x50CF;&#x2014;&#x2014;&#x4E0D;&#x4F46;&#x8BA4;&#x771F;&#x8BFB;&#x8FC7;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#xFF0C;&#x8FD8;&#x8BFB;&#x8FC7;&#x6240;&#x6709;&#x671F;&#x520A;&#x4E0A;&#x7684;&#x6240;&#x6709;&#x8BBA;&#x6587;&#x3002;&#x4ED6;&#x662F;&#x4E00;&#x672C;&#x96C4;&#x5FC3;&#x52C3;&#x52C3;&#x7684;&#x767E;&#x79D1;&#x5168;&#x4E66;&#xFF0C;&#x4EFB;&#x4F55;&#x4EBA;&#x7684;&#x4EFB;&#x4F55;&#x77E5;&#x8BC6;&#x90FD;&#x9003;&#x4E0D;&#x51FA;&#x4ED6;&#x7684;&#x6CD5;&#x773C;&#x3002;&#x56FE;&#x7075;&#x7684;&#x8BBA;&#x6587;&#x4E00;&#x53D1;&#x8868;&#xFF0C;&#x654F;&#x9510;&#x7684;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x5DF2;&#x7ECF;&#x55C5;&#x5230;&#x4E86;&#x56FE;&#x7075;&#x673A;&#x5E7F;&#x9614;&#x7684;&#x8FDC;&#x666F;&#xFF0C;&#x4ED6;&#x5BF9;&#x670B;&#x53CB;&#x8BF4;&#xFF0C;&#x4F60;&#x8BE5;&#x53BB;&#x627E;&#x6211;&#x5BF9;&#x95E8;&#x7684;&#x56FE;&#x7075;&#xFF0C;&#x4ED6;&#x90A3;&#x7BC7;&#x8BBA;&#x6587;&#x6B63;&#x597D;&#x53EF;&#x4EE5;&#x505A;&#x8FD9;&#x6837;&#x90A3;&#x6837;&#x7684;&#x4E8B;&#x3002;&#x4ED6;&#x6177;&#x6168;&#x5730;&#x7ED9;&#x670B;&#x53CB;&#x5EFA;&#x8BAE;&#xFF0C;&#x81EA;&#x5DF1;&#x5374;&#x6CA1;&#x4EB2;&#x81EA;&#x627E;&#x56FE;&#x7075;&#x804A;&#x804A;&#x3002;&#x4ED6;&#x7684;&#x6CE8;&#x610F;&#x529B;&#x5728;&#x6709;&#x8DA3;&#x7684;&#x56FE;&#x7075;&#x673A;&#x4E0A;&#x505C;&#x7559;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x53C8;&#x8DF3;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x622A;&#x7136;&#x4E0D;&#x540C;&#x5374;&#x540C;&#x6837;&#x6709;&#x8DA3;&#x7684;&#x95EE;&#x9898;&#x4E0A;&#xFF1A;&#x91CF;&#x5B50;&#x529B;&#x5B66;&#x3001;&#x6D41;&#x4F53;&#x529B;&#x5B66;&#x3001;&#x535A;&#x5F08;&#x8BBA;&#x2026;&#x2026;&#x4E16;&#x4E0A;&#x5343;&#x5343;&#x4E07;&#x7684;&#x95EE;&#x9898;&#x90FD;&#x5438;&#x5F15;&#x7740;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#xFF0C;&#x4ED6;&#x8111;&#x4E2D;&#x6709;&#x5343;&#x5343;&#x4E07;&#x8981;&#x5B9E;&#x884C;&#x7684;&#x8BA1;&#x5212;&#x2014;&#x2014;&#x56FE;&#x7075;&#x673A;&#x4E0D;&#x8FC7;&#x662F;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x3002;</p>
<p>&#x53EF;&#x662F;&#xFF0C;&#x535A;&#x58EB;&#x751F;&#x56FE;&#x7075;&#x4ECD;&#x7136;&#x56E0;&#x4E3A;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x800C;&#x7ED9;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x6559;&#x6388;&#x7559;&#x4E0B;&#x4E86;&#x5370;&#x8C61;&#xFF0C;&#x4E24;&#x5E74;&#x540E;&#x56FE;&#x7075;&#x4ECE;&#x666E;&#x6797;&#x65AF;&#x987F;&#x535A;&#x58EB;&#x6BD5;&#x4E1A;&#xFF0C;&#x662F;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x6559;&#x6388;&#x552F;&#x4E00;&#x63D0;&#x51FA;&#x4E86;&#x633D;&#x7559;&#xFF1A;&#x5E74;&#x85AA;&#x4E00;&#x5343;&#x4E94;&#x767E;&#x7F8E;&#x5143;&#x8058;&#x56FE;&#x7075;&#x505A;&#x81EA;&#x5DF1;&#x7684;&#x52A9;&#x624B;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x5E74;&#x8F7B;&#x7684;&#x6570;&#x5B66;&#x5BB6;&#xFF0C;&#x80FD;&#x5E08;&#x4ECE;&#x4F20;&#x5947;&#x822C;&#x7684;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x6559;&#x6388;&#x662F;&#x68A6;&#x5BD0;&#x4EE5;&#x6C42;&#x7684;&#x673A;&#x9047;&#xFF0C; &#x4E00;&#x5343;&#x4E94;&#x767E;&#x7F8E;&#x5143;&#x7684;&#x85AA;&#x6C34;&#x4E5F;&#x6BD4;&#x56FE;&#x7075;&#x5728;&#x82F1;&#x56FD;&#x80FD;&#x627E;&#x5230;&#x7684;&#x6559;&#x804C;&#x5F85;&#x9047;&#x597D;&#x5F97;&#x591A;&#x3002;&#x56FE;&#x7075;&#x62FF;&#x7740;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x7684;&#x8058;&#x4E66;&#x5728;&#x666E;&#x6797;&#x65AF;&#x987F;&#x6821;&#x56ED;&#x91CC;&#x6643;&#x8361;&#xFF0C;&#x7406;&#x6027;&#x4F7F;&#x4ED6;&#x4E0D;&#x5F97;&#x4E0D;&#x597D;&#x597D;&#x8003;&#x8651;&#x8FD9;&#x4E2A;&#x5343;&#x8F7D;&#x96BE;&#x9022;&#x7684;&#x80A5;&#x7F3A;&#xFF0C;&#x53EF;&#x662F;&#x554A;&#x2014;&#x2014;&#x82F1;&#x56FD;&#x4EBA;&#x56FE;&#x7075;&#x5438;&#x5438;&#x9F3B;&#x5B50;&#xFF0C;&#x9F3B;&#x5B50;&#x91CC;&#x547C;&#x5230;&#x7684;&#x7A7A;&#x6C14;&#x6709;&#x70B9;&#x592A;&#x7C97;&#x9119;&#xFF0C;&#x6E05;&#x6E05;&#x8033;&#x6735;&#xFF0C;&#x8033;&#x6735;&#x91CC;&#x542C;&#x5230;&#x7684;&#x82F1;&#x8BED;&#x6709;&#x70B9;&#x592A;&#x61D2;&#x6563;&#x3002;&#x4ED6;&#x8D70;&#x8FC7;&#x54E5;&#x7279;&#x5F0F;&#x7684;&#x666E;&#x6797;&#x65AF;&#x987F;&#x6821;&#x793C;&#x62DC;&#x5802;&#xFF0C;&#x90A3;&#x53EA;&#x662F;&#x66F4;&#x52A0;&#x5B8F;&#x4F1F;&#x53E4;&#x8001;&#x7684;&#x5251;&#x6865;&#x56FD;&#x738B;&#x5B66;&#x9662;&#x793C;&#x62DC;&#x5802;&#x8E69;&#x811A;&#x7684;&#x590D;&#x5236;&#x54C1;&#x3002;&#x793C;&#x62DC;&#x5802;&#x7684;&#x5C16;&#x9876;&#x63D2;&#x5165;&#x65B0;&#x6CFD;&#x897F;&#x5DDE;&#x7684;&#x84DD;&#x5929;&#x767D;&#x4E91;&#xFF0C;&#x82F1;&#x56FD;&#x4EBA;&#x56FE;&#x7075;&#x5374;&#x6CA1;&#x6CD5;&#x6B23;&#x8D4F;&#x8FD9;&#x513F;&#x7684;&#x6674;&#x7A7A;&#x4E07;&#x91CC;&#xFF0C;&#x4ED6;&#x7684;&#x76EE;&#x5149;&#x8D8A;&#x5230;&#x4E86;&#x5927;&#x897F;&#x6D0B;&#x5F7C;&#x5CB8;&#xFF0C;&#x90A3;&#x91CC;&#xFF0C;&#x7EB3;&#x7CB9;&#x7684;&#x9634;&#x4E91;&#x5BC6;&#x5E03;&#x6B27;&#x6D32;&#x3002;</p>
<p>1938&#x5E74;&#x590F;&#xFF0C;&#x535A;&#x58EB;&#x6BD5;&#x4E1A;&#x7684;&#x56FE;&#x7075;&#x5FE7;&#x5FC3;&#x5FE1;&#x5FE1;&#x56DE;&#x5230;&#x82F1;&#x56FD;&#x5251;&#x6865;&#xFF0C;&#x5728;&#x6570;&#x5B66;&#x7CFB;&#x505A;&#x4E00;&#x5B66;&#x671F;&#x624D;&#x7ED9;&#x5341;&#x82F1;&#x9551;&#x7684;&#x4E34;&#x65F6;&#x6559;&#x5458;&#xFF0C;&#x6559;&#x4E00;&#x95E8;&#x542C;&#x8005;&#x5BE5;&#x5BE5;&#x7684;&#x201C;&#x6570;&#x5B66;&#x57FA;&#x7840;&#x201D;&#x3002;&#x4ED6;&#x5C06;&#x6162;&#x6162;&#x6500;&#x722C;&#x5B66;&#x672F;&#x7684;&#x68AF;&#x5B50;&#xFF0C;&#x6210;&#x4E3A;&#x6559;&#x5458;&#x3001;&#x8BB2;&#x5E08;&#x3001;&#x526F;&#x6559;&#x6388;&#x3001;&#x6559;&#x6388;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x51FA;&#x610F;&#x5916;&#x7684;&#x8BDD;&#x3002;&#x4E5D;&#x4E2A;&#x6708;&#x540E;&#xFF0C;&#x610F;&#x5916;&#x964D;&#x4E34;&#xFF1A;&#x7EB3;&#x7CB9;&#x7684;&#x9634;&#x4E91;&#x7EC8;&#x4E8E;&#x9AA4;&#x964D;&#x6210;&#x72C2;&#x98CE;&#x66B4;&#x96E8;&#xFF0C;&#x5FB7;&#x56FD;&#x5165;&#x4FB5;&#x6CE2;&#x5170;&#xFF0C;&#x7B2C;&#x4E8C;&#x6B21;&#x4E16;&#x754C;&#x5927;&#x6218;&#x5F00;&#x59CB;&#x3002;</p>
<p>##&#x56DB;&#x3001;Station X. Site Y.</p>
<p>&#x4E8C;&#x6218;&#x7684;&#x7206;&#x53D1;&#x7ED9;&#x767D;&#x91D1;&#x6C49;&#x90E1;&#x7684;&#x5E03;&#x83B1;&#x5207;&#x5229;&#x9547;&#x5E26;&#x6765;&#x4E86;&#x70B9;&#x53EF;&#x559C;&#x7684;&#x65B0;&#x9C9C;&#xFF0C;&#x4E00;&#x4E07;&#x591A;&#x4EBA;&#x8FDE;&#x591C;&#x4ECE;&#x5927;&#x57CE;&#x5E02;&#x6324;&#x706B;&#x8F66;&#x9003;&#x96BE;&#x5230;&#x8FD9;&#x4E2A;&#x5E73;&#x5EB8;&#x4E4F;&#x5473;&#x7684;&#x5C0F;&#x9547;&#xFF0C;&#x53EF;&#x662F;&#x4E0D;&#x4E45;&#x5927;&#x90E8;&#x5206;&#x53C8;&#x6324;&#x706B;&#x8F66;&#x56DE;&#x53BB;&#x4E86;&#xFF1A;&#x5B81;&#x613F;&#x88AB;&#x70B8;&#x5F39;&#x70B8;&#x6B7B;&#xFF0C;&#x4E5F;&#x4E0D;&#x8981;&#x5728;&#x8FD9;&#x5C0F;&#x5730;&#x65B9;&#x65E0;&#x804A;&#x6B7B;&#x3002;&#x827E;&#x4F26;&#x2022;&#x56FE;&#x7075;&#x5374;&#x9006;&#x7740;&#x4EBA;&#x6F6E;&#xFF0C;&#x642C;&#x5230;&#x4E86;&#x8FD9;&#x65E0;&#x804A;&#x5C0F;&#x9547;&#x6700;&#x65E0;&#x804A;&#x90CA;&#x533A;&#x7684;&#x4E00;&#x5BB6;&#x6700;&#x6700;&#x65E0;&#x804A;&#x7684;&#x5C0F;&#x65C5;&#x9986;&#x91CC;&#xFF0C;&#x6BCF;&#x5929;&#x9A91;&#x8F66;&#x4E09;&#x82F1;&#x91CC;&#x53BB;&#x9547;&#x4E2D;&#x5FC3;&#x7684;&#x5E03;&#x83B1;&#x5207;&#x5229;&#x56ED;(Bletchley Park)&#x4E0A;&#x4E00;&#x4E2A;&#x8C01;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x5728;&#x778E;&#x641E;&#x4EC0;&#x4E48;&#x7684;&#x73ED;&#xFF0C;&#x4E0B;&#x73ED;&#x56DE;&#x6765;&#x8FD8;&#x81EA;&#x613F;&#x7ED9;&#x51B7;&#x51B7;&#x6E05;&#x6E05;&#x7684;&#x65C5;&#x9986;&#x9152;&#x5427;&#x6253;&#x6742;&#x3002;&#x65C5;&#x9986;&#x8001;&#x677F;&#x5A18;&#x770B;&#x7740;&#x8FD9;&#x4E2A;&#x95F2;&#x5F97;&#x53D1;&#x614C;&#x7684;&#x5C0F;&#x4F19;&#x76F4;&#x6447;&#x5934;&#xFF1A;&#x5065;&#x5065;&#x5EB7;&#x5EB7;&#x7684;&#x5927;&#x7537;&#x4EBA;&#xFF0C;&#x600E;&#x4E48;&#x4E0D;&#x53BB;&#x6253;&#x4ED7;&#x5462;&#xFF1F;</p>
<p>&#x53EF;&#x662F;&#xFF0C;&#x56FE;&#x7075;&#x6B63;&#x5728;&#x6253;&#x4ED7;&#x3002;&#x4ED6;&#x7684;&#x654C;&#x4EBA;&#xFF1A;&#x54D1;&#x8C1C;&#x3002;&#x770B;&#x4F3C;&#x6B7B;&#x6C34;&#x4E00;&#x6F6D;&#x7684;&#x5E03;&#x83B1;&#x5207;&#x5229;&#x56ED;&#xFF0C;&#x6B64;&#x65F6;&#x5DF2;&#x6709;&#x4E86;&#x519B;&#x4E8B;&#x4EE3;&#x53F7;&#xFF1A;Station X&#xFF0C;&#x4FDD;&#x5BC6;&#x7B49;&#x7EA7;&#xFF1A;&#x7EDD;&#x5BC6;&#x3002;&#x8FD9;&#x91CC;&#x662F;&#x82F1;&#x56FD;&#x653F;&#x5E9C;&#x5BC6;&#x7801;&#x5B66;&#x6821;&#x7684;&#x9A7B;&#x5730;&#xFF0C;&#x6D77;&#x9646;&#x7A7A;&#x548C;&#x519B;&#x60C5;&#x516D;&#x5904;&#x7684;&#x60C5;&#x62A5;&#x7EC4;&#x7EC7;&#x5404;&#x5360;&#x4E00;&#x9685;&#x3002;&#x51E0;&#x767E;&#x540D;&#x5DE5;&#x4F5C;&#x4EBA;&#x5458;&#x65E5;&#x591C;&#x517C;&#x7A0B;&#x7834;&#x89E3;&#x5FB7;&#x56FD;&#x4EBA;&#x7684;&#x65E0;&#x7EBF;&#x7535;&#x62A5;&#xFF0C;&#x4E3A;&#x4E86;&#x6700;&#x5927;&#x7A0B;&#x5EA6;&#x4FDD;&#x5BC6;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x804C;&#x5458;&#x6839;&#x672C;&#x4E0D;&#x77E5;&#x9053;&#x5DE5;&#x4F5C;&#x7684;&#x771F;&#x6B63;&#x76EE;&#x7684;&#xFF0C;&#x9664;&#x4E86;&#x51E0;&#x4E2A;&#x6838;&#x5FC3;&#x89E3;&#x5BC6;&#x6210;&#x5458;&#xFF1A;&#x8C61;&#x68CB;&#x51A0;&#x519B;&#x3001;&#x586B;&#x5B57;&#x6E38;&#x620F;&#x9AD8;&#x624B;&#x3001;&#x6570;&#x5B66;&#x5BB6;&#x3002;&#x4E8C;&#x5341;&#x4E03;&#x5C81;&#x7684;&#x56FE;&#x7075;&#x5F88;&#x5FEB;&#x5728;&#x8FD9;&#x4E2A;&#x6838;&#x5FC3;&#x56E2;&#x961F;&#x91CC;&#x6709;&#x4E86;&#x7EF0;&#x53F7;&#xFF1A;&#x6559;&#x6388;(Prof.)&#x3002;</p>
<p>&#x6B64;&#x65F6;&#x7684;&#x6B27;&#x6D32;&#x4E0A;&#x7A7A;&#xFF0C;&#x65E0;&#x6570;&#x6765;&#x81EA;&#x5FB7;&#x519B;&#x7684;&#x7535;&#x6CE2;&#x6B63;&#x4EE5;&#x83AB;&#x5C14;&#x65AF;&#x7801;&#x7684;&#x5F62;&#x5F0F;&#x7A7F;&#x68AD;&#x6765;&#x56DE;&#x3002;&#x8FD9;&#x4E9B;&#x83AB;&#x5C14;&#x65AF;&#x7801;&#x53D1;&#x51FA;&#x524D;&#x7531;&#x4E00;&#x79CD;&#x79F0;&#x4F5C;&#x201C;&#x54D1;&#x8C1C;&#x673A;&#x201D;(the Enigma Machine)&#x7684;&#x52A0;&#x5BC6;&#x5668;&#x52A0;&#x5BC6;&#xFF0C;&#x5728;&#x63A5;&#x53D7;&#x65B9;&#x53C8;&#x7531;&#x540C;&#x6837;&#x7684;&#x201C;&#x54D1;&#x8C1C;&#x673A;&#x201D;&#x89E3;&#x5BC6;&#x3002;&#x76F4;&#x5230;&#x4E8C;&#x6218;&#x7ED3;&#x675F;&#xFF0C;&#x5FB7;&#x519B;&#x4ECE;&#x672A;&#x6000;&#x7591;&#x8FC7;&#x54D1;&#x8C1C;&#x673A;&#x7684;&#x575A;&#x4E0D;&#x53EF;&#x6467;&#xFF0C;&#x6240;&#x6709;&#x519B;&#x79CD;&#x6240;&#x6709;&#x7EA7;&#x522B;&#x7535;&#x62A5;&#xFF0C;&#x4E00;&#x5F8B;&#x7528;&#x54D1;&#x8C1C;&#x673A;&#x52A0;&#x5BC6;&#xFF0C;&#x52A0;&#x5BC6;&#x7535;&#x62A5;&#x4E2D;&#x653E;&#x5FC3;&#x5927;&#x80C6;&#x5730;&#x6C9F;&#x901A;&#x4E86;&#x6240;&#x6709;&#x519B;&#x4E8B;&#x4FE1;&#x606F;&#xFF1A;&#x6F5C;&#x8247;&#x4F4D;&#x7F6E;&#x3001;&#x519B;&#x961F;&#x4EBA;&#x6570;&#x3001;&#x653B;&#x51FB;&#x8DEF;&#x7EBF;&#x3001;&#x4F24;&#x4EA1;&#x62A5;&#x544A;&#x2026;&#x2026;</p>
<p><img src="http://img3.douban.com/view/note/large/public/p221426825-5.jpg" alt="&#x54D1;&#x8C1C;&#x673A;"></p>
<p>&#x5FB7;&#x519B;&#x7684;&#x4FE1;&#x5FC3;&#x6E90;&#x4E8E;&#x54D1;&#x8C1C;&#x673A;&#x590D;&#x6742;&#x7684;&#x52A0;&#x5BC6;&#x65B9;&#x6CD5;&#x3002;&#x867D;&#x7136;&#x6BCF;&#x4E2A;&#x519B;&#x79CD;&#x5BF9;&#x5546;&#x7528;&#x7684;&#x54D1;&#x8C1C;&#x673A;&#x90FD;&#x7565;&#x6709;&#x6539;&#x8FDB;&#xFF0C;&#x4E0D;&#x8FC7;&#x6240;&#x6709;&#x54D1;&#x8C1C;&#x673A;&#x57FA;&#x672C;&#x6784;&#x9020;&#x76F8;&#x540C;&#xFF1A;&#x952E;&#x76D8;&#x3001;&#x63A5;&#x7EBF;&#x677F;&#x3001;&#x591A;&#x4E2A;&#x8F6C;&#x5B50;&#x3001;&#x6307;&#x793A;&#x706F;&#x3002;&#x5F53;&#x5BC6;&#x7801;&#x64CD;&#x4F5C;&#x5458;&#x5728;&#x952E;&#x76D8;&#x4E0A;&#x6309;&#x4E0B;&#x4E00;&#x4E2A;&#x5B57;&#x6BCD;&#xFF08;&#x6BD4;&#x5982;&#x5B57;&#x6BCD;A&#xFF09;&#xFF0C;&#x7535;&#x6D41;&#x4F1A;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x53EF;&#x81EA;&#x884C;&#x6539;&#x63A5;&#x7684;&#x63A5;&#x7EBF;&#x677F;&#xFF0C;&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x6216;&#x8005;&#x591A;&#x4E2A;&#x8F6C;&#x5B50;&#x8F6C;&#x52A8;&#xFF0C;&#x540C;&#x65F6;&#x70B9;&#x4EAE;&#x67D0;&#x4E2A;&#x5B57;&#x6BCD;&#x6307;&#x793A;&#x706F;&#xFF08;&#x6BD4;&#x5982;&#x5B57;&#x6BCD;L&#xFF09;&#xFF0C;&#x4E8E;&#x662F;&#x5B57;&#x6BCD;A&#x88AB;&#x52A0;&#x5BC6;&#x6210;&#x5B57;&#x6BCD;L&#x3002;&#x54D1;&#x8C1C;&#x673A;&#x7CBE;&#x5DE7;&#x7684;&#x8BBE;&#x8BA1;&#x4F7F;&#x5F97;&#xFF0C;&#x5728;&#x4E0B;&#x4E00;&#x6B21;&#x6309;&#x4E0B;&#x5B57;&#x6BCD;A&#x65F6;&#xFF0C;&#x5B83;&#x5C06;&#x88AB;&#x52A0;&#x5BC6;&#x6210;&#x53E6;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5B57;&#x6BCD;&#xFF08;&#x6BD4;&#x5982;&#x5B57;&#x6BCD;P&#xFF09;&#x3002;&#x66F4;&#x5DE7;&#x5999;&#x7684;&#x662F;&#xFF0C;&#x5F53;&#x4E14;&#x4EC5;&#x5F53;&#x53D1;&#x9001;&#x7AEF;&#x548C;&#x63A5;&#x6536;&#x7AEF;&#x7684;&#x54D1;&#x8C1C;&#x673A;&#x62E5;&#x6709;&#x540C;&#x6837;&#x7684;&#x521D;&#x59CB;&#x8BBE;&#x5B9A;&#xFF08;&#x540C;&#x6837;&#x7684;&#x63A5;&#x7EBF;&#x677F;&#x3001;&#x540C;&#x6837;&#x7684;&#x8F6C;&#x5B50;&#x6392;&#x5217;&#x3001;&#x540C;&#x6837;&#x7684;&#x8F6C;&#x5B50;&#x521D;&#x59CB;&#x4F4D;&#x7F6E;&#xFF09;&#xFF0C;&#x5BC6;&#x7801;L&#x624D;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x63A5;&#x6536;&#x7AEF;&#x7684;&#x54D1;&#x8C1C;&#x673A;&#x8FD8;&#x539F;&#x6210;A&#x3002;&#x800C;&#x5BF9;&#x4E8E;&#x4E0D;&#x77E5;&#x9053;&#x521D;&#x59CB;&#x8BBE;&#x5B9A;&#x7684;&#x654C;&#x65B9;&#xFF0C;&#x4ED6;&#x4EEC;&#x9762;&#x5BF9;&#x7684;&#x53EF;&#x80FD;&#x60C5;&#x51B5;&#x591A;&#x8FBE;10^114&#x79CD;&#xFF01;</p>
<p>&#x96EA;&#x4E0A;&#x52A0;&#x971C;&#x7684;&#x662F;&#xFF0C;&#x5FB7;&#x519B;&#x6BCF;&#x4E2A;&#x519B;&#x79CD;&#x6240;&#x7528;&#x7684;&#x54D1;&#x8C1C;&#x673A;&#x7565;&#x6709;&#x4E0D;&#x540C;&#xFF0C;&#x76F8;&#x5BF9;&#x4E8E;&#x4E09;&#x4E2A;&#x8F6C;&#x5B50;&#x7684;&#x9646;&#x519B;&#x54D1;&#x8C1C;&#x673A;&#xFF0C;&#x6D77;&#x519B;&#x4E94;&#x8F6C;&#x5B50;&#x7684;&#x54D1;&#x8C1C;&#x673A;&#x8981;&#x590D;&#x6742;&#x5F97;&#x591A;&#x3002;&#x5728;&#x5E03;&#x83B1;&#x5207;&#x5229;&#x56ED;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x4EBA;&#x76F8;&#x4FE1;&#x8FD9;&#x5C42;&#x5C42;&#x52A0;&#x5BC6;&#x72B6;&#x5982;&#x5929;&#x4E66;&#x7684;&#x5BC6;&#x7801;&#x53EF;&#x4EE5;&#x88AB;&#x7834;&#x89E3;&#xFF1A;&#x4E00;&#x4E2A;&#x662F;&#x5E03;&#x83B1;&#x5207;&#x5229;&#x56ED;&#x7684;&#x8001;&#x5927;&#xFF0C;&#x56E0;&#x4E3A;&#x201C;&#x6D77;&#x519B;&#x7535;&#x62A5;&#x5FC5;&#x987B;&#x88AB;&#x7834;&#x89E3;&#x201D;&#xFF0C;&#x5426;&#x5219;&#x88AB;&#x5FB7;&#x519B;&#x6F5C;&#x8247;&#x6218;&#x5C01;&#x9501;&#x7684;&#x82F1;&#x56FD;&#x5C06;&#x5750;&#x4EE5;&#x5F85;&#x6BD9;&#xFF1B;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x201C;&#x6559;&#x6388;&#x201D;&#x56FE;&#x7075;&#xFF0C;&#x56E0;&#x4E3A;&#x201C;&#x5982;&#x679C;&#x6D77;&#x519B;&#x7535;&#x62A5;&#x80FD;&#x7834;&#x89E3;&#xFF0C;&#x90A3;&#x5B9E;&#x5728;&#x592A;&#x597D;&#x73A9;&#x4E86;&#x201D;&#x3002;</p>
<p>&#x201C;&#x6559;&#x6388;&#x201D;&#x53D1;&#x73B0;&#xFF0C;&#x5728;&#x52A0;&#x5BC6;&#x6587;&#x4EF6;&#x4E2D;&#x627E;&#x89C4;&#x5F8B;&#x7684;&#x672C;&#x8D28;&#x662F;&#x91CD;&#x590D;&#x641C;&#x7D22;&#xFF0C;&#x800C;&#x641C;&#x7D22;&#x662F;&#x4E00;&#x79CD;&#x673A;&#x5668;&#x53EF;&#x4EE5;&#x4EE3;&#x66FF;&#x4EBA;&#x8111;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x5F53;&#x65F6;&#xFF0C;&#x5E03;&#x83B1;&#x5207;&#x5229;&#x56ED;&#x4ECE;&#x66FE;&#x7ECF;&#x7814;&#x7A76;&#x8FC7;&#x54D1;&#x8C1C;&#x673A;&#x7684;&#x6CE2;&#x5170;&#x6570;&#x5B66;&#x5BB6;&#x90A3;&#x91CC;&#x7EE7;&#x627F;&#x4E86;&#x4E00;&#x79CD;&#x53EB;&#x201C;&#x70B8;&#x5F39;&#x201D;(Bombe)&#x7684;&#x539F;&#x59CB;&#x89E3;&#x5BC6;&#x4EEA;&#x5668;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x201C;&#x70B8;&#x5F39;&#x201D;&#x6A21;&#x4EFF;&#x4E00;&#x4E2A;&#x54D1;&#x8C1C;&#x673A;&#x7684;&#x8F6C;&#x5B50;&#xFF0C;&#x8BB8;&#x591A;&#x201C;&#x70B8;&#x5F39;&#x201D;&#x76F8;&#x94FE;&#x63A5;&#x6765;&#x6A21;&#x62DF;&#x4E00;&#x79CD;&#x54D1;&#x8C1C;&#x673A;&#x7684;&#x521D;&#x59CB;&#x8BBE;&#x5B9A;&#x751F;&#x6210;&#x53EF;&#x80FD;&#x7684;&#x7535;&#x62A5;&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x7A77;&#x4E3E;&#x641C;&#x5BFB;&#x7B54;&#x6848;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x9700;&#x8981;&#x904D;&#x5386;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x6392;&#x5217;&#xFF0C;&#x8D39;&#x65F6;&#x8D39;&#x529B;&#x3002;&#x56FE;&#x7075;&#x6D1E;&#x5BDF;&#x5230;&#xFF0C;&#x53EA;&#x8981;&#x8FD0;&#x7528;&#x51E0;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4E8B;&#x5B9E;&#x2014;&#x2014;&#x6BD4;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x5B57;&#x6BCD;&#x7684;&#x5BC6;&#x7801;&#x4E0D;&#x53EF;&#x80FD;&#x662F;&#x5176;&#x672C;&#x8EAB;&#x3001;&#x539F;&#x59CB;&#x6587;&#x672C;&#x4E2D;&#x4E00;&#x4E9B;&#x5B57;&#x6BCD;&#xFF08;&#x6BD4;&#x5982;s&#xFF09;&#x7684;&#x51FA;&#x73B0;&#x9891;&#x7387;&#x4E00;&#x5B9A;&#x9AD8;&#x4E8E;&#x53E6;&#x4E00;&#x4E9B;&#x5B57;&#x6BCD;&#xFF08;&#x6BD4;&#x5982;x&#xFF09;&#xFF0C;&#x4E00;&#x4E9B;&#x56FA;&#x5B9A;&#x8BCD;&#x8BED;&#xFF08;&#x6BD4;&#x5982;&#x201C;&#x5143;&#x9996;&#x201D;&#xFF09;&#x5C06;&#x9AD8;&#x9891;&#x51FA;&#x73B0;&#x2014;&#x2014;&#x5C31;&#x80FD;&#x5927;&#x5927;&#x6539;&#x8FDB;&#x6CE2;&#x5170;&#x4EBA;&#x7684;&#x7B28;&#x6CD5;&#x5B50;&#xFF0C;&#x6765;&#x5FEB;&#x901F;&#x5BFB;&#x627E;&#x6700;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x8F6C;&#x5B50;&#x8BBE;&#x5B9A;&#x3002;&#x7528;&#x73B0;&#x5728;&#x7684;&#x7B97;&#x6CD5;&#x8BED;&#x8A00;&#x6765;&#x8BF4;&#xFF0C;&#x4ED6;&#x5C06;&#x7A77;&#x4E3E;&#x6CD5;&#x6539;&#x826F;&#x6210;&#x4E86;&#x8D2A;&#x5FC3;&#x7B97;&#x6CD5;&#x3002;&#x8D2A;&#x5FC3;&#x7B97;&#x6CD5;&#x6539;&#x8FDB;&#x540E;&#x7684;&#x201C;&#x70B8;&#x5F39;&#x201D;&#x5BF9;&#x6297;&#x4E94;&#x8F6C;&#x5B50;&#x7684;&#x6D77;&#x519B;&#x54D1;&#x8C1C;&#x673A;&#x5927;&#x83B7;&#x6210;&#x529F;&#x3002;&#x6BCF;&#x6B21;&#x4E00;&#x65B9;&#x53D1;&#x51FA;&#x7535;&#x62A5;&#x540E;&#xFF0C;&#x63A5;&#x53D7;&#x65B9;&#x8FC7;&#x51E0;&#x5206;&#x949F;&#x5C06;&#x53D1;&#x4E00;&#x5C01;&#x77ED;&#x7535;&#x62A5;&#x8868;&#x793A;&#x201C;&#x6536;&#x8BAB;&#x201D;&#x3002;&#x8BB8;&#x591A;&#x56DE;&#xFF0C;&#x7535;&#x6CE2;&#x4E2D;&#x8FD8;&#x672A;&#x76D1;&#x6D4B;&#x5230;&#x201C;&#x6536;&#x8BAB;&#x201D;&#x7535;&#x62A5;&#xFF0C;&#x56FE;&#x7075;&#x7684;&#x201C;&#x70B8;&#x5F39;&#x201D;&#x673A;&#x5DF2;&#x7ECF;&#x5C06;&#x5BC6;&#x7801;&#x8FD8;&#x539F;&#x6210;&#x4E86;&#x539F;&#x6587;&#xFF0C; &#x53EF;&#x89C1;&#x201C;&#x70B8;&#x5F39;&#x201D;&#x7684;&#x89E3;&#x5BC6;&#x901F;&#x5EA6;&#x751A;&#x81F3;&#x6BD4;&#x9884;&#x77E5;&#x539F;&#x59CB;&#x8BBE;&#x5B9A;&#x7684;&#x63A5;&#x53D7;&#x65B9;&#x90FD;&#x5FEB;&#xFF01;&#x5E03;&#x83B1;&#x5207;&#x5229;&#x56ED;&#x81EA;&#x8C6A;&#x5730;&#x8BF4;&#xFF0C;&#x5FB7;&#x56FD;&#x4EBA;&#x771F;&#x8BE5;&#x95EE;&#x201C;&#x6559;&#x6388;&#x201D;&#x4ED6;&#x4EEC;&#x7684;&#x7535;&#x62A5;&#x5230;&#x5E95;&#x8BB2;&#x4E86;&#x4EC0;&#x4E48;&#x3002;</p>
<p>&#x53EF;&#x662F;&#xFF0C;&#x968F;&#x7740;&#x6218;&#x4E89;&#x6DF1;&#x5165;&#xFF0C;&#x8F6C;&#x5B50;&#x66F4;&#x591A;&#x7684;&#x54D1;&#x8C1C;&#x673A;&#x4E0D;&#x65AD;&#x6295;&#x5165;&#x8FD0;&#x7528;&#xFF0C;&#x6700;&#x540E;&#x7ADF;&#x51FA;&#x73B0;&#x4E86;&#x5341;&#x4E8C;&#x8F6C;&#x5B50;&#x7684;&#x5BC6;&#x7801;&#x673A;&#x3002;&#x9762;&#x5BF9;&#x5341;&#x4E8C;&#x8F6C;&#x5B50;&#xFF0C;&#x5373;&#x4F7F;&#x56FE;&#x7075;&#x7684;&#x201C;&#x70B8;&#x5F39;&#x201D;&#x90FD;&#x9700;&#x8981;&#x5341;&#x51E0;&#x5929;&#x65F6;&#x95F4;&#x3002;&#x6218;&#x573A;&#x77AC;&#x606F;&#x4E07;&#x53D8;&#xFF0C;&#x5E03;&#x83B1;&#x5207;&#x5229;&#x56ED;&#x4E9F;&#x9700;&#x66F4;&#x5FEB;&#x901F;&#x7684;&#x673A;&#x5668;&#x3002;&#x5F88;&#x663E;&#x7136;&#xFF0C;&#x63D0;&#x9AD8;&#x901F;&#x5EA6;&#x7684;&#x5173;&#x952E;&#x5728;&#x4E8E;&#x628A;&#x673A;&#x68B0;&#x7684;&#x201C;&#x70B8;&#x5F39;&#x201D;&#x673A;&#x6539;&#x6210;&#x66F4;&#x5FEB;&#x901F;&#x7684;&#x7535;&#x8DEF;&#x88C5;&#x7F6E;&#x3002;1943&#x5E74;&#xFF0C;&#x5728;&#x56FE;&#x7075;&#x7684;&#x9F13;&#x52B1;&#x4E0B;&#xFF0C;&#x5E03;&#x83B1;&#x5207;&#x5229;&#x56ED;&#x5DE5;&#x7A0B;&#x5E08;Tommy Flowers&#x8BBE;&#x8BA1;&#x4E86;&#x4E00;&#x53F0;&#x53EB;&#x4F5C;Colossus&#x7684;&#x5DE8;&#x578B;&#x673A;&#x5668;&#xFF0C;&#x5728;&#x6218;&#x65F6;&#x5145;&#x88D5;&#x7684;&#x7ECF;&#x8D39;&#x652F;&#x6301;&#x4E0B;&#x5F88;&#x5FEB;&#x83B7;&#x51C6;&#x5EFA;&#x9020;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E16;&#x754C;&#x4E0A;&#x7B2C;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x7535;&#x5B50;&#x5316;&#x3001;&#x6570;&#x5B57;&#x5316;&#x3001;&#x7A0B;&#x5E8F;&#x5316;&#x3002;&#x5B83;&#x7531;&#x5149;&#x5B66;&#x5728;&#x957F;&#x6761;&#x7EB8;&#x5E26;&#x4E0A;&#x8BFB;&#x53D6;&#x7535;&#x62A5;&#x539F;&#x6587;&#xFF0C;&#x7ECF;&#x8FC7;&#x4E00;&#x5343;&#x4E94;&#x767E;&#x4E2A;&#x771F;&#x7A7A;&#x7BA1;&#x7684;&#x7535;&#x8DEF;&#x8BA1;&#x7B97;&#xFF0C;&#x5C06;&#x89E3;&#x5BC6;&#x7ED3;&#x679C;&#x8F93;&#x51FA;&#x5230;&#x7535;&#x4F20;&#x6253;&#x5B57;&#x673A;&#x4E0A;&#x3002;1944&#x5E74;6&#x6708;1&#x65E5;&#xFF0C; &#x7ECF;&#x8FC7;&#x5B8C;&#x5584;&#x7684;Colossus&#x4E8C;&#x53F7;&#x673A;&#x62B5;&#x8FBE;&#x5E03;&#x83B1;&#x5207;&#x5229;&#x56ED;&#x3002;&#x79BB;&#x8BFA;&#x66FC;&#x5E95;&#x767B;&#x9646;&#x53EA;&#x6709;&#x4E94;&#x5929;&#x3002;</p>
<p>&#x8BFA;&#x66FC;&#x5E95;&#x767B;&#x9646;&#xFF0C;&#x5728;&#x6B27;&#x6D32;&#x5F00;&#x8F9F;&#x7B2C;&#x4E8C;&#x6218;&#x573A;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#xFF0C;&#x6BCB;&#x5B81;&#x662F;&#x4E00;&#x573A;&#x8C6A;&#x8D4C;&#x3002;&#x76DF;&#x519B;&#x4E09;&#x767E;&#x4E07;&#x4E3B;&#x529B;&#x5175;&#x529B;&#x8981;&#x4ECE;&#x6D77;&#x4E0A;&#x548C;&#x7A7A;&#x4E2D;&#x767B;&#x9646;&#x6613;&#x5B88;&#x96BE;&#x653B;&#x7684;&#x8BFA;&#x66FC;&#x5E95;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x4F24;&#x4EA1;&#x60E8;&#x91CD;&#x3002;&#x4E3A;&#x4E86;&#x4FDD;&#x62A4;&#x5175;&#x529B;&#xFF0C;&#x76DF;&#x519B;&#x7684;&#x60C5;&#x62A5;&#x7F51;&#x7CBE;&#x5FC3;&#x7F16;&#x9020;&#x4E86;&#x4E00;&#x5219;&#x5047;&#x60C5;&#x62A5;&#x900F;&#x9732;&#x7ED9;&#x654C;&#x65B9;&#xFF0C;&#x5E0C;&#x671B;&#x5FB7;&#x519B;&#x4EE5;&#x4E3A;&#x5728;&#x8BFA;&#x66FC;&#x5E95;&#x5C06;&#x6709;&#x4E00;&#x6B21;&#x53EA;&#x662F;&#x201C;&#x5C0F;&#x89C4;&#x6A21;&#x201D;&#x7684;&#x519B;&#x4E8B;&#x8F6C;&#x79FB;&#x3002;&#x800C;&#x5FB7;&#x519B;&#x80FD;&#x4E0D;&#x80FD;&#x4E0A;&#x5F53;&#x5219;&#x552F;&#x6709;&#x901A;&#x8FC7;&#x7531;Colossus&#x89E3;&#x5BC6;&#x7684;&#x5FB7;&#x519B;&#x7535;&#x62A5;&#x68C0;&#x9A8C;&#x3002;&#x5E78;&#x4E8F;&#x5FEB;&#x901F;&#x7684;&#x7535;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x89E3;&#x5BC6;&#x5F88;&#x987A;&#x5229;&#xFF0C;&#x5FB7;&#x519B;&#x7684;&#x7535;&#x62A5;&#x663E;&#x793A;&#x53EA;&#x6709;&#x4E00;&#x5C0F;&#x652F;&#x90E8;&#x961F;&#x88AB;&#x6D3E;&#x5F80;&#x8BFA;&#x66FC;&#x5E95;&#x3002;&#x66F4;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x7535;&#x62A5;&#x8FD8;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x4E86;&#x519B;&#x4E8B;&#x5B89;&#x6392;&#x3001;&#x7269;&#x8D44;&#x8F6C;&#x79FB;&#x3001;&#x519B;&#x79CD;&#x8C03;&#x9063;&#xFF0C;&#x5FB7;&#x519B;&#x624B;&#x4E2D;&#x7684;&#x724C;&#x4E00;&#x89C8;&#x65E0;&#x4F59;&#x3002;</p>
<p>6&#x6708;6&#x65E5;&#x51CC;&#x6668;&#x4E09;&#x70B9;&#xFF0C;Colossus&#x7834;&#x89E3;&#x4E86;&#x4E00;&#x6761;&#x5FB7;&#x519B;&#x81EA;&#x8BFA;&#x66FC;&#x5E95;&#x521A;&#x53D1;&#x51FA;&#x7684;&#x7EDD;&#x671B;&#x7684;&#x7535;&#x62A5;&#x3002;&#x5929;&#x554A;&#xFF0C;&#x5929;&#x4E0A;&#x600E;&#x4E48;&#x6765;&#x4E86;&#x90A3;&#x4E48;&#x591A;&#x4F1E;&#x5175;&#x3002;</p>
<p>&#x968F;&#x7740;&#x8FD9;&#x4E9B;&#x4F1E;&#x5175;&#x5B89;&#x7136;&#x964D;&#x843D;&#xFF0C;&#x4E8C;&#x6218;&#x7684;&#x8F6C;&#x6298;&#x70B9;&#x5230;&#x6765;&#x4E86;&#x3002;</p>
<p>&#x5927;&#x897F;&#x6D0B;&#x7684;&#x53E6;&#x4E00;&#x8FB9;&#xFF0C;1943&#x5E74;&#x79CB;&#x3002;</p>
<p>&#x5A01;&#x65AF;&#x5EB7;&#x8F9B;&#x5927;&#x5B66;&#x9EA6;&#x8FEA;&#x900A;&#x5206;&#x6821;&#x6570;&#x5B66;&#x6559;&#x6388;&#x4E4C;&#x62C9;&#x59C6;(Stan Ulam)&#x7684;&#x529E;&#x516C;&#x5BA4;&#x91CC;&#x95EF;&#x8FDB;&#x4E86;&#x4E00;&#x4E2A;&#x5973;&#x5B66;&#x751F;&#x3002;&#x5B66;&#x671F;&#x53EA;&#x8FC7;&#x4E86;&#x4E00;&#x534A;&#xFF0C;&#x5979;&#x5374;&#x8981;&#x6C42;&#x63D0;&#x524D;&#x5B8C;&#x6210;&#x671F;&#x672B;&#x8003;&#x8BD5;&#xFF0C;&#x4EE5;&#x4FBF;&#x201C;&#x4E3A;&#x6218;&#x4E89;&#x670D;&#x52A1;&#x201D;&#x3002;&#x5979;&#x5750;&#x5728;&#x529E;&#x516C;&#x5BA4;&#x7684;&#x5730;&#x677F;&#x4E0A;&#xFF0C;&#x7B54;&#x5B8C;&#x4E86;&#x6559;&#x6388;&#x5728;&#x4FE1;&#x5C01;&#x80CC;&#x9762;&#x4E34;&#x65F6;&#x5199;&#x4E0B;&#x7684;&#x51E0;&#x9053;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x6D88;&#x5931;&#x5230;&#x8C01;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x54EA;&#x513F;&#x53BB;&#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x51E0;&#x5929;&#xFF0C;&#x4E4C;&#x62C9;&#x59C6;&#x8EAB;&#x8FB9;&#x6709;&#x8BB8;&#x591A;&#x670B;&#x53CB;&#x6D88;&#x5931;&#x4E86;&#x3002;&#x5728;&#x98DF;&#x5802;&#x8BA4;&#x8BC6;&#x7684;&#x540C;&#x4E8B;&#x3001;&#x7269;&#x7406;&#x6559;&#x6388;&#x3001;&#x81EA;&#x5DF1;&#x5E26;&#x7684;&#x7814;&#x7A76;&#x751F;&#xFF0C;&#x4ED6;&#x4EEC;&#x6253;&#x4E86;&#x4E2A; &#x201C;&#x4E3A;&#x6218;&#x4E89;&#x670D;&#x52A1;&#x201D;&#x7684;&#x5047;&#x6761;&#xFF0C;&#x5C31;&#x795E;&#x79D8;&#x83AB;&#x6D4B;&#x5730;&#x8D70;&#x4E86;&#x3002;&#x4E4C;&#x62C9;&#x59C6;&#x5FC3;&#x91CC;&#x75D2;&#x75D2;&#xFF0C;&#x5199;&#x4FE1;&#x7ED9;&#x81EA;&#x5DF1;&#x670B;&#x53CB;&#x4E2D;&#x4EBA;&#x8109;&#x6700;&#x5E7F;&#x7684;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#xFF0C;&#x8BE2;&#x95EE;&#x6709;&#x5426;&#x80FD;&#x4E3A;&#x6218;&#x4E89;&#x670D;&#x52A1;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4ED6;&#x56DE;&#x4FE1;&#x4E86;&#xFF0C;&#x8BF4;&#x81EA;&#x5DF1;&#x5FD9;&#x5F97;&#x5F88;&#xFF0C;&#x4E0D;&#x5982;&#x5728;&#x829D;&#x52A0;&#x54E5;&#x706B;&#x8F66;&#x7AD9;&#x89C1;&#x9762;&#x2014;&#x2014;&#x4ED6;&#x5728;&#x90A3;&#x91CC;&#x6B63;&#x597D;&#x6709;&#x4E24;&#x4E2A;&#x5C0F;&#x65F6;&#x7684;&#x8F6C;&#x8F66;&#x65F6;&#x95F4;&#x3002;&#x4E4C;&#x62C9;&#x59C6;&#x5728;&#x7AD9;&#x53F0;&#x89C1;&#x5230;&#x4E86;&#x98CE;&#x98CE;&#x706B;&#x706B;&#x7684;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#xFF0C;&#x4EE5;&#x53CA;&#x2014;&#x2014;&#x4ED6;&#x8EAB;&#x540E;&#x7684;&#x4E24;&#x4F4D;&#x4FDD;&#x9556;&#xFF0C;&#x8FD9;&#x624D;&#x610F;&#x8BC6;&#x5230;&#x4ED6;&#x670B;&#x53CB;&#x6B63;&#x5728;&#x5FD9;&#x6D3B;&#x7684;&#x4E8B;&#x5BF9;&#x5927;&#x6218;&#x610F;&#x4E49;&#x91CD;&#x5927;&#x3002;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x795E;&#x79D8;&#x5730;&#x8868;&#x793A;&#xFF1A;&#x6709;&#x4E00;&#x4EF6;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x9879;&#x76EE;&#x4E5F;&#x8BB8;&#x80FD;&#x8BA9;&#x4E4C;&#x62C9;&#x59C6;&#x5E2E;&#x5FD9;&#xFF0C;&#x4E0D;&#x8FC7;&#x4ED6;&#x8FD8;&#x4E0D;&#x80FD;&#x8BF4;&#x662F;&#x4EC0;&#x4E48;&#x4E8B;&#xFF0C;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x6709;&#x8C01;&#x3002;</p>
<p>&#x51E0;&#x5468;&#x540E;&#xFF0C;&#x4E4C;&#x62C9;&#x59C6;&#x6536;&#x5230;&#x4E86;&#x4E00;&#x5C01;&#x653F;&#x5E9C;&#x59D4;&#x6D3E;&#x4FE1;&#xFF0C;&#x8981;&#x6C42;&#x4ED6;&#x53BB;&#x65B0;&#x58A8;&#x897F;&#x54E5;&#x5DDE;&#x4E00;&#x4E2A;&#x5C0F;&#x9547;&#x3002;&#x4ED6;&#x4ECE;&#x6765;&#x6CA1;&#x542C;&#x8BF4;&#x8FC7;&#x8FD9;&#x8352;&#x50FB;&#x4E4B;&#x5730;&#xFF0C;&#x5C31;&#x53BB;&#x56FE;&#x4E66;&#x9986;&#x501F;&#x65B0;&#x58A8;&#x897F;&#x54E5;&#x5DDE;&#x5730;&#x56FE;&#x518C;&#x3002;&#x4E8E;&#x662F;&#x4ED6;&#x60CA;&#x559C;&#x5730;&#x53D1;&#x73B0;&#xFF0C;&#x5728;&#x5730;&#x56FE;&#x518C;&#x7684;&#x501F;&#x4E66;&#x5361;&#x4E0A;&#xFF0C;&#x6574;&#x9F50;&#x5730;&#x6392;&#x5217;&#x7740;&#x4E4B;&#x524D;&#x6D88;&#x5931;&#x7684;&#x6240;&#x6709;&#x719F;&#x4EBA;&#x7684;&#x540D;&#x5B57;&#x3002;&#x4ED6;&#x4EEC;&#x90FD;&#x6D88;&#x5931;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x95FB;&#x6240;&#x672A;&#x95FB;&#x4E4B;&#x5730;&#x3002;</p>
<p>&#x706B;&#x8F66;&#x5728;&#x4E00;&#x4E2A;&#x8352;&#x51C9;&#x7684;&#x8F66;&#x7AD9;&#x505C;&#x4E0B;&#xFF0C;&#x9EC4;&#x6C99;&#x904D;&#x91CE;&#xFF0C;&#x5CED;&#x58C1;&#x9661;&#x5D16;&#xFF0C;&#x50CF;&#x65F6;&#x95F4;&#x5C3D;&#x5934;&#x4E00;&#x6837;&#x6B7B;&#x5BC2;&#x3002;&#x8FD9;&#x91CC;&#x5C31;&#x662F;Site Y&#xFF0C;&#x521A;&#x521A;&#x8D77;&#x6B65;&#x7684;&#x7814;&#x7A76;&#x9879;&#x76EE;&#x53EB;Project Y&#xFF0C;&#x4FDD;&#x5BC6;&#x7B49;&#x7EA7;&#xFF1A;&#x7EDD;&#x5BC6;&#x3002;&#x6218;&#x4E89;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x524D;&#x8005;&#x5C06;&#x79F0;&#x4E3A;&#x6D1B;&#x65AF;&#x963F;&#x62C9;&#x83AB;&#x65AF;&#x56FD;&#x5BB6;&#x5B9E;&#x9A8C;&#x5BA4;(Los Alamos National Laboratory)&#xFF0C;&#x540E;&#x8005;&#x4FBF;&#x662F;&#x9F0E;&#x9F0E;&#x5927;&#x540D;&#x7684;&#x66FC;&#x54C8;&#x987F;&#x8BA1;&#x5212;&#x3002;&#x5728;&#x8FD9;&#x7247;&#x8427;&#x7D22;&#x7470;&#x4E3D;&#x7684;&#x6C99;&#x6F20;&#x4E2D;&#xFF0C;&#x805A;&#x96C6;&#x4E86;&#x4E00;&#x7FA4;&#x6D3B;&#x529B;&#x65FA;&#x76DB;&#x7684;&#x5E74;&#x8F7B;&#x4EBA;&#xFF0C;&#x5E73;&#x5747;&#x5E74;&#x9F84;25&#x5C81;&#xFF0C;&#x7B2C;&#x4E00;&#x5E74;&#xFF0C;80&#x4E2A;&#x65B0;&#x751F;&#x547D;&#x8BDE;&#x751F;&#x3002;&#x4ED6;&#x4EEC;&#x7684;&#x9886;&#x8896;&#x5965;&#x672C;&#x6D77;&#x9ED8;38&#x5C81;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x4FE1;&#x4F7F;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;39&#x5C81;&#x3002;&#x4ED6;&#x4EEC;&#x7684;&#x4EFB;&#x52A1;&#xFF1A;&#x5236;&#x9020;&#x6467;&#x6BC1;&#x4E00;&#x5207;&#x6D3B;&#x529B;&#x548C;&#x751F;&#x547D;&#x7684;&#x8D85;&#x7EA7;&#x6B66;&#x5668;&#xFF0C;&#x539F;&#x5B50;&#x5F39;&#x3002;</p>
<p><img src="http://img3.douban.com/view/note/large/public/p221426825-7.jpg" alt="&#x6D1B;&#x65AF;&#x963F;&#x62C9;&#x83AB;&#x65AF;&#x56FD;&#x5BB6;&#x5B9E;&#x9A8C;&#x5BA4;&#x8FB9;&#x754C;&#x7684;&#x6807;&#x5FD7;"></p>
<p>&#x56DB;&#x5E74;&#x524D;&#xFF0C;&#x7231;&#x56E0;&#x65AF;&#x5766;&#x548C;&#x897F;&#x62C9;&#x5FB7;&#xFF08;Leo Szilard&#xFF09;&#x4E0A;&#x4E66;&#x7F8E;&#x56FD;&#x603B;&#x7EDF;&#x7F57;&#x65AF;&#x798F;&#xFF1A;&#x7269;&#x7406;&#x5B66;&#x7684;&#x63A8;&#x8FDB;&#x5DF2;&#x7ECF;&#x4F7F;&#x5F97;&#x901A;&#x8FC7;&#x6838;&#x88C2;&#x53D8;&#x83B7;&#x5F97;&#x5DE8;&#x5927;&#x80FD;&#x91CF;&#x6307;&#x65E5;&#x53EF;&#x5F85;&#xFF0C;&#x53EA;&#x8981;&#x5FB7;&#x56FD;&#x4EBA;&#x613F;&#x610F;&#xFF0C;&#x4ED6;&#x4EEC;&#x6709;&#x77E5;&#x8BC6;&#x548C;&#x80FD;&#x529B;&#x53D1;&#x660E;&#x8FD9;&#x79CD;&#x6B66;&#x5668;&#xFF0C;&#x7F8E;&#x56FD;&#x5FC5;&#x987B;&#x8D76;&#x5728;&#x7EB3;&#x7CB9;&#x5FB7;&#x56FD;&#x4E4B;&#x524D;&#x638C;&#x63E1;&#x6838;&#x6280;&#x672F;&#x3002;&#x968F;&#x7740;&#x7F8E;&#x56FD;&#x6B63;&#x5F0F;&#x53C2;&#x6218;&#xFF0C;&#x6838;&#x6280;&#x672F;&#x7684;&#x7814;&#x7A76;&#x8D8A;&#x6765;&#x8D8A;&#x7D27;&#x8FEB;&#x3002;&#x4E00;&#x4E2A;&#x540D;&#x5B57;&#x88AB;&#x63D0;&#x51FA;&#x6765;&#xFF1A;&#x7F57;&#x4F2F;&#x7279;&#x2022;&#x5965;&#x672C;&#x6D77;&#x9ED8;&#xFF0C;&#x806A;&#x660E;&#x679C;&#x6562;&#xFF0C;&#x5F53;&#x673A;&#x7ACB;&#x65AD;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x540D;&#x5B57;&#x88AB;&#x63D0;&#x51FA;&#x6765;&#xFF1A;&#x7EA6;&#x7FF0;&#x2022;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x5DF2;&#x7ECF;&#x5750;&#x9547;&#x53E6;&#x5916;&#x5341;&#x51E0;&#x4E2A;&#x519B;&#x4E8B;&#x9879;&#x76EE;&#x4E0A;&#xFF0C;&#x6B63;&#x597D;&#x80FD;&#x8033;&#x542C;&#x516B;&#x8DEF;&#xFF0C;&#x773C;&#x89C2;&#x56DB;&#x65B9;&#x3002;</p>
<p>&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x6559;&#x6388;&#x662F;&#x519B;&#x65B9;&#x6700;&#x559C;&#x7231;&#x7684;&#x5408;&#x4F5C;&#x4EBA;&#x3002;&#x4F5C;&#x4E3A;&#x72B9;&#x592A;&#x4EBA;&#x4ED6;&#x5BF9;&#x7EB3;&#x7CB9;&#x5AC9;&#x6076;&#x5982;&#x4EC7;&#xFF0C;&#x4E3A;&#x4E86;&#x66FF;&#x5173;&#x5728;&#x96C6;&#x4E2D;&#x8425;&#x7684;&#x670B;&#x53CB;&#x62A5;&#x4EC7;&#x4ED6;&#x6E34;&#x671B;&#x548C;&#x624B;&#x6BB5;&#x5F3A;&#x786C;&#x7684;&#x4EBA;&#x5408;&#x4F5C;&#xFF0C;&#x9189;&#x5FC3;&#x5404;&#x79CD;&#x65B0;&#x5F0F;&#x6B66;&#x5668;&#x3002;&#x4F5C;&#x4E3A;&#x6570;&#x5B66;&#x5BB6;&#xFF0C;&#x4ED6;&#x8BA4;&#x4E3A;&#x53EA;&#x6709;&#x5F53;&#x6570;&#x5B66;&#x6709;&#x5E94;&#x7528;&#x4EF7;&#x503C;&#x65F6;&#xFF0C;&#x6570;&#x5B66;&#x624D;&#x80FD;&#x6700;&#x5FEB;&#x901F;&#x5EA6;&#x53D1;&#x5C55;&#x3002;&#x5C11;&#x65F6;&#x7236;&#x4EB2;&#x903C;&#x8FEB;&#x4E4B;&#x4E0B;&#x5B66;&#x4E60;&#x7684;&#x5316;&#x5B66;&#x5DE5;&#x7A0B;&#x610F;&#x5916;&#x6D3E;&#x4E0A;&#x4E86;&#x7528;&#x573A;&#xFF0C;&#x4ED6;&#x5F88;&#x5BB9;&#x6613;&#x660E;&#x767D;&#x7269;&#x7406;&#x5B66;&#x5BB6;&#x548C;&#x5316;&#x5B66;&#x5BB6;&#x7684;&#x8BA8;&#x8BBA;&#xFF0C;&#x518D;&#x7528;&#x6570;&#x5B66;&#x7684;&#x8BED;&#x8A00;&#x89E3;&#x91CA;&#x7ED9;&#x6570;&#x5B66;&#x5BB6;&#x542C;&#x3002;&#x4ED6;&#x6700;&#x64C5;&#x957F;&#x628A;&#x4E00;&#x9879;&#x770B;&#x4F3C;&#x5E9E;&#x5927;&#x65E0;&#x89E3;&#x7684;&#x4EFB;&#x52A1;&#x5E96;&#x4E01;&#x89E3;&#x725B;&#xFF0C;&#x5206;&#x62C6;&#x6210;&#x5C0F;&#x96F6;&#x4EF6;&#x59D4;&#x6D3E;&#x4ED6;&#x4EBA;&#xFF0C;&#x8BA9;&#x5E95;&#x4E0B;&#x6BCF;&#x4E2A;&#x4EBA;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x62FF;&#x5230;&#x7684;&#x90A3;&#x90E8;&#x5206;&#x6070;&#x597D;&#x662F;&#x6700;&#x64C5;&#x957F;&#x7684;&#x672C;&#x804C;&#x3002;&#x4ED6;&#x662F;&#x5929;&#x751F;&#x7684;&#x9886;&#x8896;&#x548C;&#x4F20;&#x4EE4;&#x5B98;&#xFF0C;&#x5750;&#x9547;&#x5BFC;&#x5F39;&#x7814;&#x7A76;&#x5B9E;&#x9A8C;&#x5BA4;&#x3001;&#x7F8E;&#x56FD;&#x6570;&#x5B66;&#x5B66;&#x4F1A;&#x6218;&#x4E89;&#x59D4;&#x5458;&#x4F1A;&#x3001;&#x56FD;&#x5BB6;&#x9632;&#x5FA1;&#x7814;&#x7A76;&#x59D4;&#x5458;&#x4F1A;&#x2026;&#x2026;&#x4E0D;&#x50CF;&#x5927;&#x591A;&#x6570;&#x88AB;&#x5F3A;&#x5236;&#x5B9A;&#x5C45;&#x5728;&#x6D1B;&#x65AF;&#x963F;&#x62C9;&#x83AB;&#x65AF;&#x7684;&#x79D1;&#x7814;&#x8005;&#xFF0C;&#x4ED6;&#x8FDB;&#x51FA;&#x81EA;&#x7531;&#x3002;&#x65E5;&#x7406;&#x4E07;&#x673A;&#x7684;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x6559;&#x6388;&#x54DF;&#xFF0C;&#x4ED6;&#x5728;&#x666E;&#x6797;&#x65AF;&#x987F;&#x3001;&#x6CE2;&#x58EB;&#x987F;&#x3001;&#x8D39;&#x57CE;&#x3001;&#x534E;&#x76DB;&#x987F;&#x3001;&#x829D;&#x52A0;&#x54E5;&#x3001;&#x6D1B;&#x65AF;&#x963F;&#x62C9;&#x83AB;&#x65AF;&#x5B9E;&#x9A8C;&#x5BA4;&#x3001;&#x963F;&#x4F2F;&#x4E01;&#x5175;&#x5668;&#x8BD5;&#x9A8C;&#x4E2D;&#x5FC3;&#x2026;&#x2026;&#x5168;&#x7F8E;&#x7684;&#x6218;&#x65F6;&#x79D1;&#x7814;&#x8FDB;&#x5C55;&#x4ED6;&#x4E00;&#x6E05;&#x4E8C;&#x695A;&#xFF0C;&#x4EBA;&#x5BB6;&#x521A;&#x8DDF;&#x4ED6;&#x8BB2;&#x4E86;&#x4E24;&#x53E5;&#xFF0C;&#x4ED6;&#x5C31;&#x80FD;&#x63A5;&#x4E0A;&#x6765;&#xFF0C;&#x201C;&#x67D0;&#x67D0;&#x5728;&#x829D;&#x52A0;&#x54E5;&#x4E5F;&#x505A;&#x8FD9;&#x4E8B;&#x3002;&#x201D;&#x201C;&#x54C8;&#x4F5B;&#x7684;&#x67D0;&#x67D0;&#x5DF2;&#x7ECF;&#x641E;&#x51FA;&#x6765;&#x4E86;&#x3002;&#x201D;</p>
<p>&#x66FC;&#x54C8;&#x987F;&#x8BA1;&#x5212;&#x6700;&#x5927;&#x7684;&#x56F0;&#x96BE;&#x4E0D;&#x662F;&#x5236;&#x9020;&#x51FA;&#x6838;&#x88C2;&#x53D8;&#x53CD;&#x5E94;&#xFF0C;&#x800C;&#x662F;&#x63A7;&#x5236;&#x539F;&#x5B50;&#x5F39;&#x7684;&#x5A01;&#x529B;&#x3002;&#x7206;&#x70B8;&#x7684;&#x51B2;&#x51FB;&#x6CE2;&#x5C06;&#x53CD;&#x590D;&#x9707;&#x8361;&#x53E0;&#x52A0;&#xFF0C;&#x6700;&#x7EC8;&#x7684;&#x529B;&#x91CF;&#x96BE;&#x4EE5;&#x9884;&#x6D4B;&#x3002;&#x66FC;&#x54C8;&#x987F;&#x8BA1;&#x5212;&#x7684;&#x9AD8;&#x5EA6;&#x673A;&#x5BC6;&#x6027;&#x548C;&#x6838;&#x8BD5;&#x9A8C;&#x7684;&#x6602;&#x8D35;&#x6210;&#x672C;&#x4F7F;&#x5F97;&#x5927;&#x89C4;&#x6A21;&#x8BD5;&#x9A8C;&#x4E0D;&#x53EF;&#x80FD;&#xFF0C;&#x800C;&#x4EBA;&#x529B;&#x53C8;&#x96BE;&#x4EE5;&#x8BA1;&#x7B97;&#x5982;&#x6B64;&#x591A;&#x7684;&#x975E;&#x7EBF;&#x6027;&#x65B9;&#x7A0B;&#x3002;&#x5982;&#x4F55;&#x63D0;&#x9AD8;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x6210;&#x4E86;&#x5F53;&#x52A1;&#x4E4B;&#x6025;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x8FD9;&#x4E2A;&#x74F6;&#x9888;&#x4E5F;&#x56F0;&#x6270;&#x7740;&#x5176;&#x4ED6;&#x519B;&#x65B9;&#x79D1;&#x7814;&#x9879;&#x76EE;&#x3002;&#x4E8E;&#x662F;&#xFF0C;1943&#x5E74;&#xFF0C;&#x5F53;&#x542C;&#x8BF4;&#x5BBE;&#x5915;&#x6CD5;&#x5C3C;&#x4E9A;&#x5927;&#x5B66;&#x7684;&#x4E00;&#x7FA4;&#x5DE5;&#x7A0B;&#x5E08;&#x4E3A;&#x4E86;&#x8BA1;&#x7B97;&#x5BFC;&#x5F39;&#x8F68;&#x9053;&#xFF08;&#x53E6;&#x4E00;&#x79CD;&#x5178;&#x578B;&#x7684;&#x975E;&#x7EBF;&#x6027;&#x65B9;&#x7A0B;&#xFF09;&#x800C;&#x5F00;&#x59CB;&#x5EFA;&#x9020;&#x4E00;&#x53F0;&#x540D;&#x4E3A;ENIAC&#x7684;&#x5DE8;&#x578B;&#x673A;&#x5668;&#x65F6;&#xFF0C;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x7ACB;&#x5373;&#x654F;&#x9510;&#x5730;&#x60F3;&#x5230;&#xFF1A;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x8FD9;&#x673A;&#x5668;&#x53BB;&#x8BA1;&#x7B97;&#x539F;&#x5B50;&#x5F39;&#x51B2;&#x51FB;&#x6CE2;&#x7684;&#x80FD;&#x91CF;&#x3002;&#x5728;&#x4ED6;&#x7684;&#x7275;&#x5934;&#x4E0B;&#xFF0C;ENIAC&#x5EFA;&#x5B8C;&#x540E;&#x7B2C;&#x4E00;&#x9879;&#x6D4B;&#x8BD5;&#x4EFB;&#x52A1;&#x5C45;&#x7136;&#x4E0D;&#x662F;&#x5BFC;&#x5F39;&#x8F68;&#x9053;&#x800C;&#x6210;&#x4E86;&#x6838;&#x5F39;&#x65B9;&#x7A0B;&#xFF0C;&#x6574;&#x4E2A;&#x6D4B;&#x8BD5;&#x5C06;&#x539F;&#x672C;&#x51E0;&#x4E2A;&#x6708;&#x7684; &#x4EBA;&#x529B;&#x8BA1;&#x7B97;&#x7F29;&#x77ED;&#x5230;&#x4E86;&#x51E0;&#x5929;&#x3002;&#x5B8C;&#x6210;&#x6D4B;&#x8BD5;&#x4ED6;&#x8138;&#x8272;&#x82CD;&#x767D;&#x5730;&#x56DE;&#x5230;&#x666E;&#x6797;&#x65AF;&#x987F;&#x5BB6;&#x91CC;&#x5012;&#x5934;&#x7761;&#x4E86;&#x5341;&#x5C0F;&#x65F6;&#xFF0C;&#x9192;&#x6765;&#x540E;&#x4E0D;&#x5403;&#x4E0D;&#x559D;&#xFF0C;&#x4E45;&#x4E45;&#x5411;&#x59BB;&#x5B50;&#x5410;&#x51FA;&#x4E00;&#x53E5;&#x8BDD;&#xFF1A;&#x201C;&#x6211;&#x4EEC;&#x9020;&#x4E86;&#x4E00;&#x5934;&#x602A;&#x517D;&#x3002;&#x201D;</p>
<p>&#x602A;&#x517D;&#xFF0C;&#x4ED6;&#x6307;&#x7684;&#x4E0D;&#x662F;&#x6838;&#x5F39;&#xFF0C;&#x800C;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x3002;</p>
<p>&#x770B;&#x5230;&#x4E86;ENIAC&#x7684;&#x5E7F;&#x9614;&#x524D;&#x666F;&#x540E;&#xFF0C;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x6BDB;&#x9042;&#x81EA;&#x8350;&#x8981;&#x505A;ENIAC&#x7684;&#x6570;&#x5B66;&#x987E;&#x95EE;&#xFF0C;&#x8BA9;&#x53D1;&#x660E;&#x8005;Presper Eckert&#x548C;John Mauchly&#x53D7;&#x5BA0;&#x82E5;&#x60CA;&#x3002;&#x4ED6;&#x4EEC;&#x4EB2;&#x81EA;&#x9886;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x53C2;&#x89C2;&#x673A;&#x5668;&#xFF0C;&#x4E00;&#x95F4;&#x4E24;&#x767E;&#x5E73;&#x7C73;&#x7684;&#x5927;&#x623F;&#x95F4;&#x91CC;&#xFF0C;&#x4E24;&#x4E2A;&#x5DE5;&#x7A0B;&#x5E08;&#x6307;&#x7ED9;&#x4ED6;&#x770B;&#xFF1A;&#x8FD9;&#x91CC;&#x662F;&#x4E00;&#x4E07;&#x516B;&#x5343;&#x6839;&#x771F;&#x7A7A;&#x7BA1;&#x3001;&#x8FD9;&#x91CC;&#x662F;&#x7535;&#x6E90;&#x3001;&#x8FD9;&#x91CC;&#x662F;&#x8BFB;&#x5361;&#x5668;&#x3001;&#x8FD9;&#x91CC;&#x662F;&#x7EF4;&#x4FEE;&#x7AD9;&#x2026;&#x2026;&#x53EF;&#x662F;&#xFF0C;&#x4EBA;&#x5BB6;&#x7684;&#x8BBE;&#x8BA1;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x5374;&#x770B;&#x5F97;&#x6BD4;&#x8BBE;&#x8BA1;&#x8005;&#x8FD8;&#x6E05;&#x695A;&#xFF0C;&#x4ED6;&#x4E00;&#x56DE;&#x53BB;&#x5C31;&#x5199;&#x4E86;&#x4E2A;105&#x9875;&#x7684;&#x62A5;&#x544A;&#xFF1A;&#x201C;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x57FA;&#x7840;&#x7EC4;&#x6210;&#x662F;&#xFF1A;&#x5B58;&#x50A8;&#x5668;&#x3001;&#x63A7;&#x5236;&#x5668;&#x3001;&#x8FD0;&#x7B97;&#x5668;&#x3001;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x8BBE;&#x5907;&#x3002;&#x201D;&#x81F3;&#x4ECA;&#xFF0C;&#x4E16;&#x754C;&#x4E0A;&#x7684;&#x5927;&#x90E8;&#x5206;&#x7535;&#x8111;&#x4ECD;&#x5728;&#x6CBF;&#x7528;&#x8FD9;&#x8457;&#x540D;&#x7684;&#x201C;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x7ED3;&#x6784;&#x201D;&#x3002;</p>
<p>1945&#x5E74;5&#x6708;&#xFF0C;&#x5FB7;&#x56FD;&#x6295;&#x964D;&#xFF0C;&#x8BC1;&#x636E;&#x663E;&#x793A;&#x5FB7;&#x56FD;&#x5F53;&#x65F6;&#x7684;&#x79D1;&#x7814;&#x8FDB;&#x5C55;&#x8FD8;&#x672A;&#x80FD;&#x5236;&#x9020;&#x51FA;&#x539F;&#x5B50;&#x5F39;&#x3002;7&#x6708;&#xFF0C;&#x6D1B;&#x65AF;&#x963F;&#x62C9;&#x83AB;&#x65AF;&#x7B2C;&#x4E00;&#x9897;&#x539F;&#x5B50;&#x5F39;&#x8BD5;&#x5C04;&#x6210;&#x529F;&#x3002;8&#x6708;&#xFF0C;&#x5728;&#x65B0;&#x4E0A;&#x4EFB;&#x7684;&#x675C;&#x9C81;&#x95E8;&#x603B;&#x7EDF;&#x7684;&#x6388;&#x610F;&#x4E0B;&#xFF0C;&#x4E24;&#x9897;&#x672C;&#x4E3A;&#x62B5;&#x5FA1;&#x5FB7;&#x56FD;&#x4EBA;&#x7684;&#x539F;&#x5B50;&#x5F39;&#x6295;&#x5411;&#x65E5;&#x672C;&#x5E7F;&#x5C9B;&#x548C;&#x957F;&#x5D0E;&#x3002;9&#x6708;&#xFF0C;&#x65E5;&#x672C;&#x6295;&#x964D;&#x3002;&#x7B2C;&#x4E8C;&#x6B21;&#x4E16;&#x754C;&#x5927;&#x6218;&#x7ED3;&#x675F;&#x3002;</p>
<p><img src="http://img4.douban.com/view/note/large/public/p221426825-8.jpg" alt="1945&#x5E74;7&#x6708;16&#x65E5;&#x51CC;&#x6668;&#xFF0C;&#x7B2C;&#x4E00;&#x9897;&#x539F;&#x5B50;&#x5F39;Trinity&#x5728;&#x65B0;&#x58A8;&#x897F;&#x54E5;&#x5DDE;&#x8BD5;&#x5C04;&#x6210;&#x529F;&#x3002;"></p>
<p>##&#x4E94;&#x3001;MANIAC</p>
<p>&#x5728;&#x4E8C;&#x6218;&#x7684;&#x5DE8;&#x5927;&#x538B;&#x529B;&#x4E0B;&#xFF0C;&#x82F1;&#x7F8E;&#x4E24;&#x56FD;&#x72EC;&#x7ACB;&#x5236;&#x9020;&#x51FA;&#x4E86;&#x6700;&#x539F;&#x59CB;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;Colossus&#x548C;ENIAC&#x3002;&#x5B83;&#x4EEC;&#x60CA;&#x4EBA;&#x7684;&#x76F8;&#x4F3C;&#xFF1A;&#x90FD;&#x5229;&#x7528;&#x6253;&#x5B54;&#x5361;&#x8F93;&#x5165;&#xFF0C;&#x90FD;&#x8FD0;&#x7528;&#x771F;&#x7A7A;&#x7BA1;&#x8BA1;&#x7B97;&#xFF0C;&#x90FD;&#x4F53;&#x79EF;&#x5E9E;&#x5927;&#xFF0C;&#x90FD;&#x5BF9;&#x4E8C;&#x6218;&#x80DC;&#x5229;&#x529F;&#x52CB;&#x5353;&#x8457;&#x3002;&#x4E8C;&#x6218;&#x53F2;&#x5B66;&#x5BB6;&#x666E;&#x904D;&#x8BA4;&#x4E3A;&#xFF0C;&#x5E03;&#x83B1;&#x5207;&#x5229;&#x56ED;&#x7684;&#x5DE5;&#x4F5C;&#x4F7F;&#x6B27;&#x6D32;&#x6218;&#x573A;&#x7F29;&#x77ED;&#x4E86;&#x4E00;&#x5E74;&#x534A;&#x5230;&#x4E24;&#x5E74;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5E76;&#x76F4;&#x63A5;&#x5207;&#x65AD;&#x4E86;&#x201C;&#x6C99;&#x6F20;&#x4E4B;&#x72D0;&#x201D;&#x9686;&#x7F8E;&#x5C14;&#x5728;&#x5317;&#x975E;&#x7684;&#x8865;&#x7ED9;&#x7EBF;&#xFF1B;&#x800C;&#x66FC;&#x54C8;&#x987F;&#x8BA1;&#x5212;&#x5219;&#x7EC8;&#x7ED3;&#x4E86;&#x592A;&#x5E73;&#x6D0B;&#x6218;&#x573A;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x620F;&#x5267;&#x6027;&#x7684;&#x64C2;&#x53F0;&#x4E0A;&#xFF0C;&#x4E24;&#x4E2A;&#x6838;&#x5FC3;&#x4EBA;&#x7269;&#x56FE;&#x7075;&#x548C;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x90FD;&#x51B3;&#x5FC3;&#x6539;&#x8FDB;&#x8FD9;&#x4E24;&#x53F0;&#x539F;&#x59CB;&#x673A;&#x5668;&#x76F8;&#x4F3C;&#x7684;&#x7F3A;&#x9677;&#xFF1A;&#x53EA;&#x4E3A;&#x4E13;&#x95E8;&#x76EE;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x4E0D;&#x80FD;&#x50A8;&#x5B58;&#x7A0B;&#x5E8F;&#x3002;&#x6539;&#x8FDB;&#x7684;&#x65B9;&#x5411;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x4E00;&#x5982;&#x56FE;&#x7075;1936&#x5E74;&#x8BBA;&#x6587;&#x6240;&#x9884;&#x8A00;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x9020;&#x4E00;&#x53F0;&#x80FD;&#x5B8C;&#x6210;&#x4EFB;&#x4F55;&#x76EE;&#x7684;&#x7684;&#x56FE;&#x7075;&#x901A;&#x7528;&#x673A;&#x3002;</p>
<p>&#x4E8C;&#x6218;&#x7ED3;&#x675F;&#x4E86;&#xFF0C;&#x800C;&#x51B7;&#x6218;&#x7684;&#x9634;&#x5F71;&#x65CB;&#x5373;&#x903C;&#x8FD1;&#x3002;&#x6838;&#x5A01;&#x6151;&#x6210;&#x4E86;&#x4E00;&#x6247;&#x5173;&#x4E0D;&#x4E0A;&#x7684;&#x95E8;&#xFF0C;&#x5728;&#x95F4;&#x9694;&#x91CD;&#x91CD;&#x7684;&#x7F8E;&#x82CF;&#x5173;&#x7CFB;&#x4E2D;&#xFF0C;&#x7F8E;&#x56FD;&#x5F88;&#x5FEB;&#x53D1;&#x73B0;&#x4E3A;&#x6C42;&#x81EA;&#x4FDD;&#x53EA;&#x80FD;&#x7EE7;&#x7EED;&#x6269;&#x5927;&#x6838;&#x4F18;&#x52BF;&#x3002;&#x6C22;&#x5F39;&#x7684;&#x7814;&#x7A76;&#x6210;&#x4E3A;&#x4E86;&#x653B;&#x575A;&#x5173;&#x952E;&#xFF0C;&#x800C;&#x5982;&#x4F55;&#x63D0;&#x9AD8;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x53C8;&#x6210;&#x4E86;&#x91CD;&#x4E2D;&#x4E4B;&#x91CD;&#x3002;&#x8981;&#x9020;&#x4E00;&#x53F0;&#x597D;&#x673A;&#x5668;&#xFF01;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x6559;&#x6388;&#x5BF9;&#x6B64;&#x6DF1;&#x4FE1;&#x4E0D;&#x7591;&#x3002;</p>
<p>&#x5728;&#x54EA;&#x91CC;&#x9020;&#xFF1F;&#x5C31;&#x5728;&#x666E;&#x6797;&#x65AF;&#x987F;&#x9AD8;&#x7B49;&#x7814;&#x7A76;&#x9662;&#xFF01;&#x9AD8;&#x7B49;&#x7814;&#x7A76;&#x9662;&#x9662;&#x957F;&#x9762;&#x6709;&#x96BE;&#x8272;&#xFF1A;&#x201C;&#x6211;&#x4EEC;&#x8FD9;&#x513F;&#x4E00;&#x76F4;&#x641E;&#x7EAF;&#x79D1;&#x5B66;&#xFF0C;&#x9020;&#x8FD9;&#x4E48;&#x53F0;&#x5927;&#x673A;&#x5668;&#x6709;&#x70B9;&#x4E0D;&#x50CF;&#x8BDD;&#x5427;&#xFF1F;&#x201D;&#x201C;&#x94B1;&#x54EA;&#x6765;&#xFF1F;&#x4E00;&#x5E74;&#x5341;&#x4E07;&#x7F8E;&#x91D1;&#x7684;&#x9884;&#x7B97;&#xFF0C;&#x4F60;&#x5F97;&#x8BA9;&#x6570;&#x5B66;&#x7CFB;&#x7ECF;&#x8D39;&#x7FFB;&#x4E09;&#x756A;&#xFF01;&#x201D;&#x201C;&#x9020;&#x4E86;&#x653E;&#x54EA;&#xFF1F;&#x4E09;&#x95F4;&#x4E24;&#x767E;&#x5E73;&#x7C73;&#x7684;&#x5927;&#x623F;&#x5B50;&#xFF0C;&#x4E8C;&#x5341;&#x56DB;&#x5C0F;&#x65F6;&#x5F15;&#x64CE;&#x6298;&#x817E;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x513F;&#x53EF;&#x6CA1;&#x8FD9;&#x6837;&#x7684;&#x5175;&#x5DE5;&#x5382;&#x3002;&#x201D;&#x9B3C;&#x7CBE;&#x660E;&#x7684;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x7B11;&#x7740;&#x5BF9;&#x9662;&#x957F;&#x8BF4;&#x65E2;&#x7136;&#x8FD9;&#x6837;&#x90A3;&#x5C31;&#x7B97;&#x4E86;&#xFF0C;&#x8C22;&#x8C22;&#x9662;&#x957F;&#x8D39;&#x5FC3;&#xFF0C;&#x4E00;&#x56DE;&#x5934;&#x5374;&#x7ED9;&#x54C8;&#x4F5B;&#x5927;&#x5B66;&#x3001;&#x829D;&#x52A0;&#x54E5;&#x5927;&#x5B66;&#x3001;IBM&#x8F6E;&#x756A;&#x5199;&#x4FE1;&#xFF1A;&#x201C;&#x6211;&#x6709;&#x5174;&#x8DA3;&#x5230;&#x4F60;&#x90A3;&#x513F;&#x5DE5;&#x4F5C;&#x3002;&#x201D;&#x4E09;&#x6240;&#x673A;&#x6784;&#x559C;&#x7B11;&#x989C;&#x5F00;&#xFF0C;&#x53D1;&#x51FA;&#x4E86;&#x70ED;&#x70C8;&#x7684;&#x8058;&#x4E66;&#x3002;&#x597D;&#x4E2A;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#xFF0C;&#x59DC;&#x592A;&#x516C;&#x9493;&#x9C7C;&#xFF0C;&#x628A;&#x54C8;&#x4F5B;&#x7684;&#x8058;&#x4E66;&#x7ED9;&#x829D;&#x52A0;&#x54E5;&#x770B;&#xFF0C;&#x628A;&#x829D;&#x52A0;&#x54E5;&#x7684;&#x7ED9;IBM&#x770B;&#xFF0C;&#x6BCF;&#x4E2A;&#x673A;&#x6784;&#x886C;&#x7740;&#x522B;&#x4EBA;&#x7684;&#x4EF7;&#x7801;&#x8F6E;&#x756A;&#x52A0;&#x4EF7;&#xFF0C;&#x8981;&#x662F;&#x80FD;&#x628A;&#x9F0E;&#x9F0E;&#x5927;&#x540D;&#x7684;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x8BF7;&#x5230;&#xFF0C;&#x9001;&#x4E2A;&#x91D1;&#x5C4B;&#x94F6;&#x5C4B;&#x90FD;&#x503C;&#xFF01;&#x4ED6;&#x80DC;&#x5238;&#x5728;&#x63E1;&#xFF0C;&#x628A;&#x54C8;&#x4F5B;&#x7684;&#x5929;&#x4EF7;&#x8058;&#x4E66;&#x5448;&#x7ED9;&#x666E;&#x6797;&#x65AF;&#x987F;&#x7684;&#x540C;&#x4E8B;&#x770B;&#xFF0C;&#x4F24;&#x611F;&#x5730;&#x8BF4;&#x81EA;&#x5DF1;&#x8981;&#x8F9E;&#x804C;&#xFF0C;&#x6559;&#x6388;&#x4EEC;&#x8054;&#x540D;&#x5199;&#x4FE1;&#x7ED9;&#x9662;&#x957F;&#xFF1A;&#x201C;&#x5931;&#x6389;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x5C06;&#x662F;&#x666E;&#x6797;&#x65AF;&#x987F;&#x7684;&#x60B2;&#x5267;&#xFF01;&#x201D;&#x90A3;&#x9662;&#x957F;&#x4E5F;&#x53EA;&#x80FD;&#x54AC;&#x54AC;&#x7259;&#xFF1A;&#x53BB;&#x9020;&#x4F60;&#x90A3;&#x53F0;&#x8981;&#x547D;&#x7684;&#x673A;&#x5668;&#x5427;&#x3002;</p>
<p>1947&#x5E74;&#x5728;&#x666E;&#x6797;&#x65AF;&#x987F;&#x9AD8;&#x7B49;&#x7814;&#x7A76;&#x9662;&#x5F00;&#x59CB;&#x5EFA;&#x9020;&#x7684;MANIAC&#x8BA1;&#x7B97;&#x673A;&#x5728;&#x4EFB;&#x4F55;&#x610F;&#x4E49;&#x4E0A;&#x90FD;&#x8D85;&#x8FC7;&#x4E86;&#x524D;&#x4EFB;ENIAC&#x3002;ENIAC&#x7528;&#x4E86;&#x4E24;&#x4E07;&#x4E2A;&#x771F;&#x7A7A;&#x7BA1;&#xFF0C;MANIAC&#x53EA;&#x7528;&#x4E86;&#x4E24;&#x5343;&#x4E2A;&#x3002;ENIAC&#x91CD;&#x8FBE;&#x4E09;&#x5341;&#x5428;&#xFF0C;MANIAC&#x53EA;&#x6709;&#x4E00;&#x5428;&#x3002;&#x6700;&#x5173;&#x952E;&#x7684;&#x662F;&#xFF0C;ENIAC&#x4E0D;&#x80FD;&#x8D2E;&#x5B58;&#x7A0B;&#x5E8F;&#xFF0C;&#x6BCF;&#x4E2A; &#x4E0D;&#x540C;&#x7684;&#x4EFB;&#x52A1;&#x90FD;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x6392;&#x5E03;&#x7535;&#x7EBF;&#xFF0C;&#x800C;MANIAC&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#x7531;&#x6253;&#x5B54;&#x5361;&#x4E0A;&#x4E8C;&#x8FDB;&#x5236;&#x7F16;&#x7801;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x8D2E;&#x5B58;&#x5728;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x3002;&#x5B83;&#x662F;&#x4E16;&#x754C;&#x4E0A;&#x7B2C;&#x4E00;&#x53F0;&#x771F;&#x6B63;&#x7684;&#x5168;&#x80FD;&#x81EA;&#x52A8;&#x7535;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x662F;&#x540E;&#x4E16;&#x6240;&#x6709;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x6BCD;&#x578B;&#x3002;&#x5B83;&#x5B8C;&#x6210;&#x7684;&#x8BF8;&#x591A;&#x519B;&#x65B9;&#x4EFB;&#x52A1;&#x4E2D;&#xFF0C;&#x6700;&#x60F9;&#x773C;&#x7684;&#x662F;&#x4E00;&#x6B21;&#x8017;&#x65F6;60&#x663C;&#x591C;&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x5176;&#x7ED3;&#x679C;&#x8BC1;&#x660E;&#x4E86;&#x6C22;&#x5F39;&#x5236;&#x9020;&#x7684;&#x53EF;&#x884C;&#x6027;&#x3002;</p>
<p><img src="http://img5.douban.com/view/note/large/public/p221426825-9.jpg" alt="1952&#x5E74;&#x79D1;&#x5B66;&#x5BB6;&#x4EEC;&#x5728;MANIAC&#x524D;&#x5408;&#x5F71;&#x3002;&#x5DE6;&#x4E94;&#x4E3A;&#x5965;&#x672C;&#x6D77;&#x9ED8;&#xFF0C;&#x53F3;&#x4E00;&#x4E3A;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x3002;"></p>
<p>1957&#x5C4A;&#x6821;&#x53CB;Joshua Dranoff&#xFF0C;&#x65E5;&#x540E;&#x6210;&#x4E3A;&#x897F;&#x5317;&#x5927;&#x5B66;&#x5316;&#x5DE5;&#x7CFB;&#x6559;&#x6388;&#xFF0C;&#x5728;&#x4E94;&#x5341;&#x5E74;&#x4EE3;&#x5229;&#x7528;MANIAC&#x5B8C;&#x6210;&#x4E86;&#x4ED6;&#x5316;&#x5DE5;&#x535A;&#x58EB;&#x8BBA;&#x6587;&#xFF0C;&#x5176;&#x4E2D;&#x8BBE;&#x8BA1;&#x4E86;&#x4E00;&#x4E2A;&#x7528;&#x8BA1;&#x7B97;&#x673A;&#x6A21;&#x62DF;&#x5B9E;&#x9A8C;&#x7ED3;&#x679C;&#x7684;&#x6B65;&#x9AA4;&#x3002;&#x4ED6;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x6BCF;&#x4E00;&#x5929;&#x673A;&#x5668;&#x8FD0;&#x884C;&#x4E4B;&#x524D;&#x6709;&#x6F2B;&#x957F;&#x7684;&#x68C0;&#x4FEE;&#xFF0C;&#x6280;&#x672F;&#x5DE5;&#x62FF;&#x7740;&#x4E00;&#x7BB1;&#x7535;&#x7EBF;&#x548C;&#x771F;&#x7A7A;&#x7BA1;&#x722C;&#x8FDB;MANIAC&#x5185;&#x90E8;&#x9010;&#x4E00;&#x66F4;&#x6362;&#x574F;&#x635F;&#x96F6;&#x4EF6;&#x3002;&#x5404;&#x4E2A;&#x4E13;&#x4E1A;&#x7684;&#x5B66;&#x751F;&#x7B49;&#x5728;&#x5B9E;&#x9A8C;&#x5BA4;&#x5916;&#x53FD;&#x53FD;&#x55B3;&#x55B3;&#x5730;&#x6392;&#x961F;&#x7B7E;&#x5230;&#xFF0C;&#x4ED6;&#x4EEC;&#x90FD;&#x60F3;&#x5C1D;&#x5C1D;MANIAC&#x7684;&#x9C9C;&#xFF0C;&#x5728;&#x8BBA;&#x6587;&#x91CC;&#x65F6;&#x9AE6;&#x5730;&#x7528;&#x8BA1;&#x7B97;&#x673A;&#x505A;&#x4E2A;&#x5C0F;&#x9879;&#x76EE;&#x3002;1958&#x5C4A;&#x6821;&#x53CB;Jerry Porter&#xFF0C;&#x65E5;&#x540E;&#x6210;&#x4E3A;&#x5BBE;&#x5915;&#x6CD5;&#x5C3C;&#x4E9A;&#x5927;&#x5B66;&#x6570;&#x5B66;&#x7CFB;&#x6559;&#x6388;&#xFF0C;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x8FD0;&#x7528;MANIAC&#x5B8C;&#x6210;&#x672C;&#x79D1;&#x6BD5;&#x4E1A;&#x8BBA;&#x6587;&#x7684;&#x5B66;&#x751F;&#x3002;&#x4ED6;&#x5927;&#x4E09;&#x5927;&#x56DB;&#x65F6;&#x8FD8;&#x5E26;&#x9886;&#x4E00;&#x5E2E;&#x540C;&#x5B66;&#x8D1F;&#x8D23;MANIAC&#x7684;&#x591C;&#x73ED;&#x503C;&#x52E4;&#xFF0C;&#x4ED6;&#x4EEC;&#x5F97;&#x76EF;&#x7740;&#x793A;&#x6CE2;&#x5668;&#x5C4F;&#x5E55;&#xFF0C;&#x65F6;&#x523B;&#x76D1;&#x6D4B;MANIAC&#x5B9D;&#x8D35;&#x7684;1024&#x6BD4;&#x7279;&#x968F;&#x673A;&#x5B58;&#x50A8;&#x5668;&#x4E0D;&#x88AB;&#x70E7;&#x574F;&#x3002;&#x8FD9;&#x4E2A;&#x591C;&#x73ED;&#x5DE5;&#x4F5C;&#x6FC0;&#x53D1;&#x4E86;&#x4ED6;&#x5BF9;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5174;&#x8DA3;&#xFF0C;&#x65E5;&#x540E;&#x7684;&#x5B66;&#x672F;&#x751F;&#x6DAF;&#x4ED6;&#x4E13;&#x6CE8;&#x4E8E;&#x8BA1;&#x7B97;&#x6570;&#x5B66;&#x9886;&#x57DF;&#x3002;</p>
<p>&#x4E8E;&#x662F;&#x4E4E;&#xFF0C;&#x5728;&#x672A;&#x53D7;&#x6218;&#x4E89;&#x7834;&#x574F;&#x7684;&#x7F8E;&#x56FD;&#xFF0C;&#x7531;ENIAC&#x6380;&#x8D77;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x548C;&#x7535;&#x5B50;&#x5DE5;&#x7A0B;&#x79D1;&#x5B66;&#x641E;&#x5F97;&#x98CE;&#x751F;&#x6C34;&#x8D77;&#xFF0C;&#x5E76;&#x5F88;&#x5FEB;&#x7531;IBM&#x516C;&#x53F8;&#x5B9E;&#x73B0;&#x4E86;&#x5546;&#x4E1A;&#x8FD0;&#x4F5C;&#x3002;&#x5230;1960&#x5E74;MANIAC&#x5149;&#x8363;&#x9000;&#x4F11;&#x88AB;&#x6350;&#x8D60;&#x7ED9;&#x53F2;&#x5BC6;&#x68EE;&#x5C3C;&#x56FD;&#x5BB6;&#x535A;&#x7269;&#x9986;(Smithsonian)&#x65F6;&#xFF0C;&#x5168;&#x7F8E;&#x5DF2;&#x7ECF;&#x62E5;&#x6709;&#x4E86;6000&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x3002;</p>
<p>&#x5728;&#x5E9F;&#x589F;&#x4E0A;&#x7684;&#x82F1;&#x56FD;&#xFF0C;&#x535A;&#x58EB;&#x751F;&#x56FE;&#x7075;&#x7684;&#x8FD0;&#x6C14;&#x8FDC;&#x6CA1;&#x90A3;&#x4E48;&#x597D;&#x3002;&#x4E8C;&#x6218;&#x540E;&#xFF0C;&#x4E3A;&#x4FDD;&#x62A4;&#x82F1;&#x56FD;&#x60C5;&#x62A5;&#x7F51;&#xFF0C;&#x5E03;&#x83B1;&#x5207;&#x5229;&#x56ED;&#x5927;&#x90E8;&#x5206;&#x6587;&#x4EF6;&#x8D44;&#x6599;&#x88AB;&#x711A;&#x70E7;&#x9500;&#x6BC1;&#xFF0C;&#x5176;&#x4F59;&#x88AB;&#x5F52;&#x4E3A;&#x673A;&#x5BC6;&#x6863;&#x6848;&#x3002;&#x80DC;&#x5229;&#x7684;&#x5149;&#x8363;&#x5C5E;&#x4E8E;&#x6D77;&#x9646;&#x7A7A;&#x4E09;&#x519B;&#xFF0C;&#x800C;&#x5E03;&#x83B1;&#x5207;&#x5229;&#x56ED;&#x7684;&#x5DE5;&#x4F5C;&#x4EBA;&#x5458;&#x5FC5;&#x987B;&#x5BF9;&#x6218;&#x65F6;&#x5DE5;&#x4F5C;&#x4FDD;&#x6301;&#x6C89;&#x9ED8;&#x3002;&#x5934;&#x53F7;&#x529F;&#x81E3;&#x56FE;&#x7075;&#x88AB;&#x6388;&#x4E88;&#x5927;&#x82F1;&#x5E1D;&#x56FD;&#x5B98;&#x4F50;&#x52CB;&#x7AE0;&#xFF08;OBE&#xFF09;&#xFF0C;&#x53EF;&#x5373;&#x4FBF;&#x4ED6;&#x7684;&#x6BCD;&#x4EB2;&#x4E5F;&#x53EA;&#x662F;&#x77E5;&#x9053;&#xFF0C;&#x201C;&#x4ED6;&#x505A;&#x4E86;&#x70B9;&#x4E86;&#x4E0D;&#x8D77;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x201D;</p>
<p>&#x56FE;&#x7075;&#x88AB;&#x5206;&#x914D;&#x5230;&#x56FD;&#x5BB6;&#x7269;&#x7406;&#x5B9E;&#x9A8C;&#x5BA4;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FEB;&#x4E0D;&#x53CA;&#x5F85;&#x5730;&#x60F3;&#x8981;&#x6539;&#x8FDB;Colossus&#x3002; &#x4ED6;&#x5411;&#x5B9E;&#x9A8C;&#x5BA4;&#x63D0;&#x4EA4;&#x4E86;&#x4E00;&#x4EFD;&#x9879;&#x76EE;&#x7533;&#x8BF7;&#xFF0C;&#x8BE6;&#x5C3D;&#x5730;&#x9610;&#x660E;&#x81EA;&#x5DF1;&#x5C06;&#x5982;&#x4F55;&#x5EFA;&#x9020;&#x4E00;&#x53F0;&#x80FD;&#x8D2E;&#x5B58;&#x7A0B;&#x5E8F;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x4E8B;&#x65E0;&#x5DE8;&#x7EC6;&#x5730;&#x5217;&#x51FA;&#x6240;&#x6709;&#x56FE;&#x7EB8;&#x548C;&#x7ECF;&#x8D39;&#x8BA1;&#x5212;&#x3002;&#x53EF;&#x662F;&#xFF0C;&#x6218;&#x65F6;&#x5E03;&#x83B1;&#x5207;&#x5229;&#x56ED;&#x7684;&#x9AD8;&#x6548;&#x548C;&#x65E0;&#x8282;&#x5236;&#x7684;&#x6218;&#x4E89;&#x7ECF;&#x8D39;&#x5DF2;&#x7ECF;&#x8BA9;&#x4F4D;&#x4E8E;&#x6218;&#x540E;&#x62D6;&#x62C9;&#x7684;&#x5B98;&#x50DA;&#x4F5C;&#x98CE;&#x548C;&#x7ECF;&#x6D4E;&#x5371;&#x673A;&#x3002;&#x8FC7;&#x76EE;&#x8FD9;&#x4EFD;&#x7533;&#x8BF7;&#x7684;&#x8D1F;&#x8D23;&#x4EBA;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x770B;&#x51FA;&#x8FD9;&#x5E9E;&#x7136;&#x5927;&#x7269;&#x7684;&#x7528;&#x5904;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x751A;&#x81F3;&#x4E0D;&#x76F8;&#x4FE1;&#x8BA1;&#x7B97;&#x673A;&#x53EF;&#x4EE5;&#x9020;&#x51FA;&#x6765;&#x2014;&#x2014;&#x53EF;&#x7B11;&#x53EF;&#x53F9;&#xFF0C;&#x4E0E;ENIAC&#x7684;&#x98CE;&#x5149;&#x622A;&#x7136;&#x4E0D;&#x540C;&#xFF0C;&#x4E3A;&#x60C5;&#x62A5;&#x670D;&#x52A1;&#x7684;Colossus&#x5BF9;&#x5916;&#x754C;&#x662F;&#x201C;&#x4E0D;&#x5B58;&#x5728;&#x201D;&#x7684;&#x3002;&#x56FE;&#x7075;&#x751A;&#x81F3;&#x4E0D;&#x80FD;&#x544A;&#x8BC9;&#x522B;&#x4EBA;&#xFF0C;&#x8FD9;&#x53F0;&#x4ED6;&#x4EEC;&#x8BA4;&#x4E3A;&#x4E0D;&#x53EF;&#x80FD;&#x9020;&#x7684;&#x673A;&#x5668;&#x5DF2;&#x7ECF;&#x9020;&#x51FA;&#x6765;&#x4E86;&#x3002;</p>
<p>1948&#x5E74;&#xFF0C;&#x53D7;&#x591F;&#x4E86;&#x56FD;&#x5BB6;&#x5B9E;&#x9A8C;&#x5BA4;&#x7684;&#x5B98;&#x50DA;&#x4F5C;&#x98CE;&#xFF0C;&#x56FE;&#x7075;&#x8DF3;&#x69FD;&#x5230;&#x66FC;&#x5F7B;&#x65AF;&#x7279;&#x5927;&#x5B66;&#x8BA1;&#x7B97;&#x5B9E;&#x9A8C;&#x5BA4; (Computing Labatory)&#xFF0C;&#x8FD9;&#x91CC;&#x53D7;&#x5230;&#x7F8E;&#x56FD;ENIAC&#x7684;&#x6FC0;&#x52B1;&#x6B63;&#x5728;&#x5EFA;&#x9020;&#x82F1;&#x56FD;&#x7B2C;&#x4E00;&#x53F0;&#x8D2E;&#x5B58;&#x7A0B;&#x5E8F;&#x5F0F;&#x7535;&#x8111;Manchester Mark I&#x3002;&#x56FE;&#x7075;&#x672C;&#x8BE5;&#x5927;&#x6709;&#x4F5C;&#x4E3A;&#xFF0C;&#x53EF;&#x662F;&#x5236;&#x9020;&#x8FD9;&#x4E48;&#x5927;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x9700;&#x8981;&#x548C;&#x5F88;&#x591A;&#x4EBA;&#x534F;&#x8C03;&#xFF0C;&#x4ED6;&#x5B64;&#x50FB;&#x7684;&#x6027;&#x683C;&#x5F88;&#x5FEB;&#x8BA9;&#x540C;&#x4E8B;&#x4E0E;&#x4E4B;&#x758F;&#x8FDC;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x5EFA;&#x8BAE;&#x88AB;&#x5F53;&#x4F5C;&#x4E66;&#x5446;&#x5B50;&#x7684;&#x610F;&#x6C14;&#x800C;&#x59D1;&#x5984;&#x542C;&#x4E4B;&#x3002;&#x4E0D;&#x4E45;&#xFF0C;&#x4ED6;&#x804A;&#x4EE5;&#x81EA;&#x6170;&#x5730;&#x53D1;&#x73B0;&#xFF0C;&#x9020;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x96BE;&#x70B9;&#x4E3B;&#x8981;&#x662F;&#x786C;&#x4EF6;&#x800C;&#x975E;&#x6570;&#x5B66;&#x6A21;&#x578B;&#xFF0C;&#x90A3;&#x8FD8;&#x662F;&#x628A;&#x7410;&#x788E;&#x7684;&#x5DE5;&#x7A0B;&#x95EE;&#x9898;&#x7559;&#x7ED9;&#x5DE5;&#x7A0B;&#x5E08;&#x5427;&#x3002;&#x4ED6;&#x5462;&#xFF0C;&#x4ED6;&#x53EA;&#x8981;&#x80FD;&#x591F;&#x201C;&#x60F3;&#x201D;&#x5C31;&#x884C;&#x4E86;&#x3002;&#x60F3;&#x2014;&#x2014;&#x4ED6;&#x5F00;&#x59CB;&#x4E3A;&#x4E00;&#x4E2A;&#x6839;&#x672C;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x60F3;&#x4E00;&#x79CD;&#x4E0B;&#x8C61;&#x68CB;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x56DB;&#x5E74;&#x540E;&#xFF0C;&#x4ED6;&#x4F1A;&#x626E;&#x6F14;&#x8FD9;&#x53F0;&#x865A;&#x6784;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x4E25;&#x683C;&#x6267;&#x884C;&#x81EA;&#x5DF1;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x548C;&#x670B;&#x53CB;&#x4E0B;&#x4E86;&#x4E00;&#x573A;&#x771F;&#x6B63;&#x7684;&#x8C61;&#x68CB;&#x6BD4;&#x8D5B;&#xFF0C;&#x6BCF;&#x4E00;&#x6B65;&#x8017;&#x65F6;&#x534A;&#x5C0F;&#x65F6;&#x3002;&#x4ED6;&#x548C;&#x670B;&#x53CB;&#x4E0B;&#x8F93;&#x4E86;&#xFF0C;&#x5374;&#x8D62;&#x4E86;&#x670B;&#x53CB;&#x7684;&#x59BB;&#x5B50;&#x4E00;&#x5C40;&#x3002;&#x5BF9;&#x4E8E;&#x6570;&#x5B66;&#x5BB6;&#x56FE;&#x7075;&#xFF0C;&#x5373;&#x4F7F;&#x6C38;&#x8FDC;&#x6CA1;&#x6709;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5B9E;&#x4F53;&#xFF0C;&#x8FD9;&#x4EF6;&#x4E8B;&#x4E5F;&#x5DF2;&#x7ECF;&#x505A;&#x5B8C;&#x4E86;&#x3002;&#x201C;&#x60F3;&#x51FA;&#x6765;&#x201D;&#x5C31;&#x662F;&#x201C;&#x505A;&#x51FA;&#x6765;&#x201D;&#x3002;</p>
<p>##&#x516D;&#x3001;&#x54AC;&#x4E86;&#x4E00;&#x53E3;&#x7684;&#x82F9;&#x679C;</p>
<p>&#x5728;&#x66FC;&#x5F7B;&#x65AF;&#x7279;&#x5927;&#x5B66;&#xFF0C;&#x56FE;&#x7075;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x4ECD;&#x7136;&#x662F;&#x5728;&#x8BA1;&#x7B97;&#x5B66;&#x7406;&#x8BBA;&#x4E0A;&#x3002;1950&#x5E74;&#xFF0C;&#x4ED6;&#x63D0;&#x51FA;&#x4E86;&#x81F3;&#x4ECA;&#x4ECD;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;&#x201C;&#x56FE;&#x7075;&#x8BD5;&#x9A8C;&#x201D;(Turing Test)&#xFF0C;&#x5373;&#x8BA9;&#x6D4B;&#x8BD5;&#x8005;&#x5411;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#x2014;&#x2014;&#x4E00;&#x4E2A;&#x4E3A;&#x673A;&#x5668;&#x4E00;&#x4E2A;&#x4E3A;&#x81EA;&#x7136;&#x4EBA;&#x2014;&#x2014;&#x63D0;&#x51FA;&#x4E00;&#x7CFB;&#x5217;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x679C;&#x6839;&#x636E;&#x53CC;&#x65B9;&#x7684;&#x56DE;&#x7B54;&#xFF0C;&#x6D4B;&#x8BD5;&#x8005;&#x4E0D;&#x80FD;&#x8FA8;&#x522B;&#x5B70;&#x4E3A;&#x673A;&#x5668;&#xFF0C;&#x5219;&#x8FD9;&#x4E2A;&#x673A;&#x5668;&#x5E94;&#x88AB;&#x89C6;&#x4E3A;&#x6709;&#x667A;&#x80FD;&#x7684;&#x3002;&#x522B;&#x6709;&#x610F;&#x5473;&#x7684;&#x662F;&#xFF0C;&#x56FE;&#x7075;&#x5728;&#x63D0;&#x51FA;&#x8FD9;&#x4E2A;&#x8BD5;&#x9A8C;&#x65F6;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x7CBE;&#x5DE7;&#x7684;&#x9690;&#x55BB;&#xFF1A;&#x5047;&#x8BBE;&#x4E24;&#x4E2A;&#x56DE;&#x7B54;&#x8005;&#x662F;&#x4E00;&#x7537;&#x4E00;&#x5973;&#xFF0C;&#x63D0;&#x95EE;&#x65B9;&#x5728;&#x95EE;&#x51FA;&#x4E00;&#x7CFB;&#x5217;&#x95EE;&#x9898;&#x540E;&#x4E0D;&#x80FD;&#x5224;&#x65AD;&#x54EA;&#x4E2A;&#x662F;&#x5973;&#x4EBA;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x90A3;&#x4E2A;&#x7537;&#x4EBA;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x6210;&#x529F;&#x7684;&#x201C;&#x5973;&#x4EBA;&#x201D;&#x3002;</p>
<p>&#x4ED6;&#x662F;&#x5728;&#x8FD9;&#x91CC;&#x5F71;&#x5C04;&#x81EA;&#x5DF1;&#x6027;&#x53D6;&#x5411;&#x4E0A;&#x7684;&#x5DEE;&#x5F02;&#x5417;&#xFF1F;&#x6211;&#x4EEC;&#x4E0D;&#x5F97;&#x800C;&#x77E5;&#x3002;&#x53EF;&#x5B8C;&#x6210;&#x8BBA;&#x6587;&#x540E;&#x6CA1;&#x591A;&#x4E45;&#xFF0C;&#x4ED6;&#x5C31;&#x5728;&#x4E00;&#x6B21;&#x6563;&#x6B65;&#x65F6;&#x7ED3;&#x8BC6;&#x4E86;&#x5341;&#x4E5D;&#x5C81;&#x7684;&#x963F;&#x8BFA;&#x5FB7;&#x2022;&#x83AB;&#x91CC;(Arnold Murray)&#xFF1A;&#x6C34;&#x6CE5;&#x5320;&#x7684;&#x513F;&#x5B50;&#x3001;&#x60EF;&#x5077;&#x3001;&#x5C0F;&#x6DF7;&#x6DF7;&#x3002;&#x8FD9;&#x8BA9;&#x4EBA;&#x4E0D;&#x7981;&#x60F3;&#x8D77;&#x5F53;&#x5E74;&#x4E2D;&#x4EA7;&#x5BCC;&#x88D5;&#x7684;&#x9B4F;&#x5C14;&#x4F26;&#x4E00;&#x89C1;&#x949F;&#x60C5;&#x5730;&#x7231;&#x4E0A;&#x4E86;&#x5341;&#x516D;&#x5C81;&#x7684;&#x5170;&#x6CE2;&#xFF1A;&#x4E00;&#x4E2A;&#x4E61;&#x4E0B;&#x6765;&#x7684;&#x91CE;&#x5B69;&#x5B50;&#xFF0C;&#x5883;&#x9047;&#x7684;&#x6781;&#x7AEF;&#x4E0D;&#x540C;&#x62DB;&#x81F3;&#x5F3A;&#x70C8;&#x7684;&#x7231;&#x6B32;&#x3002;&#x5982;&#x540C;&#x9B4F;&#x5C14;&#x4F26;&#x548C;&#x5170;&#x6CE2;&#x4E00;&#x6837;&#xFF0C;&#x56FE;&#x7075;&#x7684;&#x6545;&#x4E8B;&#x4E5F;&#x6709;&#x4E00;&#x4E2A;&#x751C;&#x871C;&#x7684;&#x5F00;&#x5934;&#x548C;&#x4E00;&#x4E2A;&#x6BC1;&#x706D;&#x6027;&#x7684;&#x7ED3;&#x5C3E;&#xFF1A;&#x6709;&#x4E00;&#x5929;&#x56FE;&#x7075;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x5BB6;&#x4E2D;&#x5931;&#x7A83;&#x4E86;&#xFF0C;&#x4ED6;&#x62A5;&#x4E86;&#x6848;&#xFF0C;&#x7A83;&#x8D3C;&#x662F;&#x83AB;&#x91CC;&#x7684;&#x670B;&#x53CB;&#x3002;&#x4E8E;&#x662F;&#x7ECF;&#x8FC7;&#x7B80;&#x5355;&#x7684;&#x8BE2;&#x95EE;&#xFF0C;&#x56FE;&#x7075;&#x5411;&#x8B66;&#x65B9;&#x627F;&#x8BA4;&#x4E86;&#x548C;&#x83AB;&#x91CC;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x5728;&#x5F53;&#x65F6;&#x7684;&#x82F1;&#x56FD;&#xFF0C;&#x540C;&#x6027;&#x604B;&#x88AB;&#x5217;&#x4E3A;&#x201C;&#x4E0D;&#x4F53;&#x9762;&#x7F6A;&#x201D;(gross indecency)&#x3002;&#x4ED6;&#x7684;&#x5165;&#x5BA4;&#x76D7;&#x7A83;&#x6848;&#x975E;&#x4F46;&#x56E0;&#x6B64;&#x4E0D;&#x5F97;&#x5230;&#x6CD5;&#x5F8B;&#x4FDD;&#x62A4;&#xFF0C;&#x4ED6;&#x53CD;&#x800C;&#x88AB;&#x9001;&#x4E0A;&#x6CD5;&#x5EAD;&#x53D7;&#x5BA1;&#x3002;&#x6CD5;&#x5B98;&#x7ED9;&#x51FA;&#x4E86;&#x4E24;&#x79CD;&#x60E9;&#x7F5A;&#x4EFB;&#x4ED6;&#x9009;&#x62E9;&#xFF1A;&#x5750;&#x7262;&#x6216;&#x8005;&#x5316;&#x5B66;&#x9609;&#x5272;&#x3002;&#x5F53;&#x65F6;&#x4E00;&#x4E9B;&#x79D1;&#x5B66;&#x7814;&#x7A76;&#x8BA4;&#x4E3A;&#xFF0C;&#x540C;&#x6027;&#x604B;&#x6E90;&#x81EA;&#x8FC7;&#x5269;&#x7684;&#x96C4;&#x6027;&#x6B32;&#x671B;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6CE8;&#x5C04;&#x96CC;&#x6FC0;&#x7D20;&#x6765;&#x6291;&#x5236;&#x3002;&#x4E24;&#x5BB3;&#x76F8;&#x6743;&#xFF0C;&#x56FE;&#x7075;&#x9009;&#x62E9;&#x4E86;&#x540E;&#x8005;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x81F3;&#x5C11;&#x80FD;&#x5446;&#x5728;&#x5BB6;&#x91CC;&#x7EE7;&#x7EED;&#x505A;&#x6570;&#x5B66;&#x3002;&#x4ED6;&#x88AB;&#x6301;&#x7EED;&#x6CE8;&#x5C04;&#x96CC;&#x6FC0;&#x7D20;&#x957F;&#x8FBE;&#x4E00;&#x5E74;&#xFF0C;&#x5BFC;&#x81F4;&#x80F8;&#x90E8;&#x53D1;&#x80B2;&#xFF0C;&#x53D8;&#x58F0;&#xFF0C;&#x9633;&#x75FF;&#x3002;</p>
<p>1954&#x5E74;6&#x6708;7&#x65E5;&#xFF0C;&#x4ED6;&#x5728;&#x5BB6;&#x4E2D;&#x54AC;&#x4E86;&#x4E00;&#x53E3;&#x6CBE;&#x6709;&#x6C30;&#x5316;&#x7269;&#x7684;&#x6BD2;&#x82F9;&#x679C;&#x81EA;&#x6740;&#x3002;</p>
<p>&#x8BA9;&#x56FE;&#x7075;&#x751F;&#x547D;&#x6700;&#x540E;&#x4E24;&#x5E74;&#x5904;&#x5883;&#x60B2;&#x60E8;&#x5E76;&#x6700;&#x540E;&#x5BFC;&#x81F4;&#x4ED6;&#x670D;&#x6BD2;&#x81EA;&#x6740;&#x7684;&#x201C;&#x4E0D;&#x4F53;&#x9762;&#x7F6A;&#x201D;&#xFF0C;&#x4ED6;&#x5F53;&#x65F6;&#x662F;&#x6781;&#x5176;&#x5929;&#x771F;&#x5730;&#x5C31;&#x5728;&#x8B66;&#x65B9;&#x9762;&#x524D;&#x627F;&#x8BA4;&#x4E86;&#x3002;&#x4ED6;&#x4E0D;&#x4F46;&#x53E3;&#x5934;&#x627F;&#x8BA4;&#x4E86;&#xFF0C;&#x8FD8;&#x5174;&#x51B2;&#x51B2;&#x624B;&#x5199;&#x4E86;&#x4E94;&#x9875;&#x82B1;&#x4F53;&#x5B57;&#x7684;&#x4F9B;&#x8FF0;&#x3002;&#x8BFB;&#x8FC7;&#x8FD9;&#x4E94;&#x9875;&#x7EB8;&#x7684;&#x8B66;&#x5BDF;&#x8BA4;&#x4E3A; &#x201C;&#x50CF;&#x6563;&#x6587;&#x4E00;&#x6837;&#x6D41;&#x7545;&#x201D;(a flowing style, almost like prose)&#x3001;&#x201C;&#x867D;&#x7136;&#x6709;&#x4E9B;&#x63AA;&#x8BCD;&#x592A;&#x96BE;&#x8BFB;&#x4E0D;&#x61C2;&#x201D;(beyond them in some of its phraseology)&#x3001;&#x201C;&#x4ED6;&#x771F;&#x4EE5;&#x4E3A;&#x4ED6;&#x5728;&#x505A;&#x6B63;&#x786E;&#x7684;&#x4E8B;&#x201D;(he really believed he was doing the right thing) &#x3002;&#x56FE;&#x7075;&#x4E8B;&#x540E;&#x544A;&#x8BC9;&#x670B;&#x53CB;&#xFF0C;&#x4ED6;&#x4E4B;&#x6240;&#x4EE5;&#x8FD9;&#x4E48;&#x5766;&#x767D;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x4EE5;&#x4E3A;&#x540C;&#x6027;&#x604B;&#x5F88;&#x5FEB;&#x5C31;&#x8981;&#x5408;&#x6CD5;&#x4E86;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x53EF;&#x4EE5;&#x644A;&#x5728;&#x53F0;&#x9762;&#x4E0A;&#x8C08;&#x3002;</p>
<p>&#x56FE;&#x7075;&#x60E8;&#x6B7B;&#x540E;&#x516D;&#x5341;&#x5E74;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x8FD9;&#x4E00;&#x5207;&#x8FD8;&#x8FDC;&#x4E0D;&#x80FD;&#x644A;&#x5728;&#x53F0;&#x9762;&#x4E0A;&#x8C08;&#xFF0C;&#x540C;&#x6027;&#x604B;&#x884C;&#x4E3A;&#x5728;&#x5927;&#x90E8;&#x5206;&#x56FD;&#x5BB6;&#x4ECD;&#x53D7;&#x5230;&#x5E7F;&#x6CDB;&#x4E89;&#x8BAE;&#xFF0C;&#x867D;&#x7136;&#x5C0A;&#x91CD;&#x548C;&#x5408;&#x6CD5;&#x7684;&#x547C;&#x58F0;&#x5728;&#x9752;&#x5E74;&#x4E00;&#x4EE3;&#x4E2D;&#x8D8A;&#x6765;&#x8D8A;&#x9AD8;&#x3002;2009&#x5E74;&#xFF0C;&#x82F1;&#x56FD;&#x9996;&#x76F8;&#x5E03;&#x6717;&#x5728;&#x4E00;&#x4EFD;&#x51E0;&#x5343;&#x4EBA;&#x7B7E;&#x540D;&#x8BF7;&#x613F;&#x4E66;&#x4E0B;&#x5411;&#x8FD9;&#x4F4D;&#x8BA1;&#x7B97;&#x673A;&#x4E4B;&#x7236;&#x548C;&#x4E8C;&#x6218;&#x82F1;&#x96C4;&#x505A;&#x4E86;&#x5B98;&#x65B9;&#x9053;&#x6B49;&#xFF1A;&#x201C;&#x6211;&#x4EEC;&#x5F88;&#x62B1;&#x6B49;&#x3002;&#x4F60;&#x672C;&#x8BE5;&#x88AB;&#x66F4;&#x597D;&#x5BF9;&#x5F85;&#x3002;(We are sorry. You deserved so much better.)&#x201D;</p>
<p><img src="http://img3.douban.com/view/note/large/public/p221426825-10.jpg" alt="&#x4E3A;&#x7EAA;&#x5FF5;&#x56FE;&#x7075;&#x767E;&#x5E74;&#x8BDE;&#x8FB0;&#xFF0C;&#x4ECA;&#x5E74;&#x82F1;&#x56FD;&#x53D1;&#x884C;&#x4E86;&#x4E00;&#x5F20;&#x56FE;&#x7075;&#x90AE;&#x7968;&#x3002;"></p>
<p>1957&#x5E74;&#xFF0C;&#x4E94;&#x5341;&#x4E09;&#x5C81;&#x7684;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x56E0;&#x9AA8;&#x764C;&#x75C5;&#x901D;&#xFF0C;&#x764C;&#x53D8;&#x539F;&#x56E0;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x6E90;&#x81EA;&#x66FC;&#x54C8;&#x987F;&#x8BA1;&#x5212;&#x7684;&#x6838;&#x8F90;&#x5C04;&#x3002;&#x519B;&#x65B9;&#x4EE3;&#x8868;&#x5B88;&#x5728;&#x4ED6;&#x7684;&#x75C5;&#x5E8A;&#x524D;&#xFF0C;&#x4EE5;&#x9632;&#x4ED6;&#x5728;&#x836F;&#x7269;&#x4F5C;&#x7528;&#x4E0B;&#x6CC4;&#x6F0F;&#x519B;&#x4E8B;&#x673A;&#x5BC6;&#x3002;&#x751F;&#x547D;&#x6700;&#x540E;&#x7684;&#x65E5;&#x5B50;&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x5B66;&#x5929;&#x624D;&#x8FDE;&#x7B80;&#x5355;&#x7684;&#x52A0;&#x51CF;&#x6CD5;&#x90FD;&#x4E0D;&#x80FD;&#x505A;&#x4E86;&#xFF0C;&#x5374;&#x8FD8;&#x9010;&#x5B57;&#x80CC;&#x8BF5;&#x5E7C;&#x5E74;&#x8BFB;&#x8FC7;&#x7684;&#x300A;&#x6D6E;&#x58EB;&#x5FB7;&#x300B; &#x7ED9;&#x63A2;&#x671B;&#x7684;&#x4EB2;&#x53CB;&#x89E3;&#x95F7;&#x3002;&#x6D6E;&#x58EB;&#x5FB7;&#xFF0C;&#x4E0E;&#x9B54;&#x9B3C;&#x8BA2;&#x7EA6;&#x800C;&#x904D;&#x5386;&#x4EBA;&#x95F4;&#x767E;&#x6001;&#x7684;&#x5927;&#x5B66;&#x8005;&#xFF0C;&#x8FD9;&#x4E0D;&#x6B63;&#x662F;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x7684;&#x4E00;&#x751F;&#xFF1F;</p>
<p>&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x53BB;&#x4E16;&#x540E;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x4E0D;&#x540C;&#x4E86;&#x3002;&#x66FE;&#x7ECF;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x73B0;&#x5728;&#x5374;&#x56F0;&#x96BE;&#x91CD;&#x91CD;&#x3002;&#x7EE7;&#x4EFB;&#x8005;&#x4EEC;&#x4E0D;&#x660E;&#x767D;&#xFF0C;&#x4ED6;&#x5230;&#x5E95;&#x662F;&#x600E;&#x4E48;&#x641E;&#x6765;&#x90A3;&#x4E48;&#x591A;&#x94B1;&#xFF1F;&#x600E;&#x4E48;&#x62DB;&#x5230;&#x90A3;&#x4E48;&#x806A;&#x660E;&#x7684;&#x4EBA;&#xFF1F;&#x201C;&#x800C;&#x4E14;&#xFF0C;&#x8BF4;&#x5230;&#x5E95;&#xFF0C;&#x6211;&#x4EEC;&#x4E3A;&#x4EC0;&#x4E48;&#x975E;&#x5F97;&#x9020;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x5462;&#xFF1F;&#x201D;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x624B;&#x4E0B;&#x5FE0;&#x5FC3;&#x803F;&#x803F;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x4EEC;&#x8FD8;&#x68A6;&#x60F3;&#x7740;&#x9020;&#x4E00;&#x53F0;&#x66F4;&#x597D;&#x7684;MANIAC&#xFF0C;&#x7528;&#x6676;&#x4F53;&#x7BA1;&#x9020;&#xFF0C;&#x7A33;&#x5B9A;&#x6027;&#x6BD4;&#x771F;&#x7A7A;&#x7BA1;&#x597D;&#x5F97;&#x591A;&#x2026;&#x2026;&#x53EF;&#x662F;&#xFF0C;&#x8FD9;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x6C38;&#x8FDC;&#x6CA1;&#x9020;&#x3002;&#x6E90;&#x6CC9;&#x6B7B;&#x4E86;&#xFF0C;&#x6E90;&#x6E90;&#x4E0D;&#x65AD;&#x7684;&#x6D3B;&#x529B;&#x548C;&#x521B;&#x9020;&#x4FBF;&#x505C;&#x6B47;&#x4E86;&#x3002;&#x666E;&#x6797;&#x65AF;&#x987F;&#x9AD8;&#x7B49;&#x7814;&#x7A76;&#x9662;&#x9000;&#x51FA;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x6700;&#x4EE4;&#x4EBA;&#x6FC0;&#x52A8;&#x7684;&#x53D1;&#x8FF9;&#x53F2;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x5C06;&#x662F;IBM&#x548C;MIT&#x7684;&#x5929;&#x4E0B;&#x3002;</p>
<p>##&#x4E03;&#x3001;&#x201C;&#x544A;&#x8BC9;&#x4ED6;&#x4EEC;&#xFF0C;&#x6211;&#x5EA6;&#x8FC7;&#x4E86;&#x6781;&#x597D;&#x7684;&#x4E00;&#x751F;&#x3002;&#x201D;</p>
<p>&#x56DE;&#x5230;1939&#x5E74;&#xFF0C;&#x5927;&#x6218;&#x4E4B;&#x524D;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5B66;&#x671F;&#x3002;</p>
<p>1939&#x5E74;2&#x6708;13&#x65E5;&#xFF0C;&#x5251;&#x6865;&#x54F2;&#x5B66;&#x7CFB;&#x6559;&#x6388;&#x7EF4;&#x7279;&#x6839;&#x65AF;&#x5766;&#x8D70;&#x8FDB;&#x201C;&#x6570;&#x5B66;&#x57FA;&#x7840;&#x201D;&#x8BFE;&#x6559;&#x5BA4;&#xFF0C;&#x5931;&#x671B;&#x5730;&#x53D1;&#x73B0;&#x4ED6;&#x7684;&#x5B66;&#x751F;&#x56FE;&#x7075;&#x4ECA;&#x5929;&#x7F3A;&#x5E2D;&#x4E86;&#xFF0C;&#x4E8E;&#x662F;&#x5BF9;&#x73ED;&#x4E0A;&#x5BA3;&#x5E03;&#xFF0C;&#x56E0;&#x4E3A;&#x56FE;&#x7075;&#x7F3A;&#x5E2D;&#xFF0C;&#x201C;&#x4ECA;&#x5929;&#x7684;&#x8BFE;&#x53EA;&#x662F;&#x53C2;&#x8003;&#x6027;&#x7684;&#x201D;&#x2014;&#x2014;&#x8981;&#x77E5;&#x9053;&#x8FD9;&#x95E8;&#x8BFE;&#x7684;&#x8981;&#x65E8;&#x5C31;&#x662F;&#x542C;&#x7EF4;&#x7279;&#x6839;&#x65AF;&#x5766;&#x548C;&#x56FE;&#x7075;&#x5435;&#x67B6;&#xFF01;&#x8FD9;&#x4F4D;27&#x5C81;&#x7684;&#x5E74;&#x8F7B;&#x4EBA;&#x521A;&#x4ECE;&#x666E;&#x6797;&#x65AF;&#x987F;&#x5927;&#x5B66;&#x535A;&#x58EB;&#x6BD5;&#x4E1A;&#xFF0C;&#x6B63;&#x5728;&#x5251;&#x6865;&#x6570;&#x5B66;&#x7CFB;&#x4EE5;&#x4E34;&#x65F6;&#x6559;&#x5458;&#x7684;&#x8EAB;&#x4EFD;&#x6559;&#x6388;&#x4E00;&#x95E8;&#x540C;&#x6837;&#x53EB;&#x4F5C;&#x201C;&#x6570;&#x5B66;&#x57FA;&#x7840;&#x201D;&#x540C;&#x6837;&#x542C;&#x8005;&#x5BE5;&#x5BE5;&#x7684;&#x8BFE;&#xFF0C;&#x4E0D;&#x8FC7;&#x7EF4;&#x7279;&#x6839;&#x65AF;&#x5766;&#x7684;&#x8BFE;&#x662F;&#x5173;&#x4E8E;&#x201C;&#x6570;&#x5B66;&#x672C;&#x8D28;&#x662F;&#x4EC0;&#x4E48;&#x201D;&#x8FD9;&#x4E2A;&#x54F2;&#x5B66;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x56FE;&#x7075;&#x7684;&#x8BFE;&#x662F;&#x5173;&#x4E8E;&#x201C;&#x5960;&#x5B9A;&#x6570;&#x5B66;&#x57FA;&#x7840;&#x7684;&#x516C;&#x7406;&#x662F;&#x54EA;&#x4E9B;&#x201D;&#x8FD9;&#x4E2A;&#x6570;&#x5B66;&#x95EE;&#x9898;&#x3002;&#x5728;&#x7EF4;&#x7279;&#x6839;&#x65AF;&#x5766;&#x7684;&#x8BFE;&#x4E0A;&#xFF0C;&#x4ED6;&#x559C;&#x6B22;&#x628A;&#x6240;&#x6709;&#x5BF9;&#x6570;&#x5B66;&#x57FA;&#x7840;&#x7684;&#x653B;&#x51FB;&#x503E;&#x6570;&#x5C04;&#x5411;&#x56FE;&#x7075;&#xFF0C;&#x800C;&#x56FE;&#x7075;&#x4E5F;&#x5F88;&#x559C;&#x6B22;&#x9488;&#x950B;&#x76F8;&#x5BF9;&#x5730;&#x53CD;&#x51FB;&#x3002;&#x4E24;&#x4EBA;&#x6FC0;&#x70C8;&#x5730;&#x4E89;&#x5435;&#xFF0C;&#x800C;&#x540E;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x5BF9;&#x5F7C;&#x6B64;&#x9886;&#x57DF;&#x7684;&#x7406;&#x89E3;&#x524D;&#x8FDB;&#x4E86;&#x4E00;&#x70B9;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x5E38;&#x5E74;&#x4E00;&#x8EAB;&#x8FD0;&#x52A8;&#x886B;&#x3001;&#x53C8;&#x7D27;&#x5F20;&#x53C8;&#x5185;&#x5411;&#x7684;&#x5E74;&#x8F7B;&#x4EBA;&#x8EAB;&#x4E0A;&#xFF0C;&#x7EF4;&#x7279;&#x6839;&#x65AF;&#x5766;&#x770B;&#x5230;&#x4E86;&#x4E09;&#x5341;&#x5E74;&#x524D;&#x7684;&#x81EA;&#x5DF1;&#xFF1A;&#x9664;&#x4E86;&#x601D;&#x8003;&#x6700;&#x57FA;&#x672C;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E16;&#x4E0A;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x4E8B;&#x8981;&#x505A;&#x3002;&#x4E09;&#x5341;&#x5E74;&#x524D;&#xFF0C;&#x51FA;&#x751F;&#x4E8E;&#x6B27;&#x6D32;&#x6700;&#x5BCC;&#x6709;&#x5BB6;&#x65CF;&#x7684;&#x7EF4;&#x7279;&#x6839;&#x65AF;&#x5766;&#x4E5F;&#x662F;&#x540C;&#x6837;&#x4E0D;&#x4FEE;&#x8FB9;&#x5E45;&#x5730;&#x7AD9;&#x5728;&#x903B;&#x8F91;&#x5B66;&#x5BB6;&#x7F57;&#x7D20;&#x9762;&#x524D;&#xFF0C;&#x4ED6;&#x6025;&#x4E8E;&#x4ECE;&#x7F57;&#x7D20;&#x53E3;&#x4E2D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x6709;&#x6CA1;&#x6709;&#x4E25;&#x8083;&#x601D;&#x8003;&#x6700;&#x57FA;&#x672C;&#x95EE;&#x9898;&#x7684;&#x624D;&#x80FD;&#xFF1A;&#x5982;&#x679C;&#x6CA1;&#x6709;&#xFF0C;&#x4ED6;&#x5C31;&#x9884;&#x5907;&#x53BB;&#x81EA;&#x6740;&#x3002;</p>
<p>&#x800C;&#x4ECA;&#x5929;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E0E;&#x81EA;&#x5DF1;&#x60CA;&#x4EBA;&#x76F8;&#x4F3C;&#x7684;&#x5E74;&#x8F7B;&#x4EBA;&#x56FE;&#x7075;&#x6CA1;&#x6709;&#x6765;&#x4E0A;&#x8BFE; &#x3002;&#x56FE;&#x7075;&#x6B63;&#x9A91;&#x7740;&#x6389;&#x94FE;&#x5B50;&#x7684;&#x81EA;&#x884C;&#x8F66;&#x53BB;&#x201C;&#x949F;&#x5C4B;&#x201D;(Clock House)&#x2014;&#x2014;&#x4ED6;&#x5FC3;&#x7231;&#x7684;&#x514B;&#x91CC;&#x65AF;&#x6258;&#x5F17;&#x2022;&#x9A6C;&#x5C14;&#x5B54;&#x751F;&#x524D;&#x6700;&#x5E38;&#x53BB;&#x7684;&#x6559;&#x533A;&#x6559;&#x5802;&#x3002;&#x4ECA;&#x5929;&#x662F;&#x9A6C;&#x5C14;&#x5B54;&#x53BB;&#x4E16;&#x4E5D;&#x5E74;&#x7684;&#x796D;&#x65E5;&#xFF0C;&#x9A6C;&#x5C14;&#x5B54;&#x7684;&#x7236;&#x6BCD;&#x51B3;&#x5B9A;&#x4EE5;&#x513F;&#x5B50;&#x7684;&#x540D;&#x4E49;&#x4E3A;&#x6559;&#x5802;&#x6350;&#x8D60;&#x4E00;&#x4E2A;&#x5C0F;&#x793C;&#x62DC;&#x5802;&#x3002;&#x56FE;&#x7075;&#x5750;&#x5728;&#x793C;&#x62DC;&#x5802;&#x91CC;&#x53C2;&#x52A0;&#x6350;&#x8D60;&#x4EEA;&#x5F0F;&#xFF0C;&#x5BF9;&#x9762;&#x7684;&#x5F69;&#x8272;&#x73BB;&#x7483;&#x7A97;&#x4E0A;&#x7ED8;&#x6709;&#x5723;&#x5F92;&#x514B;&#x91CC;&#x65AF;&#x6258;&#x5F17;&#x7684;&#x4E8B;&#x8FF9;&#x3002;&#x4EA1;&#x53CB;&#x6B7B;&#x540E;&#xFF0C;&#x5F7B;&#x5E95;&#x7684;&#x65E0;&#x795E;&#x8BBA;&#x8005;&#x56FE;&#x7075;&#x5DF2;&#x7ECF;&#x51E0;&#x5341;&#x6B21;&#x6765;&#x5230;&#x8FD9;&#x5EA7;&#x6559;&#x5802;&#x7F05;&#x6000;&#x5341;&#x4E03;&#x5C81;&#x7684;&#x591C;&#x665A;&#xFF0C;&#x4ED6;&#x548C;&#x4ED6;&#x4ECE;&#x56FE;&#x4E66;&#x9986;&#x56DE;&#x5BBF;&#x820D;&#x4E00;&#x8DEF;&#x4E0A;&#x6240;&#x8C08;&#x8BBA;&#x7684;&#x96C4;&#x5FC3;&#x58EE;&#x5FD7;&#xFF1A;&#x5982;&#x4F55;&#x4E3A;&#x79D1;&#x5B66;&#x505A;&#x51FA;&#x771F;&#x6B63;&#x7684;&#x8D21;&#x732E;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x5B8C;&#x6210;&#x4E86;&#x5251;&#x6865;&#x548C;&#x666E;&#x6797;&#x65AF;&#x987F;&#x7684;&#x5B66;&#x4E1A;&#xFF0C;&#x8FD9;&#x4E2A;&#x96C4;&#x5FC3;&#x5DF2;&#x7ECF;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5177;&#x4F53;&#x3002;&#x4ED6;&#x7684;&#x8111;&#x4E2D;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x4E86;&#x4E00;&#x90E8;&#x7CBE;&#x5DE7;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x4E00;&#x90E8;&#x80FD;&#x5B8C;&#x6210;&#x6240;&#x6709;&#x201C;&#x53EF;&#x80FD;&#x5B8C;&#x6210;&#x7684;&#x201D;&#x4EFB;&#x52A1;&#x7684;&#x673A;&#x5668;&#x3002;&#x8FD9;&#x4E0D;&#x518D;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x53F0;&#x673A;&#x5668;&#xFF0C;&#x4E5F;&#x662F;&#x5BF9;&#x9A6C;&#x5C14;&#x5B54;&#x7684;&#x4EA4;&#x4EE3;&#x3002;</p>
<p>&#x591A;&#x5E74;&#x4E4B;&#x540E;&#xFF0C;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x6559;&#x6388;&#x4F1A;&#x5411;&#x7F8E;&#x56FD;&#x653F;&#x5E9C;&#x4FDD;&#x8BC1;&#xFF0C;&#x4E16;&#x4E0A;&#x53EA;&#x9700;&#x8981;&#x5341;&#x4E94;&#x53F0;&#x8FD9;&#x6837;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x5168;&#x90E8;&#x7531;&#x50CF;&#x81EA;&#x5DF1;&#x4E00;&#x6837;&#x806A;&#x660E;&#x7684;&#x79D1;&#x5B66;&#x5BB6;&#x64CD;&#x4F5C;&#xFF0C;&#x7528;&#x4EE5;&#x8BA1;&#x7B97;&#x6700;&#x91CD;&#x8981;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x5F39;&#x9053;&#x66F2;&#x7EBF;&#x3001;&#x6838;&#x53CD;&#x5E94;&#x65B9;&#x7A0B;&#x3001;&#x5929;&#x6587;&#x89C2;&#x6D4B;&#x3002;&#x800C;&#x56FE;&#x7075;&#x7684;&#x613F;&#x666F;&#x5728;&#x66F4;&#x6DF1;&#x7684;&#x5730;&#x65B9;&#xFF1A;&#x94BB;&#x7814;&#x8FC7;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;1928&#x5E74;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x535A;&#x58EB;&#x751F;&#x56FE;&#x7075;&#x4F24;&#x611F;&#x5730;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x6570;&#x5B66;&#x662F;&#x4E0D;&#x5B8C;&#x7F8E;&#x7684;&#xFF0C;&#x903B;&#x8F91;&#x662F;&#x4E0D;&#x5B8C;&#x7F8E;&#x7684;&#xFF0C;&#x54F2;&#x5B66;&#x662F;&#x4E0D;&#x5B8C;&#x7F8E;&#x7684;&#x3002;&#x5373;&#x4F7F;&#x5728;&#x6700;&#x62BD;&#x8C61;&#x6700;&#x7B3C;&#x7EDF;&#x7684;&#x610F;&#x4E49;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x6C38;&#x8FDC;&#x6D3B;&#x5728;&#x4E00;&#x4E2A;&#x4E0D;&#x5B8C;&#x7F8E;&#x7684;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x5728;&#x8FD9;&#x6447;&#x6643;&#x7684;&#x5730;&#x57FA;&#x4E0A;&#x6211;&#x4EEC;&#x6C38;&#x8FDC;&#x9020;&#x4E0D;&#x51FA;&#x4EFB;&#x4F55;&#x5B8C;&#x7F8E;&#x7684;&#x4E8B;&#x7269;&#x3002;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x4E0D;&#x65AD;&#x4FEE;&#x847A;&#x6539;&#x9020;&#xFF0C;&#x5728;&#x6BCF;&#x4E00;&#x6B21;&#x7A33;&#x56FA;&#x5730;&#x57FA;&#x7684;&#x540C;&#x65F6;&#x8BD5;&#x56FE;&#x53D8;&#x5F97;&#x66F4;&#x597D;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E00;&#x53F0;&#x5B8C;&#x7F8E;&#x7684;&#x673A;&#x5668;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x80FD;&#x5426;&#x9020;&#x51FA;&#x4E00;&#x53F0;&#x4E0D;&#x5B8C;&#x7F8E;&#x4F46;&#x662F;&#x50CF;&#x5B69;&#x7AE5;&#x4E00;&#x6837;&#x4E0D;&#x65AD;&#x6210;&#x957F;&#x7684;&#x673A;&#x5668;&#x5462;&#xFF1F;&#x4E8E;&#x662F;&#xFF0C;&#x56FE;&#x7075;&#x68A6;&#x60F3;&#x7740;&#x4ED6;&#x7684;&#x56FE;&#x7075;&#x673A;&#xFF0C;&#x90A3;&#x662F;&#x4E00;&#x79CD;&#x53EF;&#x4EE5;&#x4E0D;&#x65AD;&#x8BFB;&#x53D6;&#x81EA;&#x8EAB;&#x4FEE;&#x6539;&#x81EA;&#x8EAB;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x5728;&#x8BB8;&#x591A;&#x6B21;&#x5931;&#x8D25;&#x7684;&#x5C1D;&#x8BD5;&#x540E;&#x80FD;&#x5B66;&#x4E60;&#x5230;&#x6210;&#x529F;&#x7684;&#x8BC0;&#x7A8D;&#x3002;&#x56FE;&#x7075;&#x68A6;&#x60F3;&#x7740;&#x8BB8;&#x591A;&#x56FE;&#x7075;&#x673A;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4E00;&#x53F0;&#x63D0;&#x51FA;&#x95EE;&#x9898;&#xFF0C;&#x8BB8;&#x591A;&#x53F0;&#x90FD;&#x53EF;&#x4EE5;&#x56DE;&#x7B54;&#x3002;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#xFF1A;&#x4ECE;&#x5F39;&#x9053;&#x66F2;&#x7EBF;&#x5230;&#x8001;&#x5976;&#x5976;&#x7684;&#x8D2D;&#x7269;&#x6E05;&#x5355;&#x5230;&#x5BB6;&#x5EAD;&#x65C5;&#x884C;&#x7684;&#x5730;&#x56FE;&#x8DEF;&#x7EBF;&#x3002;&#x53EF;&#x4EE5;&#x7531;&#x4EFB;&#x4F55;&#x4EBA;&#x64CD;&#x4F5C;&#xFF1A;&#x4ECE;&#x6700;&#x806A;&#x660E;&#x7684;&#x79D1;&#x5B66;&#x5BB6;&#x5230;&#x5C0F;&#x5B66;&#x8084;&#x4E1A;&#x751F;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x53F0;&#x56FE;&#x7075;&#x673A;&#x63D0;&#x4F9B;&#x7B54;&#x6848;&#x5C06;&#x7ECF;&#x8FC7;&#x66F4;&#x591A;&#x7684;&#x56FE;&#x7075;&#x673A;&#x7504;&#x9009;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x5173;&#x4E8E;&#x4E16;&#x754C;&#x53EA;&#x9700;&#x8981;&#x5341;&#x4E94;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x65AD;&#x8A00;&#x9519;&#x4E86;&#x3002;&#x4E16;&#x754C;&#x6CBF;&#x7740;&#x56FE;&#x7075;&#x7684;&#x68A6;&#x60F3;&#x5EF6;&#x5C55;&#x4E0B;&#x53BB;&#xFF0C;&#x4E00;&#x4E2A;&#x6241;&#x5E73;&#x7684;&#x5343;&#x59FF;&#x767E;&#x6001;&#x7684;&#x4E16;&#x754C;&#x3002;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x56FE;&#x7075;&#x7684;&#x68A6;&#x60F3;&#x5DF2;&#x7ECF;&#x90A3;&#x4E48;&#x719F;&#x7A14;&#x5730;&#x88AB;&#x4ECA;&#x5929;&#x7684;&#x4EBA;&#x7C7B;&#x6302;&#x5728;&#x5634;&#x8FB9;&#xFF1A;&#x4E92;&#x8054;&#x7F51;&#x3001;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x3002;</p>
<p>&#x56DE;&#x5230;1937&#x5E74;&#xFF0C;&#x6587;&#x7AE0;&#x4E00;&#x5F00;&#x5934;&#x63CF;&#x7ED8;&#x7684;&#x90A3;&#x4E2A;&#x65E9;&#x6668;&#x3002;</p>
<p>34&#x5C81;&#x7684;&#x72B9;&#x592A;&#x88D4;&#x6559;&#x6388;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x662F;&#x5BB6;&#x8D22;&#x4E07;&#x8D2F;&#x7684;&#x516C;&#x5B50;&#x54E5;&#xFF0C;&#x4E0D;&#x8FC7;&#x4ED6;&#x4E00;&#x5B9A;&#x662F;&#x516C;&#x5B50;&#x54E5;&#x4E2D;&#x6700;&#x52E4;&#x594B;&#x7684;&#x4E00;&#x4E2A;&#x3002;&#x4ED6;&#x6BCF;&#x5929;&#x4E94;&#x70B9;&#x8D77;&#x5E8A;&#xFF0C;&#x6628;&#x591C;&#x4ED6;&#x6D3E;&#x5BF9;&#x5BB4;&#x8BF7;&#x7684;&#x670B;&#x53CB;&#x8FD8;&#x4E00;&#x4E2A;&#x4E2A;&#x5012;&#x5728;&#x6C99;&#x53D1;&#x4E0A;&#x6253;&#x547C;&#x565C;&#xFF0C;&#x4ED6;&#x5DF2;&#x7ECF;&#x5728;&#x4E66;&#x623F;&#x91CC;&#x6C99;&#x6C99;&#x5199;&#x4E86;&#x51E0;&#x9875;&#x8BBA;&#x6587;&#x3002;&#x4E5D;&#x70B9;&#x5F00;&#x65E9;&#x996D;&#xFF0C;&#x4ED6;&#x505C;&#x6B62;&#x5DE5;&#x4F5C;&#x8D70;&#x51FA;&#x4E66;&#x623F;&#xFF0C;&#x548C;&#x7559;&#x5BBF;&#x7684;&#x670B;&#x53CB;&#x8C08;&#x7B11;&#x98CE;&#x751F;&#x9080;&#x8BF7;&#x4ED6;&#x4EEC;&#x4E0B;&#x6B21;&#x518D;&#x6765;&#x3002;&#x5341;&#x70B9;&#xFF0C;&#x4ED6;&#x7684;&#x51EF;&#x8FEA;&#x62C9;&#x514B;&#x5DF2;&#x7ECF;&#x7A33;&#x7A33;&#x5F53;&#x5F53;&#x5730;&#x505C;&#x5728;&#x5E15;&#x5C14;&#x739B;&#x7269;&#x7406;&#x5B9E;&#x9A8C;&#x5BA4;&#x524D;&#x9762;&#xFF0C;&#x4ED6;&#x4E00;&#x8EAB;&#x6807;&#x5FD7;&#x6027;&#x7684;&#x897F;&#x88C5;&#x5730;&#x8D70;&#x5411;&#x76F8;&#x90BB;&#x7684;&#x6570;&#x5B66;&#x697C;&#xFF0C;&#x7EE7;&#x7EED;&#x5199;&#x8BBA;&#x6587;&#x3002;</p>
<p>&#x6B64;&#x65F6;25&#x5C81;&#x7684;&#x540C;&#x6027;&#x604B;&#x535A;&#x58EB;&#x751F;&#x56FE;&#x7075;&#x4E5F;&#x5DF2;&#x7ECF;&#x7A7F;&#x7740;&#x6807;&#x5FD7;&#x6027;&#x7684;&#x7834;&#x8FD0;&#x52A8;&#x8863;&#x6CBF;&#x7740;&#x5B66;&#x6821;&#x6811;&#x6797;&#x8DD1;&#x5B8C;&#x4E86;&#x534A;&#x7A0B;&#x9A6C;&#x62C9;&#x677E;&#x3002;&#x4ED6;&#x5728;&#x6811;&#x6797;&#x91CC;&#x770B;&#x5230;&#x4E86;&#x51E0;&#x53EA;&#x82F1;&#x56FD;&#x89C1;&#x4E0D;&#x7740;&#x7684;&#x989C;&#x8272;&#x9C9C;&#x8273;&#x7684;&#x9752;&#x86D9;&#xFF0C;&#x51E0;&#x6735;&#x5E9E;&#x5927;&#x7684;&#x8611;&#x83C7;&#xFF0C;&#x6697;&#x81EA;&#x597D;&#x7B11;&#x4E86;&#x4E00;&#x4F1A;&#x513F;&#x3002;&#x4ED6;&#x5230;&#x5E15;&#x5C14;&#x739B;&#x7269;&#x7406;&#x5B9E;&#x9A8C;&#x5BA4;&#x6363;&#x9F13;&#x4E86;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x7684;&#x4E1A;&#x4F59;&#x7231;&#x597D;&#x2014;&#x2014;&#x5236;&#x9020;&#x4E00;&#x53F0;&#x80FD;&#x505A;&#x4E58;&#x6CD5;&#x7684;&#x673A;&#x5668;&#x2014;&#x2014;&#x7136;&#x540E;&#x7A7F;&#x8FC7;&#x5929;&#x6865;&#x8D70;&#x8FDB;&#x6570;&#x5B66;&#x697C;&#xFF0C;&#x5411;&#x529E;&#x516C;&#x5BA4;&#x5BF9;&#x95E8;&#x7684;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x5C34;&#x5C2C;&#x5730;&#x6253;&#x4E2A;&#x7167;&#x9762;&#xFF0C;&#x7EE7;&#x7EED;&#x7814;&#x7A76;&#x3BB;&#x6F14;&#x7B97;&#x548C;&#x56FE;&#x7075;&#x673A;&#x3002;</p>
<p>&#x90A3;&#x65F6;&#x5019;&#xFF0C;&#x666E;&#x6797;&#x65AF;&#x987F;&#x5927;&#x5B66;&#x7684;&#x6570;&#x5B66;&#x697C;&#x548C;&#x7269;&#x7406;&#x697C;&#x6709;&#x4E00;&#x5EA7;&#x5929;&#x6865;&#x76F8;&#x8FDE;&#x3002;&#x7231;&#x56E0;&#x65AF;&#x5766;&#x6559;&#x6388;&#x7CBE;&#x795E;&#x5F88;&#x597D;&#xFF0C;&#x6BCF;&#x5929;&#x7A7F;&#x68AD;&#x5929;&#x6865;&#x8BB8;&#x591A;&#x6B21;&#x5728;&#x6570;&#x5B66;&#x548C;&#x7269;&#x7406;&#x4E4B;&#x95F4;&#x6765;&#x56DE;&#x5954;&#x8DD1;&#x3002;&#x90A3;&#x662F;&#x4E00;&#x4E2A;&#x79BB;&#x6211;&#x4EEC;&#x9065;&#x8FDC;&#x7684;&#x4F1F;&#x5927;&#x7684;&#x79D1;&#x5B66;&#x5E74;&#x4EE3;&#xFF0C;&#x57FA;&#x7840;&#x5B66;&#x79D1;&#x4E4B;&#x95F4;&#x6709;&#x8BB8;&#x591A;&#x5929;&#x6865;&#x548C;&#x5730;&#x9053;&#x76F8;&#x901A;&#xFF0C;&#x79D1;&#x5B66;&#x5BB6;&#x4ECE;&#x4E00;&#x4E2A;&#x5B66;&#x79D1;&#x5F00;&#x59CB;&#x6316;&#x51FF;&#xFF0C;&#x6700;&#x540E;&#x6316;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x5B66;&#x79D1;&#x7684;&#x91D1;&#x77FF;&#x3002;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#x5728;&#x4E16;&#x7EAA;&#x4E4B;&#x521D;&#x7684;&#x8457;&#x540D;&#x6F14;&#x8BB2;&#x4E3A;&#x51E0;&#x5341;&#x5E74;&#x5185;&#x7684;&#x6570;&#x5B66;&#x7A81;&#x98DE;&#x731B;&#x8FDB;&#x63D0;&#x4F9B;&#x4E86;&#x6307;&#x8DEF;&#x724C;&#xFF0C;&#x7231;&#x56E0;&#x65AF;&#x5766;1915&#x5E74;&#x7684;&#x5E7F;&#x4E49;&#x76F8;&#x5BF9;&#x8BBA;&#x5E26;&#x6765;&#x4E86;&#x4E00;&#x4E2A;&#x5D2D;&#x65B0;&#x7684;&#x5B87;&#x5B99;&#x89C2;&#xFF0C;&#x4E00;&#x4E2A;&#x4E2A;&#x65B0;&#x5316;&#x5B66;&#x5143;&#x7D20;&#x63A5;&#x8E35;&#x800C;&#x81F3;&#x72B9;&#x5982;&#x4E0A;&#x5929;&#x7684;&#x60CA;&#x559C;&#x3002;&#x96C6;&#x5408;&#x8BBA;&#x4E0D;&#x8FC7;&#x534A;&#x4E2A;&#x4E16;&#x7EAA;&#xFF0C;&#x62D3;&#x6251;&#x5B66;&#x624D;&#x4E09;&#x5341;&#x51E0;&#x5E74;&#xFF0C;&#x91CF;&#x5B50;&#x529B;&#x5B66;&#x4E8C;&#x5341;&#x5E74;&#x2026;&#x2026;&#x5728;&#x8FD9;&#x4E2A;&#x5E78;&#x798F;&#x7684;&#x57FA;&#x7840;&#x79D1;&#x5B66;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;&#x72B9;&#x592A;&#x4EBA;&#x51AF;&#x2022;&#x8BFA;&#x4F0A;&#x66FC;&#x548C;&#x540C;&#x6027;&#x604B;&#x56FE;&#x7075;&#x5750;&#x5728;&#x9762;&#x5BF9;&#x9762;&#x7684;&#x529E;&#x516C;&#x5BA4;&#x91CC;&#xFF0C;&#x8FD9;&#x4E24;&#x79CD;&#x5907;&#x53D7;&#x6B67;&#x89C6;&#x7684;&#x8EAB;&#x4EFD;&#x5C06;&#x56F0;&#x6270;&#x4ED6;&#x4EEC;&#x4E00;&#x751F;&#xFF0C;&#x53EF;&#x662F;&#x6B64;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x5FC3;&#x65E0;&#x65C1;&#x9A9B;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x613F;&#x671B;&#xFF1A;&#x505A;&#x4E00;&#x4E2A;&#x6570;&#x5B66;&#x5BB6;&#x3001;&#x6570;&#x5B66;&#x5BB6;&#x3001;&#x6570;&#x5B66;&#x5BB6;&#x3002;</p>
<p>&#x5E78;&#x798F;&#x7684;&#x6570;&#x5B66;&#x5BB6;&#x3002;</p>
<hr>
<p>&#x6269;&#x5C55;&#x6D3B;&#x52A8;&#xFF1A;<br>&#x6211;&#x7684;&#x4E00;&#x4F4D;&#x5B66;&#x6570;&#x5B66;&#x7684;&#x670B;&#x53CB;&#x5236;&#x4F5C;&#x7684;&#x56FE;&#x7075;&#x673A;&#x7F51;&#x7AD9;&#x5728;<a href="http://awesometuringmachine.com/" target="_blank" rel="external">&#x8FD9;&#x91CC;</a>&#x3002;&#x4E3A;&#x4E4B;&#x6240;&#x5199;&#x7684;&#x6D6A;&#x6F2B;&#x7684;&#x4F7F;&#x7528;&#x8BF4;&#x660E;&#x4E66;&#x5728;<a href="http://blog.renren.com/blog/230154727/819611547" target="_blank" rel="external">&#x8FD9;&#x91CC;</a>&#x3002;<br>&#x5411;&#x5BF9;&#x56FE;&#x7075;&#x7684;&#x4E00;&#x751F;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x8BFB;&#x8005;&#x63A8;&#x8350;&#x8FD9;&#x672C;&#x79D1;&#x5B66;&#x4F20;&#x8BB0;&#x7684;&#x5178;&#x8303;&#xFF1A;<a href="http://www.amazon.com/Alan-Turing-Centenary-Andrew-Hodges/dp/069115564X/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1340369774&amp;sr=1-1&amp;keywords=alan+turing+the+enigma" target="_blank" rel="external">Alan Turing: The Enigma</a> .<br>&#x5411;&#x5BF9;&#x54D1;&#x8C1C;&#x673A;&#x548C;&#x5E03;&#x83B1;&#x5207;&#x5229;&#x56ED;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x8BFB;&#x8005;&#x63A8;&#x8350;&#x7EAA;&#x5F55;&#x7247;World War II Mind of a Code Breaker&#xFF0C;&#x5728;Youtube&#x4E0A;&#x6709;&#x3002;</p>
<p>&#x672C;&#x6587;&#x7684;&#x5199;&#x4F5C;&#x9664;&#x53C2;&#x8003;&#x4EE5;&#x4E0B;&#x4E66;&#x76EE;&#xFF0C;&#x8FD8;&#x4ECE;1957&#x5C4A;&#x6821;&#x53CB;Joshua Dranoff&#x6559;&#x6388;&#x3001; 1958&#x5C4A;&#x6821;&#x53CB;Jerry Porter&#x6559;&#x6388;&#x5904;&#x5F97;&#x5230;&#x4E86;&#x5B9D;&#x8D35;&#x7684;&#x539F;&#x59CB;&#x8D44;&#x6599;&#x3002;1988&#x5C4A;&#x6821;&#x53CB;W. Barksdale Maynard&#x5148;&#x751F;&#x3001;&#x666E;&#x6797;&#x65AF;&#x987F;&#x6863;&#x6848;&#x9986;&#x7684;Daniel Linke&#x5148;&#x751F;&#x5728;&#x53F2;&#x6599;&#x6838;&#x5BF9;&#x4E0A;&#x63D0;&#x4F9B;&#x4E86;&#x6709;&#x76CA;&#x7684;&#x7EBF;&#x7D22;&#x3002;<br>&#x672C;&#x6587;&#x7684;&#x914D;&#x56FE;&#x9664;&#x56FE;&#x7075;&#x5728;&#x666E;&#x6797;&#x65AF;&#x987F;&#x7684;&#x6863;&#x6848;&#x90A3;&#x4E00;&#x5F20;&#x7CFB;&#x81EA;&#x5DF1;&#x62CD;&#x6444;&#xFF0C;&#x5176;&#x4F59;&#x90FD;&#x6765;&#x81EA;&#x7F51;&#x7EDC;&#x3002;</p>
<p>&#x53C2;&#x8003;&#x4E66;&#x76EE;&#xFF1A;  </p>
<ul>
<li>Dyson, George. Turing&#x2019;s Cathedral: The Origins of the Digital Universe. New York: Pantheon Books, 2012.</li>
<li>Hargittai, Istvan. The Martians of Science: Five Physicists Who Changed the Twentieth Century. Oxford: Oxford University Press, 2006.</li>
<li>Hodges, Andrew. Alan Turing: the Enigma. New York: Walker &amp; Company, 2000.</li>
<li>Macrae, Norman. John von Neumann: The Scientific Genius Who Pioneered the Modern Computer, Game Theory, Nuclear Deterrence, and Much More. Providence, RI: American Mathematical Society, 1999.</li>
<li>Monk, Ray. Ludwig Wittgenstein: The Duty of Genius. New York: Penguin Books, 1991.</li>
<li>Ulam, S.M.. Adventures of a Mathematician. New York: Charles Scribner&#x2019;s Sons, 1976.</li>
</ul>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://matrix207.github.com/2013/08/06/face-to-face-office/" data-id="cineh9oub007joxizeo6vcz2o" class="article-share-link">Share</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/math/">math</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2013/08/06/linux-protocol-stack/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          Linux protocol stack
        
      </div>
    </a>
  
  
    <a href="/2013/08/05/opensource-projects-valued-for-reading/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">Opensource projects valued for reading</div>
    </a>
  
</nav>

  
</article>

</section>
        
          <aside id="sidebar">
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Categories</h3>
    <div class="widget">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/blog/">blog</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/database/">database</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/english/">english</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/kernel/">kernel</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/language/">language</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/linux/">linux</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/math/">math</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/network/">network</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/others/">others</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/person/">person</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/program/">program</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/source/">source</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/storage/">storage</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/tools/">tools</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/windows/">windows</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tag Cloud</h3>
    <div class="widget tagcloud">
      <a href="/tags/FAQ/" style="font-size: 10px;">FAQ</a> <a href="/tags/IRC/" style="font-size: 10px;">IRC</a> <a href="/tags/Translation/" style="font-size: 13px;">Translation</a> <a href="/tags/android/" style="font-size: 10px;">android</a> <a href="/tags/api/" style="font-size: 10px;">api</a> <a href="/tags/assembly/" style="font-size: 10px;">assembly</a> <a href="/tags/awk/" style="font-size: 11px;">awk</a> <a href="/tags/batch/" style="font-size: 14px;">batch</a> <a href="/tags/blog/" style="font-size: 10px;">blog</a> <a href="/tags/book/" style="font-size: 10px;">book</a> <a href="/tags/c/" style="font-size: 15px;">c</a> <a href="/tags/c/" style="font-size: 19px;">c++</a> <a href="/tags/cache/" style="font-size: 10px;">cache</a> <a href="/tags/crash/" style="font-size: 10px;">crash</a> <a href="/tags/database/" style="font-size: 17px;">database</a> <a href="/tags/debug/" style="font-size: 12px;">debug</a> <a href="/tags/dot/" style="font-size: 10px;">dot</a> <a href="/tags/driver/" style="font-size: 10px;">driver</a> <a href="/tags/emacs/" style="font-size: 11px;">emacs</a> <a href="/tags/exploit/" style="font-size: 10px;">exploit</a> <a href="/tags/file-system/" style="font-size: 10px;">file system</a> <a href="/tags/filesystem/" style="font-size: 12px;">filesystem</a> <a href="/tags/flowchart/" style="font-size: 10px;">flowchart</a> <a href="/tags/gcc/" style="font-size: 10px;">gcc</a> <a href="/tags/git/" style="font-size: 12px;">git</a> <a href="/tags/google/" style="font-size: 11px;">google</a> <a href="/tags/graphviz/" style="font-size: 11px;">graphviz</a> <a href="/tags/hexo/" style="font-size: 10px;">hexo</a> <a href="/tags/hosts/" style="font-size: 10px;">hosts</a> <a href="/tags/iscsi/" style="font-size: 14px;">iscsi</a> <a href="/tags/java/" style="font-size: 10px;">java</a> <a href="/tags/javascript/" style="font-size: 10px;">javascript</a> <a href="/tags/job/" style="font-size: 10px;">job</a> <a href="/tags/json/" style="font-size: 10px;">json</a> <a href="/tags/kernel/" style="font-size: 14px;">kernel</a> <a href="/tags/linux/" style="font-size: 14px;">linux</a> <a href="/tags/lisp/" style="font-size: 10px;">lisp</a> <a href="/tags/lua/" style="font-size: 10px;">lua</a> <a href="/tags/makefile/" style="font-size: 10px;">makefile</a> <a href="/tags/malloc/" style="font-size: 10px;">malloc</a> <a href="/tags/math/" style="font-size: 11px;">math</a> <a href="/tags/maxima/" style="font-size: 10px;">maxima</a> <a href="/tags/memory/" style="font-size: 11px;">memory</a> <a href="/tags/memory-overflow/" style="font-size: 10px;">memory overflow</a> <a href="/tags/mtrace/" style="font-size: 10px;">mtrace</a> <a href="/tags/netdisk/" style="font-size: 10px;">netdisk</a> <a href="/tags/network/" style="font-size: 20px;">network</a> <a href="/tags/others/" style="font-size: 18px;">others</a> <a href="/tags/pandoc/" style="font-size: 10px;">pandoc</a> <a href="/tags/performance/" style="font-size: 16px;">performance</a> <a href="/tags/person/" style="font-size: 11px;">person</a> <a href="/tags/protobuf/" style="font-size: 11px;">protobuf</a> <a href="/tags/python/" style="font-size: 10px;">python</a> <a href="/tags/rsync/" style="font-size: 10px;">rsync</a> <a href="/tags/sed/" style="font-size: 11px;">sed</a> <a href="/tags/shell/" style="font-size: 15px;">shell</a> <a href="/tags/skype/" style="font-size: 11px;">skype</a> <a href="/tags/sms/" style="font-size: 10px;">sms</a> <a href="/tags/source/" style="font-size: 11px;">source</a> <a href="/tags/ssh/" style="font-size: 10px;">ssh</a> <a href="/tags/stack/" style="font-size: 10px;">stack</a> <a href="/tags/storage/" style="font-size: 15px;">storage</a> <a href="/tags/study/" style="font-size: 10px;">study</a> <a href="/tags/svn/" style="font-size: 11px;">svn</a> <a href="/tags/sync/" style="font-size: 10px;">sync</a> <a href="/tags/test/" style="font-size: 11px;">test</a> <a href="/tags/time/" style="font-size: 10px;">time</a> <a href="/tags/tools/" style="font-size: 15px;">tools</a> <a href="/tags/valgrind/" style="font-size: 10px;">valgrind</a> <a href="/tags/vi/" style="font-size: 10px;">vi</a> <a href="/tags/vim/" style="font-size: 14px;">vim</a> <a href="/tags/virtual/" style="font-size: 11px;">virtual</a> <a href="/tags/wget/" style="font-size: 10px;">wget</a> <a href="/tags/windows/" style="font-size: 11px;">windows</a> <a href="/tags/wireshark/" style="font-size: 10px;">wireshark</a> <a href="/tags/write/" style="font-size: 13px;">write</a> <a href="/tags/xml/" style="font-size: 10px;">xml</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Archives</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/04/">April 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/03/">March 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/02/">February 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/01/">January 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/11/">November 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/10/">October 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/09/">September 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/08/">August 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/07/">July 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/06/">June 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/03/">March 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/02/">February 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/01/">January 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/12/">December 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/11/">November 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/09/">September 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/08/">August 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/07/">July 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/06/">June 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/05/">May 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/04/">April 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/03/">March 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/11/">November 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/10/">October 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/09/">September 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/08/">August 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/07/">July 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/06/">June 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/05/">May 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/04/">April 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/03/">March 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/02/">February 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/01/">January 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2012/12/">December 2012</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2012/09/">September 2012</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Recent Posts</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2016/04/24/understand-gcc-assembly-output/">understand gcc assembly output</a>
          </li>
        
          <li>
            <a href="/2016/04/24/speed-up-cplusplus-compilation/">speed up c++ compilation</a>
          </li>
        
          <li>
            <a href="/2016/04/18/hexo/">Hexo</a>
          </li>
        
          <li>
            <a href="/2016/04/13/malloc/">malloc</a>
          </li>
        
          <li>
            <a href="/2016/03/12/performance-optimization-of-cplusplus/">performance optimization of C++</a>
          </li>
        
      </ul>
    </div>
  </div>

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2016 Matrix207<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>
    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
    <a href="/about" class="mobile-nav-link">About</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>