<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>30 Linux Kernel Developers in 30 Weeks: Linus Torvalds | Matrix207&#39;s Blog</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x539F;&amp;#x6587;: 30 Linux Kernel Developers in 30 Weeks: Linus Torvalds

Welcome to 30 Linux Kernel Developers in 30 Weeks! This is the first in a 30-week series we&amp;#x2019;re running that profiles a">
<meta property="og:type" content="article">
<meta property="og:title" content="30 Linux Kernel Developers in 30 Weeks: Linus Torvalds">
<meta property="og:url" content="http://matrix207.github.com/2013/03/01/30-linux-kernel-developers-in-30-weeks-linus-torvalds/index.html">
<meta property="og:site_name" content="Matrix207's Blog">
<meta property="og:description" content="&amp;#x539F;&amp;#x6587;: 30 Linux Kernel Developers in 30 Weeks: Linus Torvalds

Welcome to 30 Linux Kernel Developers in 30 Weeks! This is the first in a 30-week series we&amp;#x2019;re running that profiles a">
<meta property="og:updated_time" content="2016-04-24T10:10:05.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="30 Linux Kernel Developers in 30 Weeks: Linus Torvalds">
<meta name="twitter:description" content="&amp;#x539F;&amp;#x6587;: 30 Linux Kernel Developers in 30 Weeks: Linus Torvalds

Welcome to 30 Linux Kernel Developers in 30 Weeks! This is the first in a 30-week series we&amp;#x2019;re running that profiles a">
  
    <link rel="alternate" href="/atom.xml" title="Matrix207&#39;s Blog" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">Matrix207&#39;s Blog</a>
      </h1>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
          <a class="main-nav-link" href="/about">About</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="Search"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://matrix207.github.com"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-30-linux-kernel-developers-in-30-weeks-linus-torvalds" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2013/03/01/30-linux-kernel-developers-in-30-weeks-linus-torvalds/" class="article-date">
  <time datetime="2013-02-28T16:00:00.000Z" itemprop="datePublished">2013-03-01</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/english/">english</a>
  </div>

  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      30 Linux Kernel Developers in 30 Weeks: Linus Torvalds
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x539F;&#x6587;: <a href="https://www.linux.com/news/special-feature/linux-developers/587846-30-linux-kernel-developers-in-30-weeks-linus-torvalds" target="_blank" rel="external">30 Linux Kernel Developers in 30 Weeks: Linus Torvalds</a></p>
<blockquote>
<p>Welcome to 30 Linux Kernel Developers in 30 Weeks! This is the first in a 30-week series we&#x2019;re running that profiles a different Linux kernel developer each week. The Linux kernel development community is unique in many ways. The individuals that make up this community are responsible for orchestrating the world&#x2019;s largest collaborative development project and have a very large impact on the future of the operating system and other technologies. The profiles we publish throughout the rest of 2012 should help illustrate how these developers do their work, providing important insight on how to work with them and what makes them tick.</p>
</blockquote>
<p>&#x6B22;&#x8FCE;&#x6765;&#x5230;30&#x5468;30&#x4F4D;Linux&#x5185;&#x6838;&#x5F00;&#x53D1;&#x8005;&#xFF01;&#x8FD9;&#x662F;&#x4ECB;&#x7ECD;&#x4E0D;&#x540C;Linux&#x5185;&#x6838;&#x5F00;&#x53D1;&#x8005;30&#x5468;&#x7CFB;&#x5217;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x3002;Linux&#x5185;&#x6838;&#x5F00;&#x53D1;&#x793E;&#x533A;&#x662F;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#x7684;&#x3002;&#x793E;&#x533A;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5F00;&#x53D1;&#x8005;&#x8D1F;&#x8D23;&#x8BBE;&#x8BA1;&#x4E16;&#x4E0A;&#x6700;&#x5927;&#x7684;&#x534F;&#x52A9;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x6280;&#x672F;&#x7684;&#x672A;&#x6765;&#x53D1;&#x5C55;&#x6709;&#x5F88;&#x5927;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x5728;&#x4F59;&#x4E0B;&#x7684;2012&#x5E74;&#x4E2D;&#x505A;&#x7684;&#x8FD9;&#x4E9B;&#x4ECB;&#x7ECD;&#xFF0C;&#x5C06;&#x9610;&#x8FF0;&#x4ED6;&#x4EEC;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#xFF0C;&#x5982;&#x4F55;&#x8DDF;&#x4ED6;&#x4EEC;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#x4EE5;&#x53CA;&#x4EC0;&#x4E48;&#x4F7F;&#x5F97;&#x4ED6;&#x4EEC;&#x4F1F;&#x5927;&#x3002;</p>
<blockquote>
<p>We start the series with none other than Linux creator Linus Torvalds. This week Linus is in his home country of Finland to attend the Millennium Technology Prize ceremony. This week he was named a joint winner of the 2012 Millenium Technology Prize. Just before he left, he took the time to answer these profile questions.</p>
</blockquote>
<p>&#x5F00;&#x7BC7;&#x4ECB;&#x7ECD;&#x7684;&#x662F;Linus Torvalds&#x3002;&#x672C;&#x5468;Linus&#x5728;&#x4ED6;&#x7684;&#x5BB6;&#x4E61;&#x82AC;&#x5170;&#x53C2;&#x52A0;&#x5343;&#x79A7;&#x6280;&#x672F;&#x5956;&#x5178;&#x793C;&#xFF0C;&#x6210;&#x4E3A;2012&#x5343;&#x79A7;&#x6280;&#x672F;&#x5956;&#x7684;&#x5F97;&#x4E3B;&#x4E4B;&#x4E00;&#x3002;&#x5728;&#x4ED6;&#x79BB;&#x5F00;&#x524D;&#xFF0C;&#x4F5C;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x91C7;&#x8BBF;&#x3002;</p>
<blockquote>
<p>What&#x2019;s your name?</p>
</blockquote>
<p>&#x4F60;&#x7684;&#x540D;&#x5B57;&#x662F;&#xFF1F;</p>
<blockquote>
<p>Linus Torvalds</p>
</blockquote>
<p>Linus Torvalds</p>
<blockquote>
<p>What role do you play in the community and/or what subsystem(s) do you work on?</p>
</blockquote>
<p>&#x4F60;&#x5728;&#x793E;&#x533A;&#x4E2D;&#x626E;&#x6F14;&#x4EC0;&#x4E48;&#x89D2;&#x8272;&#x6216;&#x8D1F;&#x8D23;&#x54EA;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x53D1;&#xFF1F;</p>
<blockquote>
<p>I&#x2019;m the kernel top-level maintainer and don&#x2019;t tend to do any particular subsystems directly; although, I occasionally get directly involved with the VFS layer (and very occasionally some VM discussions).</p>
</blockquote>
<p>&#x6211;&#x662F;&#x5185;&#x6838;&#x7684;&#x6700;&#x9AD8;&#x7EF4;&#x62A4;&#x8005;&#xFF0C;&#x4E0D;&#x76F4;&#x63A5;&#x53C2;&#x52A0;&#x4EFB;&#x4F55;&#x5B50;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x3002;&#x4F46;&#x662F;&#x5076;&#x5C14;&#x4F1A;&#x53C2;&#x4E0E;VFS&#x754C;&#x9762;(&#x4EE5;&#x53CA;&#x66F4;&#x5076;&#x5C14;&#x5730;&#x53C2;&#x52A0;VM&#x8BA8;&#x8BBA;)</p>
<blockquote>
<p>Where do you get your paycheck?</p>
</blockquote>
<p>&#x4F60;&#x7684;&#x6536;&#x5165;&#x6765;&#x6E90;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</p>
<blockquote>
<p>The Linux Foundation.</p>
</blockquote>
<p>Linux&#x57FA;&#x91D1;&#x4F1A;&#x3002;</p>
<blockquote>
<p>What part of the world do you live in? Why there?</p>
</blockquote>
<p>&#x4F60;&#x5728;&#x54EA;&#x5C45;&#x4F4F;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;</p>
<blockquote>
<p>Portland, Oregon. As to &#x201C;why?&#x201D; it&#x2019;s mostly because it&#x2019;s a lot calmer and more livable than Silicon Valley, where we lived for several years before moving here. The weather may not be that great, but it&#x2019;s a much better area for the kids to grow up in, I suspect. And we can afford a bigger house in a good school district.</p>
</blockquote>
<p>&#x4FC4;&#x52D2;&#x5188;&#x5DDE;&#xFF0C;&#x6CE2;&#x7279;&#x5170;&#x3002;&#x539F;&#x56E0;&#x662F;&#x8FD9;&#x91CC;&#x5B89;&#x9759;&#xFF0C;&#x6BD4;&#x7845;&#x8C37;&#x66F4;&#x9002;&#x5408;&#x5C45;&#x4F4F;&#xFF0C;&#x5728;&#x54EA;&#x8FB9;&#x751F;&#x6D3B;&#x4E86;&#x597D;&#x51E0;&#x5E74;&#x3002;&#x4E5F;&#x8BB8;&#x6C14;&#x5019;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x597D;&#xFF0C;&#x4F46;&#x6211;&#x76F8;&#x4FE1;&#x8FD9;&#x91CC;&#x66F4;&#x9002;&#x5408;&#x5B69;&#x5B50;&#x7684;&#x6210;&#x957F;&#x3002;&#x8FD8;&#x6709;&#x5728;&#x8FD9;&#x8FB9;&#x540D;&#x6821;&#x7684;&#x533A;&#x4F9B;&#x5F97;&#x8D77;&#x5927;&#x623F;&#x5B50;&#x3002;</p>
<blockquote>
<p>What are your favorite productivity tools for software development? What do you run on your desktop?</p>
</blockquote>
<p>&#x4F60;&#x6700;&#x559C;&#x7231;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x4F60;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x4EC0;&#x4E48;&#xFF1F;</p>
<blockquote>
<p>I really just run a web browser (for email and time wasting), and then several terminals that I use git in. With the occasional &#x201C;gitk&#x201D; window to show the git history view. Most of my time goes to reading (and answering) email, and merging trees and looking at the results.</p>
</blockquote>
<p>&#x6211;&#x53EA;&#x5F00;&#x4E00;&#x4E2A;&#x6D4F;&#x89C8;&#x5668;(&#x6536;&#x53D1;&#x90AE;&#x4EF6;&#x548C;&#x6253;&#x53D1;&#x65F6;&#x95F4;&#xFF09;&#xFF0C;&#x548C;&#x5728;&#x51E0;&#x4E2A;&#x7EC8;&#x7AEF;&#x4E2D;&#x8DD1;git&#x3002;&#x5076;&#x5C14;&#x4F1A;&#x4F7F;&#x7528;gitk&#x7A97;&#x53E3;&#x6D4F;&#x89C8;git&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x3002;&#x5927;&#x591A;&#x6570;&#x65F6;&#x95F4;&#x662F;&#x8BFB;&#x548C;&#x56DE;&#x90AE;&#x4EF6;&#xFF0C;&#x5408;&#x5E76;&#x5F00;&#x53D1;&#x6811;&#x4EE5;&#x53CA;&#x67E5;&#x770B;&#x7ED3;&#x679C;&#x3002;</p>
<blockquote>
<p>The other tool I tend to use is the &#x201C;perf&#x201D; tool to do performance profiling for the loads I care about (which is mainly kernel compiles and some git workloads).</p>
</blockquote>
<p>&#x5176;&#x4ED6;&#x4F7F;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x662F;perf&#xFF0C;&#x7528;&#x4E8E;&#x6211;&#x5173;&#x5FC3;&#x7684;&#x8D1F;&#x8F7D;&#x8FDB;&#x884C;&#x538B;&#x529B;&#x6D4B;&#x8BD5;(&#x4E3B;&#x8981;&#x6709;&#x5185;&#x6838;&#x7F16;&#x8BD1;&#x548C;&#x4E00;&#x4E9B;git&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;)&#x3002;</p>
<blockquote>
<p>How did you get involved in Linux kernel development?</p>
</blockquote>
<p>&#x4F60;&#x662F;&#x5982;&#x4F55;&#x53C2;&#x5165;Linux&#x5185;&#x6838;&#x5F00;&#x53D1;&#x7684;&#xFF1F;</p>
<blockquote>
<p>Heh. Not enough common sense and knowledge to know that writing your own OS was a ridiculous amount of work.</p>
</blockquote>
<p>&#x5475;&#x3002;&#x7F3A;&#x4E4F;&#x5E38;&#x8BC6;&#x548C;&#x5199;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x80DC;&#x4EFB;&#x8FD9;&#x4EFD;&#x5DE5;&#x4F5C;&#x3002;</p>
<blockquote>
<p>What keeps you interested in it?</p>
</blockquote>
<p>&#x662F;&#x4EC0;&#x4E48;&#x8BA9;&#x4F60;&#x5BF9;&#x8FD9;&#x4EFD;&#x5DE5;&#x4F5C;&#x7231;&#x4E0D;&#x91CA;&#x624B;&#xFF1F;</p>
<blockquote>
<p>I still like the tinkering, and just the technical side of it. The fact that it&#x2019;s actually pretty social, and I get to call people names, is just a bonus.</p>
</blockquote>
<p>&#x6211;&#x4F9D;&#x65E7;&#x559C;&#x6B22;&#x89E3;&#x6280;&#x672F;&#x65B9;&#x9762;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#x8FD9;&#x662F;&#x76F8;&#x5F53;&#x73B0;&#x5B9E;&#x7684;&#xFF0C;&#xFF1F;&#xFF1F;&#xFF1F;</p>
<blockquote>
<p>What&#x2019;s the most amused you&#x2019;ve ever been by the collaborative development process (flame war, silly code submission, amazing accomplishment)?</p>
</blockquote>
<p>&#x5728;&#x534F;&#x4F5C;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F60;&#x89C9;&#x5F97;&#x597D;&#x73A9;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF08;&#x5634;&#x4ED7;&#xFF0C;&#x611A;&#x8822;&#x4EE3;&#x7801;&#x7684;&#x63D0;&#x4EA4;&#xFF0C;&#x60CA;&#x4EBA;&#x7684;&#x6210;&#x5C31;)&#xFF1F;</p>
<blockquote>
<p>I think my favorite part is when somebody does something utterly crazy using Linux. Things that just make no sense at all, but are impressive from a technical angle (and even more impressive from a &#x201C;they spent many months doing <em>that</em>?&#x201D; angle).</p>
</blockquote>
<p>&#x6211;&#x8BA4;&#x4E3A;&#x6211;&#x559C;&#x6B22;&#x7684;&#x90E8;&#x5206;&#x662F;&#x67D0;&#x4EBA;&#x4F7F;&#x7528;Linux&#x505A;&#x4E00;&#x4E9B;&#x5B8C;&#x5168;&#x75AF;&#x72C2;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x4ECE;&#x6280;&#x672F;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x662F;&#x4E00;&#x4E9B;&#x6BEB;&#x65E0;&#x610F;&#x4E49;&#x4F46;&#x53C8;&#x4EE4;&#x4EBA;&#x53F9;&#x4E3A;&#x89C2;&#x6B62;&#x7684;&#x4E8B;&#x60C5;(&#x751A;&#x81F3;&#x82B1;&#x8D39;&#x51E0;&#x4E2A;&#x6708;&#x5E72;&#x8FD9;&#x4E8B;)&#x3002;</p>
<blockquote>
<p>Like when Alan Cox was working on porting Linux to the 8086. Or the guy who built his own computer using an 8-bit microcontroller that he wired up to some RAM and an SD card, then wrote an ARM emulator for it, and booted Linux (really really slowly) on his board.</p>
</blockquote>
<p>&#x50CF;Alan Cox&#x79FB;&#x690D;Linux&#x5230;8086&#x4E0A;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x6216;&#x8005;&#x4E00;&#x4E9B;&#x4F7F;&#x7528;&#x4E86;&#x62E5;&#x6709;RAM&#x548C;SD&#x5361;&#x7684;8&#x4F4D;&#x5FAE;&#x5904;&#x7406;&#x5668;&#x6765;&#x6784;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5BB6;&#x4F19;&#xFF0C;&#x5728;&#x5F00;&#x53D1;&#x677F;&#x4E0A;&#x7F16;&#x5199;&#x4E00;&#x4E2A;ARM&#x4EFF;&#x771F;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x542F;&#x52A8;Linx(&#x975E;&#x5E38;&#x975E;&#x5E38;&#x6162;)&#x3002;</p>
<blockquote>
<p>What&#x2019;s your advice for developers who want to get involved?</p>
</blockquote>
<p>&#x4F60;&#x5BF9;&#x60F3;&#x8FDB;&#x5165;&#x8BE5;&#x9886;&#x57DF;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x6709;&#x4EC0;&#x4E48;&#x5EFA;&#x8BAE;&#xFF1F;</p>
<blockquote>
<p>Start small. It doesn&#x2019;t even have to be Linux - there&#x2019;s a lot of open source projects that need help, and you want to learn how to get involved. And once you <em>do</em> realize that user-mode programmers are wusses, and you want to get involved with kernel programming, don&#x2019;t try to revolutionize some core kernel code - try to find some really small nagging concern, and fix that one thing. Maybe a driver for hardware that you have access to that doesn&#x2019;t work as well as it should, things like that.</p>
</blockquote>
<p>&#x6162;&#x6162;&#x6765;&#x3002;&#x4E0D;&#x4E00;&#x5B9A;&#x975E;&#x8981;&#x505A;Linux&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x9700;&#x8981;&#x5E2E;&#x52A9;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x53C2;&#x4E0E;&#x5230;&#x5176;&#x4E2D;&#x3002;&#x4E00;&#x65E6;&#x4F60;&#x786E;&#x5B9E;&#x89C9;&#x5F97;&#x7528;&#x6237;&#x6A21;&#x5F0F;&#x7684;&#x7F16;&#x7A0B;&#x662F;&#x5728;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#xFF0C;&#x60F3;&#x8981;&#x53C2;&#x4E0E;&#x5230;&#x5185;&#x6838;&#x5F00;&#x53D1;&#x4E2D;&#xFF0C;&#x4E0D;&#x8981;&#x5C1D;&#x8BD5;&#x5BF9;&#x5185;&#x6838;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x5927;&#x6539;&#xFF0C;&#x5E94;&#x8BE5;&#x5C1D;&#x8BD5;&#x627E;&#x51FA;&#x4E00;&#x4E9B;&#x5C0F;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x89E3;&#x51B3;&#x6389;&#x3002;&#x4E00;&#x4E9B;&#x50CF;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x6CA1;&#x6709;&#x5982;&#x671F;&#x7684;&#x8FD0;&#x884C;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<blockquote>
<p>It takes a while to learn the ropes, and it really helps if people can see that you&#x2019;ve done other things before you start sending more involved patches.</p>
</blockquote>
<p>&#x5982;&#x679C;&#x5927;&#x5BB6;&#x770B;&#x5230;&#x4F60;&#x5728;&#x63D0;&#x4EA4;&#x5F88;&#x591A;&#x590D;&#x6742;&#x7684;&#x8865;&#x4E01;&#x524D;&#x5DF2;&#x7ECF;&#x505A;&#x4E86;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x82B1;&#x4E9B;&#x65F6;&#x95F4;&#x5B66;&#x4E60;&#x534F;&#x540C;&#x5F00;&#x53D1;&#x662F;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#x3002;</p>
<blockquote>
<p>But the most important thing is &#x201C;have good taste.&#x201D; It&#x2019;s hard to describe, but it&#x2019;s something I personally look for. People who do things the &#x201C;RightWay(tm)&#x201D; - and I&#x2019;m not meaning that you should follow all the rules we have come up with over the years (although you should do that, too) - but I&#x2019;m talking about that elusive quality of writing code that makes obvious sense and does the right thing without lots of special cases or complexity, but also without being unnecessarily abstract and general-purpose. &#x201C;Do one thing, and do it well.&#x201D;</p>
</blockquote>
<p>&#x4F46;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x8981;&#x6709;&#x597D;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x8FD9;&#x4E2A;&#x662F;&#x975E;&#x5E38;&#x96BE;&#x63CF;&#x8FF0;&#x7684;&#xFF0C;&#x5374;&#x662F;&#x6211;&#x4E2A;&#x4EBA;&#x5BFB;&#x627E;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x505A;&#x6B63;&#x786E;&#x7684;&#x4E8B;&#x60C5;&#x7684;&#x4EBA;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x4F60;&#x5E94;&#x8BE5;&#x9075;&#x5B88;&#x6240;&#x6709;&#x7684;&#x4E4B;&#x524D;&#x5EFA;&#x7ACB;&#x7684;&#x89C4;&#x5219;?????</p>
<blockquote>
<p>What do you listen to when you code?</p>
</blockquote>
<p>&#x4F60;&#x5728;&#x7F16;&#x7801;&#x7684;&#x65F6;&#x5019;&#x542C;&#x4EC0;&#x4E48;&#xFF1F;</p>
<blockquote>
<p>Oh, I want my office to be totally silent. I listen to music when I&#x2019;m driving the kids around, etc., but when I&#x2019;m working, I don&#x2019;t want to hear anything. Not music, not any noise from the fans in my computers. Just stillness.</p>
</blockquote>
<p>&#x6211;&#x9700;&#x8981;&#x5B8C;&#x5168;&#x5B89;&#x9759;&#x7684;&#x529E;&#x516C;&#x5BA4;&#x3002;&#x5F53;&#x6211;&#x9A71;&#x8F66;&#x5E26;&#x5B69;&#x5B50;&#x7684;&#x65F6;&#x5019;&#x624D;&#x542C;&#x97F3;&#x4E50;&#xFF0C;&#x5DE5;&#x4F5C;&#x65F6;&#x6211;&#x4E0D;&#x60F3;&#x542C;&#x5230;&#x4EFB;&#x4F55;&#x58F0;&#x54CD;&#x3002;&#x4E0D;&#x80FD;&#x6709;&#x97F3;&#x4E50;&#xFF0C;&#x7535;&#x8111;&#x7684;&#x98CE;&#x6247;&#x4E5F;&#x4E0D;&#x80FD;&#x6709;&#x566A;&#x97F3;&#x3002;&#x53EA;&#x8981;&#x5B89;&#x9759;&#x3002;</p>
<blockquote>
<p>What mailing list or IRC channel will people find you hanging out at? What conference(s)?</p>
</blockquote>
<p>&#x5728;&#x54EA;&#x4E2A;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#x6216;IRC&#x9891;&#x9053;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x4F60;&#xFF1F;&#x4F1A;&#x8BAE;&#x5462;&#xFF1F;</p>
<blockquote>
<p>I don&#x2019;t do IRC or any other real-time interactive stuff - I do everything by email. I follow the general kernel and git mailing lists, but even those I have in &#x201C;auto-archival&#x201D; mode, so that I only see the threads if I explicitly look for them or if I&#x2019;m cc&#x2019;d or pointed at them.</p>
</blockquote>
<p>&#x6211;&#x4E0D;&#x4F7F;&#x7528;IRC&#x6216;&#x5176;&#x4ED6;&#x7684;&#x5B9E;&#x65F6;&#x901A;&#x8BAF;&#x5DE5;&#x5177;&#xFF0C;&#x6211;&#x53EA;&#x7528;&#x90AE;&#x4EF6;&#x3002;&#x6211;&#x63A5;&#x6536;&#x6240;&#x6709;&#x7684;&#x5185;&#x6838;&#x548C;git&#x90AE;&#x4EF6;&#x5217;&#x8868;&#xFF0C;&#x4F46;&#x6211;&#x6709;&#x81EA;&#x52A8;&#x5206;&#x6790;&#x6A21;&#x5F0F;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x5C31;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x6211;&#x5173;&#x6CE8;&#x7684;&#x6216;&#x8005;&#x6211;&#x6709;&#x88AB;CC&#x6216;&#x8981;&#x6C42;&#x67E5;&#x770B;&#x7684;&#x4E3B;&#x9898;&#x3002;</p>
<blockquote>
<p>As to conferences, it&#x2019;s usually just the Linux Kernel Summit. I try to get to LinuxConf Australia most years too - I like it as a conference and it&#x2019;s in Australia during their summer. But LCA is a &#x201C;when it works out&#x201D; kind of thing, so it&#x2019;s probably only every other year or so.</p>
</blockquote>
<p>&#x81F3;&#x4E8E;&#x4F1A;&#x8BAE;&#xFF0C;&#x53EA;&#x6709;Linux&#x5185;&#x6838;&#x5CF0;&#x4F1A;&#x3002;&#x6211;&#x6709;&#x597D;&#x51E0;&#x5E74;&#x5C1D;&#x8BD5;&#x53C2;&#x52A0;&#x6FB3;&#x5927;&#x5229;&#x4E9A;Linux&#x4F1A;&#x8BAE;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5728;&#x6FB3;&#x5927;&#x5229;&#x4E9A;&#x7684;&#x590F;&#x5929;&#x4E3E;&#x884C;&#x7684;&#x4F1A;&#x8BAE;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x559C;&#x6B22;&#x3002;&#x4F46;????</p>
<blockquote>
<p>There&#x2019;s been a few other conferences I go to, usually because they&#x2019;re in an interesting area and if I can get some scuba diving done during the same trip</p>
</blockquote>
<p>&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x4F1A;&#x8BAE;&#xFF0C;&#x901A;&#x5E38;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x5728;&#x4E00;&#x6211;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x9886;&#x57DF;&#x4EE5;&#x53CA;&#x5728;&#x53C2;&#x4E0E;&#x7684;&#x8FC7;&#x7A0B;????</p>
<blockquote>
<p>Thank you, Linus! Next week we talk to Thomas Gleixner. </p>
</blockquote>
<p>&#x611F;&#x8C22;&#x4F60;&#xFF0C;Linus&#xFF01;&#x4E0B;&#x5468;&#x6211;&#x4EEC;&#x5BF9;&#x8BDD;Thomas Gleixner&#x3002;</p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://matrix207.github.com/2013/03/01/30-linux-kernel-developers-in-30-weeks-linus-torvalds/" data-id="cinefv6yz003qjiizicp7tj2n" class="article-share-link">Share</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Translation/">Translation</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2013/03/02/30-linux-kernel-developers-in-30-weeks-paul-mckenney/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          30 Linux Kernel Developers in 30 Weeks: Paul McKenney
        
      </div>
    </a>
  
  
    <a href="/2013/02/15/frequently-questions/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">frequently questions</div>
    </a>
  
</nav>

  
</article>

</section>
        
          <aside id="sidebar">
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Categories</h3>
    <div class="widget">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/article/">article</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/blog/">blog</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/database/">database</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/english/">english</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/kernel/">kernel</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/language/">language</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/linux/">linux</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/math/">math</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/network/">network</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/others/">others</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/person/">person</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/program/">program</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/source/">source</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/storage/">storage</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/tools/">tools</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/windows/">windows</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tag Cloud</h3>
    <div class="widget tagcloud">
      <a href="/tags/FAQ/" style="font-size: 10px;">FAQ</a> <a href="/tags/IRC/" style="font-size: 10px;">IRC</a> <a href="/tags/Translation/" style="font-size: 13px;">Translation</a> <a href="/tags/android/" style="font-size: 10px;">android</a> <a href="/tags/api/" style="font-size: 10px;">api</a> <a href="/tags/awk/" style="font-size: 11px;">awk</a> <a href="/tags/batch/" style="font-size: 14px;">batch</a> <a href="/tags/blog/" style="font-size: 10px;">blog</a> <a href="/tags/book/" style="font-size: 10px;">book</a> <a href="/tags/c/" style="font-size: 15px;">c</a> <a href="/tags/c/" style="font-size: 19px;">c++</a> <a href="/tags/cache/" style="font-size: 10px;">cache</a> <a href="/tags/crash/" style="font-size: 10px;">crash</a> <a href="/tags/database/" style="font-size: 17px;">database</a> <a href="/tags/debug/" style="font-size: 12px;">debug</a> <a href="/tags/dot/" style="font-size: 10px;">dot</a> <a href="/tags/driver/" style="font-size: 10px;">driver</a> <a href="/tags/emacs/" style="font-size: 11px;">emacs</a> <a href="/tags/exploit/" style="font-size: 10px;">exploit</a> <a href="/tags/file-system/" style="font-size: 10px;">file system</a> <a href="/tags/filesystem/" style="font-size: 12px;">filesystem</a> <a href="/tags/flowchart/" style="font-size: 10px;">flowchart</a> <a href="/tags/git/" style="font-size: 12px;">git</a> <a href="/tags/google/" style="font-size: 11px;">google</a> <a href="/tags/graphviz/" style="font-size: 11px;">graphviz</a> <a href="/tags/hexo/" style="font-size: 10px;">hexo</a> <a href="/tags/hosts/" style="font-size: 10px;">hosts</a> <a href="/tags/iscsi/" style="font-size: 14px;">iscsi</a> <a href="/tags/java/" style="font-size: 10px;">java</a> <a href="/tags/javascript/" style="font-size: 10px;">javascript</a> <a href="/tags/job/" style="font-size: 10px;">job</a> <a href="/tags/json/" style="font-size: 10px;">json</a> <a href="/tags/kernel/" style="font-size: 14px;">kernel</a> <a href="/tags/linux/" style="font-size: 14px;">linux</a> <a href="/tags/lisp/" style="font-size: 10px;">lisp</a> <a href="/tags/lua/" style="font-size: 10px;">lua</a> <a href="/tags/makefile/" style="font-size: 10px;">makefile</a> <a href="/tags/malloc/" style="font-size: 10px;">malloc</a> <a href="/tags/math/" style="font-size: 11px;">math</a> <a href="/tags/maxima/" style="font-size: 10px;">maxima</a> <a href="/tags/memory/" style="font-size: 11px;">memory</a> <a href="/tags/memory-overflow/" style="font-size: 10px;">memory overflow</a> <a href="/tags/mtrace/" style="font-size: 10px;">mtrace</a> <a href="/tags/netdisk/" style="font-size: 10px;">netdisk</a> <a href="/tags/network/" style="font-size: 20px;">network</a> <a href="/tags/others/" style="font-size: 18px;">others</a> <a href="/tags/pandoc/" style="font-size: 10px;">pandoc</a> <a href="/tags/performance/" style="font-size: 16px;">performance</a> <a href="/tags/person/" style="font-size: 11px;">person</a> <a href="/tags/protobuf/" style="font-size: 11px;">protobuf</a> <a href="/tags/python/" style="font-size: 10px;">python</a> <a href="/tags/rsync/" style="font-size: 10px;">rsync</a> <a href="/tags/sed/" style="font-size: 11px;">sed</a> <a href="/tags/shell/" style="font-size: 15px;">shell</a> <a href="/tags/skype/" style="font-size: 11px;">skype</a> <a href="/tags/sms/" style="font-size: 10px;">sms</a> <a href="/tags/source/" style="font-size: 11px;">source</a> <a href="/tags/ssh/" style="font-size: 10px;">ssh</a> <a href="/tags/stack/" style="font-size: 10px;">stack</a> <a href="/tags/storage/" style="font-size: 15px;">storage</a> <a href="/tags/study/" style="font-size: 10px;">study</a> <a href="/tags/svn/" style="font-size: 11px;">svn</a> <a href="/tags/sync/" style="font-size: 10px;">sync</a> <a href="/tags/test/" style="font-size: 11px;">test</a> <a href="/tags/time/" style="font-size: 10px;">time</a> <a href="/tags/tools/" style="font-size: 15px;">tools</a> <a href="/tags/valgrind/" style="font-size: 10px;">valgrind</a> <a href="/tags/vi/" style="font-size: 10px;">vi</a> <a href="/tags/vim/" style="font-size: 14px;">vim</a> <a href="/tags/virtual/" style="font-size: 11px;">virtual</a> <a href="/tags/wget/" style="font-size: 10px;">wget</a> <a href="/tags/windows/" style="font-size: 11px;">windows</a> <a href="/tags/wireshark/" style="font-size: 10px;">wireshark</a> <a href="/tags/write/" style="font-size: 13px;">write</a> <a href="/tags/xml/" style="font-size: 10px;">xml</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Archives</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/04/">April 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/03/">March 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/02/">February 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/01/">January 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/11/">November 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/10/">October 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/09/">September 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/08/">August 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/07/">July 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/06/">June 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/03/">March 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/02/">February 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/01/">January 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/12/">December 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/11/">November 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/09/">September 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/08/">August 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/07/">July 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/06/">June 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/05/">May 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/04/">April 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/03/">March 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/11/">November 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/10/">October 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/09/">September 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/08/">August 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/07/">July 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/06/">June 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/05/">May 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/04/">April 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/03/">March 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/02/">February 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/01/">January 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2012/12/">December 2012</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2012/09/">September 2012</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Recent Posts</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2016/04/24/speed-up-cplusplus-compilation/">speed up c++ compilation</a>
          </li>
        
          <li>
            <a href="/2016/04/18/hexo/">Hexo</a>
          </li>
        
          <li>
            <a href="/2016/04/13/malloc/">malloc</a>
          </li>
        
          <li>
            <a href="/2016/03/12/performance-optimization-of-cplusplus/">performance optimization of C++</a>
          </li>
        
          <li>
            <a href="/2016/03/09/stack-trace-when-program-crash/">stack trace when program crash</a>
          </li>
        
      </ul>
    </div>
  </div>

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2016 Matrix207<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>
    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
    <a href="/about" class="mobile-nav-link">About</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>