<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>30个自我提升技巧 | Matrix207&#39;s Blog</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x4F60;&amp;#x53EF;&amp;#x4EE5;&amp;#x5229;&amp;#x7528;&amp;#x8FD9;&amp;#x4E9B;&amp;#x81EA;&amp;#x6211;&amp;#x63D0;&amp;#x5347;&amp;#x6280;&amp;#x5DE7;&amp;#x4F5C;&amp;#x4E3A;&amp;#x63D0;&amp;#x5347;&amp;#x81EA;&amp;#x8EAB;&amp;#x4F5C;&amp;#x4E3A;&amp;#x7684;&amp;#x7EB2;&amp;#x9886;&amp;#xFF1A;">
<meta property="og:type" content="website">
<meta property="og:title" content="30个自我提升技巧">
<meta property="og:url" content="http://matrix207.github.com/person/self-improve.html">
<meta property="og:site_name" content="Matrix207's Blog">
<meta property="og:description" content="&amp;#x4F60;&amp;#x53EF;&amp;#x4EE5;&amp;#x5229;&amp;#x7528;&amp;#x8FD9;&amp;#x4E9B;&amp;#x81EA;&amp;#x6211;&amp;#x63D0;&amp;#x5347;&amp;#x6280;&amp;#x5DE7;&amp;#x4F5C;&amp;#x4E3A;&amp;#x63D0;&amp;#x5347;&amp;#x81EA;&amp;#x8EAB;&amp;#x4F5C;&amp;#x4E3A;&amp;#x7684;&amp;#x7EB2;&amp;#x9886;&amp;#xFF1A;">
<meta property="og:updated_time" content="2016-04-27T15:58:10.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="30个自我提升技巧">
<meta name="twitter:description" content="&amp;#x4F60;&amp;#x53EF;&amp;#x4EE5;&amp;#x5229;&amp;#x7528;&amp;#x8FD9;&amp;#x4E9B;&amp;#x81EA;&amp;#x6211;&amp;#x63D0;&amp;#x5347;&amp;#x6280;&amp;#x5DE7;&amp;#x4F5C;&amp;#x4E3A;&amp;#x63D0;&amp;#x5347;&amp;#x81EA;&amp;#x8EAB;&amp;#x4F5C;&amp;#x4E3A;&amp;#x7684;&amp;#x7EB2;&amp;#x9886;&amp;#xFF1A;">
  
    <link rel="alternate" href="/atom.xml" title="Matrix207&#39;s Blog" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">Matrix207&#39;s Blog</a>
      </h1>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
          <a class="main-nav-link" href="/about">About</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="Search"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://matrix207.github.com"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-undefined" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/person/self-improve.html" class="article-date">
  <time datetime="2016-04-27T15:58:10.000Z" itemprop="datePublished">2016-04-27</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      30个自我提升技巧
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <p><strong>&#x4F60;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x8FD9;&#x4E9B;&#x81EA;&#x6211;&#x63D0;&#x5347;&#x6280;&#x5DE7;&#x4F5C;&#x4E3A;&#x63D0;&#x5347;&#x81EA;&#x8EAB;&#x4F5C;&#x4E3A;&#x7684;&#x7EB2;&#x9886;&#xFF1A;</strong></p>
<ul>
<li><p>1&#x3001;&#x81EA;&#x5F8B;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x5728;&#x751F;&#x6D3B;&#x4E2D;&#x79EF;&#x6781;&#x5411;&#x4E0A;&#xFF0C;&#x8FD9;&#x662F;&#x5341;&#x5206;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#x3002;&#x6BCF;&#x4E2A;&#x6210;&#x529F;&#x8005;&#x90FD;&#x662F;&#x9AD8;&#x5EA6;&#x81EA;&#x5F8B;&#x7684;&#x4EBA;&#x3002;&#x5982;&#x679C;&#x4F60;&#x61D2;&#x60F0;&#x53C8;&#x6CA1;&#x6709;&#x5F3A;&#x6709;&#x529B;&#x7684;&#x4E00;&#x9762;&#xFF0C;&#x4F60;&#x5F88;&#x53EF;&#x80FD;&#x5C31;&#x8981;&#x8FC7;&#x7740;&#x5E73;&#x5EB8;&#x7684;&#x751F;&#x6D3B;&#x4E86;&#x3002;</p>
</li>
<li><p>2&#x3001;&#x8BBE;&#x5B9A;&#x76EE;&#x6807;&#x3002;&#x4F60;&#x9700;&#x8981;&#x5728;&#x751F;&#x6D3B;&#x4E2D;&#x8BBE;&#x5B9A;&#x76EE;&#x6807;&#x4EE5;&#x5B9E;&#x73B0;&#x81EA;&#x6211;&#x63D0;&#x5347;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x4F60;&#x4FBF;&#x4F1A;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x5B89;&#x4E50;&#x7A9D;&#x4E2D;&#x505C;&#x6EDE;&#x4E0D;&#x524D;&#x3002;&#x5C3D;&#x7BA1;&#x4F60;&#x77E5;&#x9053;&#x6539;&#x53D8;&#x5C06;&#x4F1A;&#x8BA9;&#x4F60;&#x5728;&#x591A;&#x65B9;&#x9762;&#x53D7;&#x76CA;&#xFF0C;&#x7F3A;&#x4E4F;&#x76EE;&#x6807;&#x7684;&#x4F60;&#x8FD8;&#x662F;&#x4E0D;&#x613F;&#x610F;&#x53BB;&#x6539;&#x53D8;&#x81EA;&#x5DF1;&#x7684;&#x5904;&#x5883;&#x3002;</p>
</li>
<li><p>3&#x3001;&#x79EF;&#x6781;&#x6001;&#x5EA6;&#x3002;&#x79EF;&#x6781;&#x7684;&#x6001;&#x5EA6;&#x80FD;&#x6FC0;&#x53D1;&#x51FA;&#x4F60;&#x6700;&#x597D;&#x7684;&#x4E00;&#x9762;&#x3002;&#x5B83;&#x4F1A;&#x62B5;&#x5236;&#x4F60;&#x5076;&#x5C14;&#x51FA;&#x73B0;&#x7684;&#x6D88;&#x6781;&#x7684;&#x81EA;&#x6211;&#x6697;&#x793A;&#x3002;&#x540C;&#x65F6;&#x4F24;&#x611F;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x8D1F;&#x9762;&#x60C5;&#x7EEA;&#x4E5F;&#x4F1A;&#x5728;&#x4F60;&#x751F;&#x6D3B;&#x4E2D;&#x9010;&#x6B65;&#x6D88;&#x5931;&#x3002;</p>
</li>
<li><p>4&#x3001;&#x611F;&#x6069;&#x7684;&#x5FC3;&#x3002;&#x6BCF;&#x5F53;&#x4F60;&#x7ECF;&#x5386;&#x7F8E;&#x597D;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x8868;&#x8FBE;&#x4F60;&#x7684;&#x611F;&#x6FC0;&#x4E4B;&#x60C5;&#x3002;&#x8FD9;&#x4F1A;&#x4E3A;&#x4F60;&#x5E26;&#x6765;&#x66F4;&#x591A;&#x66F4;&#x7F8E;&#x597D;&#x7684;&#x4E8B;&#x7269;&#x3002;&#x611F;&#x6FC0;&#x53EF;&#x4EE5;&#x521B;&#x9020;&#x5947;&#x8FF9;&#x3002;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x4E00;&#x6BB5;&#x611F;&#x6FC0;&#x4E4B;&#x65C5;&#x2014;&#x2014;&#x6BCF;&#x5929;&#x82B1;&#x4E94;&#x5206;&#x949F;&#x65F6;&#x95F4;&#x5199;&#x4E0B;&#x4F60;&#x611F;&#x6FC0;&#x3002;</p>
</li>
<li><p>5&#x3001;&#x953B;&#x70BC;&#x3002;&#x6BCF;&#x5929;&#x7684;&#x953B;&#x70BC;&#x53EF;&#x4EE5;&#x7F13;&#x89E3;&#x538B;&#x529B;&#xFF0C;&#x5F3A;&#x8EAB;&#x58EE;&#x4F53;&#xFF0C;&#x4E5F;&#x80FD;&#x6539;&#x5584;&#x81EA;&#x6211;&#x611F;&#x89C9;&#x3002;</p>
</li>
<li><p>6&#x3001;&#x6DF1;&#x601D;&#x719F;&#x8651;&#x3002;&#x8BA4;&#x771F;&#x601D;&#x8003;&#x4F1A;&#x7406;&#x6E05;&#x4F60;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x6D88;&#x9664;&#x8D1F;&#x9762;&#x601D;&#x60F3;&#x5E76;&#x628A;&#x4F60;&#x7684;&#x5E78;&#x798F;&#x611F;&#x63D0;&#x9AD8;&#x5230;&#x65B0;&#x7684;&#x5C42;&#x9762;&#x3002;&#x8FD9;&#x5C06;&#x4F1A;&#x6539;&#x5584;&#x4F60;&#x7684;&#x751F;&#x6D3B;&#x3002;</p>
</li>
<li><p>7&#x3001;&#x53D1;&#x6325;&#x81EA;&#x5DF1;&#x7684;&#x4EF7;&#x503C;&#x3002;&#x5F53;&#x4F60;&#x5F00;&#x59CB;&#x60F3;&#x8981;&#x53D1;&#x6325;&#x81EA;&#x8EAB;&#x4F5C;&#x7528;&#x65F6;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x4F60;&#x5728;&#x4E0D;&#x65AD;&#x63D0;&#x5347;&#x81EA;&#x6211;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8BDA;&#x5FC3;&#x8BDA;&#x610F;&#x5730;&#x4ED8;&#x8BF8;&#x884C;&#x52A8;&#xFF0C;&#x4EBA;&#x4EEC;&#x4E5F;&#x4F1A;&#x597D;&#x597D;&#x7292;&#x8D4F;&#x4F60;&#x5E76;&#x8877;&#x5FC3;&#x611F;&#x8C22;&#x4F60;&#x3002;</p>
</li>
<li><p>8&#x3001;&#x628A;&#x63E1;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x60F3;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x638C;&#x63A7;&#x81EA;&#x5DF1;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x5929;&#x662F;&#x638C;&#x63A7;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x60F3;&#x3002;&#x4E0D;&#x8981;&#x8BA9;&#x5927;&#x8111;&#x7684;&#x601D;&#x60F3;&#x9677;&#x5165;&#x6DF7;&#x4E71;&#x4E4B;&#x4E2D;&#x3002;&#x7BA1;&#x7406;&#x4ED6;&#x4EEC;&#x2014;&#x2014;&#x53BB;&#x7C97;&#x53D6;&#x7CBE;&#xFF0C;&#x626C;&#x957F;&#x907F;&#x77ED;&#x3002;&#x8FD9;&#x4F1A;&#x4E3A;&#x4F60;&#x7684;&#x81EA;&#x6211;&#x63D0;&#x5347;&#x5960;&#x5B9A;&#x575A;&#x5B9E;&#x7684;&#x57FA;&#x7840;&#x3002;</p>
</li>
<li><p>9&#x3001;&#x6DF1;&#x5316;&#x4F60;&#x7684;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#x3002;&#x575A;&#x6301;&#x6BCF;&#x5929;&#x81F3;&#x5C11;&#x82B1;30&#x5206;&#x949F;&#xFF08;1&#x5C0F;&#x65F6;&#x66F4;&#x4F73;&#xFF09;&#x5B66;&#x4E60;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x5B66;&#x79D1;&#x3002;&#x8FD9;&#x5C06;&#x589E;&#x5F3A;&#x4F60;&#x7684;&#x81EA;&#x4FE1;&#x5FC3;&#xFF0C;&#x540C;&#x65F6;&#x63D0;&#x9AD8;&#x667A;&#x529B;&#x3002;</p>
</li>
<li><p>10&#x3001;&#x6709;&#x6761;&#x4E0D;&#x7D0A;&#x3002;&#x5C1D;&#x8BD5;&#x63D0;&#x524D;&#x505A;&#x65E5;&#x8BA1;&#x5212;&#xFF0C;&#x4F60;&#x5C06;&#x80FD;&#x907F;&#x514D;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#xFF0C;&#x5E76;&#x628A;&#x7CBE;&#x529B;&#x96C6;&#x4E2D;&#x5728;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x4E0A;&#x3002;</p>
</li>
<li><p>11&#x3001;&#x4FDD;&#x6301;&#x6574;&#x6D01;&#x3002;&#x6574;&#x6D01;&#x7684;&#x751F;&#x6D3B;&#x73AF;&#x5883;&#x4E5F;&#x80FD;&#x4F7F;&#x4F60;&#x7684;&#x601D;&#x8DEF;&#x66F4;&#x4E3A;&#x660E;&#x6717;&#xFF0C;&#x4F60;&#x4E5F;&#x4F1A;&#x66F4;&#x6709;&#x6548;&#x7387;&#xFF0C;&#x66F4;&#x597D;&#x7684;&#x638C;&#x63A7;&#x81EA;&#x5DF1;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x8FD9;&#x662F;&#x6700;&#x80FD;&#x7EDF;&#x7B79;&#x81EA;&#x6211;&#x63D0;&#x5347;&#x7684;&#x601D;&#x60F3;&#x4E4B;&#x4E00;&#x3002;</p>
</li>
<li><p>12&#x3001;&#x591A;&#x4E0E;&#x79EF;&#x6781;&#x5411;&#x4E0A;&#x7684;&#x4EBA;&#x6765;&#x5F80;&#x3002;&#x5C1D;&#x8BD5;&#x7ED3;&#x4EA4;&#x79EF;&#x6781;&#x5411;&#x4E0A;&#x7684;&#x4EBA;&#x3002;&#x82B1;&#x65F6;&#x95F4;&#x548C;&#x90A3;&#x4E9B;&#x8BA9;&#x4F60;&#x611F;&#x53D7;&#x88AB;&#x7231;&#x548C;&#x5C0A;&#x4E25;&#x7684;&#x670B;&#x53CB;&#x5728;&#x4E00;&#x8D77;&#x3002;</p>
</li>
<li><p>13&#x3001;&#x6446;&#x8131;&#x65E0;&#x8DA3;&#x7684;&#x4EBA;&#x3002;&#x5C11;&#x548C;&#x8BA9;&#x4F60;&#x611F;&#x89C9;&#x7CDF;&#x7CD5;&#x7684;&#x4EBA;&#x4EA4;&#x8C08;&#xFF0C;&#x8FD9;&#x5C06;&#x964D;&#x4F4E;&#x4F60;&#x7684;&#x751F;&#x6D3B;&#x8D28;&#x91CF;&#x3002;&#x6CA1;&#x4EBA;&#x503C;&#x5F97;&#x4F60;&#x81EA;&#x6BC1;&#x5FC3;&#x60C5;&#x3002;</p>
</li>
<li><p>14&#x3001;&#x6539;&#x9020;&#x4F60;&#x7684;&#x5B89;&#x4E50;&#x7A9D;&#x3002;&#x591A;&#x5728;&#x751F;&#x6D3B;&#x4E2D;&#x5BFB;&#x6C42;&#x53D8;&#x5316;&#xFF0C;&#x4E0D;&#x8981;&#x5931;&#x53BB;&#x6D3B;&#x529B;&#x3002;&#x4E0D;&#x65AD;&#x5730;&#x6539;&#x9020;&#x8212;&#x9002;&#x533A;&#x57DF;&#x4F1A;&#x63D0;&#x5347;&#x751F;&#x6D3B;&#x8D28;&#x91CF;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x66F4;&#x52C7;&#x6562;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x9700;&#x8981;&#x5F3A;&#x5927;&#x7684;&#x610F;&#x5FD7;&#x529B;&#xFF0C;&#x662F;&#x81EA;&#x6211;&#x63D0;&#x5347;&#x4E2D;&#x96BE;&#x4EE5;&#x4F01;&#x53CA;&#x7684;&#x4E00;&#x73AF;&#x3002;</p>
</li>
<li><p>15&#x3001;&#x63D0;&#x5347;&#x8D22;&#x5BCC;&#x589E;&#x5E45;&#x3002;&#x8BBE;&#x60F3;&#x81EA;&#x5DF1;&#x53D8;&#x5F97;&#x5BCC;&#x6709;&#xFF0C;&#x5C1D;&#x8BD5;&#x53BB;&#x611F;&#x53D7;&#x53D8;&#x5BCC;&#x7684;&#x611F;&#x89C9;&#x3002;&#x8FD9;&#x4F1A;&#x6539;&#x53D8;&#x4F60;&#x7684;&#x8D22;&#x5BCC;&#x589E;&#x5E45;&#x3002;</p>
</li>
<li><p>16&#x3001;&#x4E0D;&#x8981;&#x7ADE;&#x4E89;&#x3002; &#x5C3D;&#x7BA1;&#x8BB8;&#x591A;&#x4EBA;&#x8BA4;&#x4E3A;&#x559C;&#x6B22;&#x7ADE;&#x4E89;&#x662F;&#x4EF6;&#x597D;&#x4E8B;&#xFF0C;&#x8FD9;&#x53EF;&#x8BF4;&#x4E0D;&#x51C6;&#x3002;&#x4F60;&#x5E94;&#x8BE5;&#x4E3A;&#x4ED6;&#x4EBA;&#x521B;&#x9020;&#x8D22;&#x5BCC;&#x800C;&#x975E;&#x62A2;&#x593A;&#x4ED6;&#x4EEC;&#x3002;&#x901A;&#x8FC7;&#x521B;&#x9020;&#x4F60;&#x53EF;&#x4EE5;&#x9003;&#x51FA;&#x7ADE;&#x4E89;&#x7684;&#x6076;&#x6027;&#x5FAA;&#x73AF;&#x3002;&#x4F60;&#x500D;&#x611F;&#x8F7B;&#x677E;&#xFF0C;&#x4E5F;&#x8D62;&#x5F97;&#x522B;&#x4EBA;&#x5BF9;&#x4F60;&#x7684;&#x521B;&#x9020;&#x7684;&#x8D5E;&#x8D4F;&#x3002;</p>
</li>
<li><p>17&#x3001;&#x4E3A;&#x4ED6;&#x4EBA;&#x9AD8;&#x5174;&#x3002;&#x5F53;&#x522B;&#x4EBA;&#x83B7;&#x5F97;&#x6210;&#x529F;&#x65F6;&#xFF0C;&#x4E3A;&#x4ED6;&#x4EEC;&#x559D;&#x5F69;&#x3002;&#x8FD9;&#x4F1A;&#x8BA9;&#x4EBA;&#x500D;&#x611F;&#x826F;&#x597D;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x4F1A;&#x56E0;&#x6B64;&#x611F;&#x8C22;&#x4F60;&#x3002;&#x5F53;&#x4F60;&#x6536;&#x83B7;&#x611F;&#x6FC0;&#x65F6;&#xFF0C;&#x4F60;&#x4E5F;&#x4F1A;&#x611F;&#x89C9;&#x66F4;&#x597D;&#x3002;</p>
</li>
<li><p>18&#x3001;&#x6B32;&#x53D6;&#x5148;&#x4E88;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x6536;&#x83B7;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x53BB;&#x4ED8;&#x51FA;&#x3002;&#x5927;&#x81EA;&#x7136;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x8FD0;&#x4F5C;&#x3002;&#x6253;&#x4E2A;&#x6BD4;&#x65B9;&#xFF0C;&#x4F60;&#x60F3;&#x6210;&#x4E3A;&#x67D0;&#x4E2A;&#x9886;&#x57DF;&#x7684;&#x4E13;&#x5BB6;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x65F6;&#x95F4;&#x53BB;&#x83B7;&#x53D6;&#x3002;&#x81EA;&#x6211;&#x63D0;&#x5347;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x6E90;&#x4E8E;&#x81EA;&#x7136;&#x6CD5;&#x5219;&#x3002;</p>
</li>
<li><p>19&#x3001;&#x5C11;&#x770B;&#x7535;&#x89C6;&#x3002;&#x5C11;&#x770B;&#x7535;&#x89C6;&#x4F1A;&#x8BA9;&#x4F60;&#x5F00;&#x59CB;&#x5B66;&#x4F1A;&#x601D;&#x8003;&#xFF0C;&#x6446;&#x8131;&#x6050;&#x60E7;&#x3002;</p>
</li>
<li><p>20&#x3001;&#x5584;&#x5F85;&#x81EA;&#x5DF1;&#x3002;&#x597D;&#x597D;&#x7167;&#x987E;&#x81EA;&#x5DF1;&#xFF0C;&#x8FD9;&#x4E5F;&#x4F1A;&#x5927;&#x5927;&#x6539;&#x5584;&#x5FC3;&#x60C5;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x7A7F;&#x6234;&#x6574;&#x4F53;&#x5927;&#x65B9;&#xFF0C;&#x6ECB;&#x517B;&#x4F60;&#x7684;&#x76AE;&#x80A4;&#xFF0C;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x65F6;&#x95F4;&#x4F11;&#x517B;&#x3002;</p>
</li>
<li><p>21&#x3001;&#x65C5;&#x884C;&#x3002;&#x73B0;&#x5728;&#x53BB;&#x5404;&#x56FD;&#x6E38;&#x5386;&#x5DF2;&#x7ECF;&#x7B80;&#x5355;&#x8BB8;&#x591A;&#x3002;&#x597D;&#x597D;&#x5229;&#x7528;&#x8FD9;&#x4E00;&#x4FBF;&#x5229;&#xFF0C;&#x5F00;&#x59CB;&#x4F60;&#x7684;&#x65C5;&#x9014;&#xFF01;&#x4F60;&#x4F1A;&#x9047;&#x5230;&#x6709;&#x8DA3;&#x7684;&#x4EBA;&#x3001;&#x770B;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x611F;&#x53D7;&#x81EA;&#x7531;&#x4E0E;&#x72EC;&#x7ACB;&#xFF08;&#x7279;&#x522B;&#x5F53;&#x4F60;&#x5355;&#x72EC;&#x51FA;&#x6E38;&#x65F6;&#xFF09;&#x3002;</p>
</li>
<li><p>22&#x3001;&#x5584;&#x59CB;&#x5584;&#x7EC8;&#x3002;&#x4E0D;&#x8981;&#x534A;&#x9014;&#x800C;&#x5E9F;&#x3002;&#x5B8C;&#x6210;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x53EF;&#x4EE5;&#x63D0;&#x5347;&#x4F60;&#x7684;&#x81EA;&#x4FE1;&#x5FC3;&#xFF0C;&#x81EA;&#x6211;&#x6FC0;&#x52B1;&#x3002;&#x5F88;&#x591A;&#x4EBA;&#x6CA1;&#x80FD;&#x505A;&#x5230;&#x8FD9;&#x70B9;&#xFF0C;&#x540C;&#x6837;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x6CA1;&#x80FD;&#x53D6;&#x5F97;&#x4F18;&#x79C0;&#x7684;&#x6210;&#x679C;&#x3002;</p>
</li>
<li><p>23&#x3001;&#x514B;&#x670D;&#x6050;&#x60E7;&#x3002;&#x6050;&#x60E7;&#x662F;&#x552F;&#x4E00;&#x80FD;&#x963B;&#x6321;&#x4F60;&#x524D;&#x8FDB;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x60F3;&#x8981;&#x514B;&#x670D;&#x6050;&#x60E7;&#xFF0C;&#x4F60;&#x5148;&#x8981;&#x611F;&#x53D7;&#x6050;&#x60E7;&#xFF0C;&#x7136;&#x540E;&#x60F3;&#x529E;&#x6CD5;&#x514B;&#x670D;&#x5B83;&#x3002;&#x597D;&#x597D;&#x4F53;&#x4F1A;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x53EA;&#x6709;&#x5982;&#x6B64;&#xFF0C;&#x65B9;&#x80FD;&#x514B;&#x670D;&#x6050;&#x60E7;&#x3002;&#x6700;&#x7EC8;&#x4F60;&#x4F1A;&#x66F4;&#x81EA;&#x4FE1;&#xFF0C;&#x66F4;&#x80FD;&#x56E0;&#x65F6;&#x800C;&#x53D8;&#x3002;&#x4F60;&#x4F1A;&#x5E38;&#x5E38;&#x56DE;&#x9996;&#x8FC7;&#x53BB;&#xFF0C;&#x5BF9;&#x8FC7;&#x53BB;&#x5BB3;&#x6015;&#x7684;&#x4E8B;&#x7269;&#x4E00;&#x7B11;&#x800C;&#x8FC7;&#x3002;</p>
</li>
<li><p>24&#x3001;&#x6539;&#x53D8;&#x4E00;&#x4E2A;&#x4E60;&#x60EF;&#x3002;&#x81F3;&#x5C11;&#x5F7B;&#x5E95;&#x6539;&#x53D8;&#x4E00;&#x4E2A;&#x4E60;&#x60EF;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6BCF;&#x5929;&#x665A;&#x8D77;&#x5E8A;&#xFF0C;&#x8BBE;&#x95F9;&#x949F;&#x8BA9;&#x81EA;&#x5DF1;&#x65E9;&#x8D77;&#x4E00;&#x4E9B;&#x3002;&#x8FD9;&#x53EF;&#x5E76;&#x4E0D;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x575A;&#x6301;30&#x5929;&#xFF0C;&#x8FD9;&#x9879;&#x65B0;&#x4EFB;&#x52A1;&#x5C06;&#x6210;&#x4E3A;&#x4F60;&#x7684;&#x4E60;&#x60EF;&#x3002;</p>
</li>
<li><p>25&#x3001;&#x6295;&#x5165;&#x591A;&#x4E00;&#x500D;&#x7684;&#x65F6;&#x95F4;&#x53BB;&#x4ECE;&#x4E8B;&#x7231;&#x597D;&#x3002;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x5730;&#x62BD;&#x65F6;&#x95F4;&#x53BB;&#x505A;&#x4F60;&#x559C;&#x7231;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x8FD9;&#x4E5F;&#x5C06;&#x4E0D;&#x65AD;&#x5730;&#x6539;&#x5584;&#x4F60;&#x7684;&#x8EAB;&#x5FC3;&#x5065;&#x5EB7;&#x3002;&#x5174;&#x8BB8;&#x4F60;&#x8FD8;&#x80FD;&#x4F9D;&#x9760;&#x4F60;&#x7684;&#x7231;&#x597D;&#x8D5A;&#x94B1;&#x5462;&#x3002;</p>
</li>
<li><p>26&#x3001;&#x591A;&#x5FAE;&#x7B11;&#x3002;&#x4F60;&#x4F1A;&#x611F;&#x89C9;&#x66F4;&#x597D;&#xFF0C;&#x7F8E;&#x597D;&#x7684;&#x4E8B;&#x60C5;&#x4E5F;&#x4F1A;&#x4E0D;&#x65AD;&#x627E;&#x4E0A;&#x95E8;&#x6765;&#x3002;&#x7B80;&#x7B80;&#x5355;&#x5355;&#x7684;&#x4E00;&#x4E2A;&#x5FAE;&#x7B11;&#xFF0C;&#x4F1A;&#x7ED9;&#x751F;&#x6D3B;&#x5E26;&#x6765;&#x5F88;&#x5927;&#x7684;&#x6539;&#x89C2;&#x3002;&#x4F60;&#x6240;&#x9700;&#x8981;&#x7684;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x4ECE;&#x73B0;&#x5728;&#x5F00;&#x59CB;&#x53BB;&#x505A;&#x3002;</p>
</li>
<li><p>27&#x3001;&#x503E;&#x542C;&#x4F60;&#x559C;&#x7231;&#x7684;&#x97F3;&#x4E50;&#x3002;&#x8FD9;&#x4F1A;&#x8BA9;&#x4F60;&#x66F4;&#x5F00;&#x5FC3;&#xFF0C;&#x66F4;&#x80FD;&#x6FC0;&#x53D1;&#x4F60;&#x7684;&#x7075;&#x611F;&#x3002;&#x7075;&#x611F;&#x5BF9;&#x521B;&#x610F;&#x53EF;&#x662F;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#x3002;</p>
</li>
<li><p>28&#x3001;&#x9605;&#x8BFB;&#x81EA;&#x6211;&#x63D0;&#x5347;&#x7684;&#x4E66;&#x7C4D;&#x3002;&#x63D0;&#x524D;&#x4E3A;&#x4F60;&#x4E0B;&#x4E00;&#x6B65;&#x7684;&#x63D0;&#x5347;&#x505A;&#x597D;&#x51C6;&#x5907;&#x3002;</p>
</li>
<li><p>29&#x3001;&#x6446;&#x8131;&#x65E0;&#x7528;&#x4E4B;&#x4E8B;&#x3002;&#x628A;&#x5BB6;&#x4E2D;&#x6CA1;&#x7528;&#x7684;&#x4E1C;&#x897F;&#x5168;&#x90E8;&#x6E05;&#x6389;&#x3002;&#x8FD9;&#x4F1A;&#x7ED9;&#x597D;&#x7684;&#x4E1C;&#x897F;&#x9884;&#x7559;&#x7A7A;&#x95F4;&#xFF0C;&#x4E5F;&#x540C;&#x6837;&#x80FD;&#x6539;&#x5584;&#x5FC3;&#x60C5;&#xFF0C;&#x4F60;&#x4F1A;&#x611F;&#x89C9;&#x66F4;&#x5B89;&#x5B81;&#xFF0C;&#x66F4;&#x6709;&#x521B;&#x9020;&#x529B;&#x3002;</p>
</li>
<li><p>30&#x3001;&#x8865;&#x5145;&#x8DB3;&#x591F;&#x7684;&#x6C34;&#x5206;&#x3002;&#x4FDD;&#x6301;&#x808C;&#x80A4;&#x7684;&#x67D4;&#x6ED1;&#xFF0C;&#x6392;&#x9664;&#x4F53;&#x5185;&#x7684;&#x6BD2;&#x7D20;&#xFF0C;&#x4F7F;&#x81EA;&#x5DF1;&#x66F4;&#x52A0;&#x5065;&#x5EB7;&#x3002;&#x8FD9;&#x5BF9;&#x5FC3;&#x7406;&#x5065;&#x5EB7;&#x4E5F;&#x540C;&#x6837;&#x6709;&#x5E2E;&#x52A9;&#x3002;</p>
</li>
</ul>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://matrix207.github.com/person/self-improve.html" data-id="cinn9brtm00i8kfizhbllme8v" class="article-share-link">Share</a>
      
      
    </footer>
  </div>
  
    
  
</article>

</section>
        
          <aside id="sidebar">
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Categories</h3>
    <div class="widget">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/blog/">blog</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/database/">database</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/english/">english</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/kernel/">kernel</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/language/">language</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/linux/">linux</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/math/">math</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/network/">network</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/others/">others</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/person/">person</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/program/">program</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/source/">source</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/storage/">storage</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/tools/">tools</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/windows/">windows</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tag Cloud</h3>
    <div class="widget tagcloud">
      <a href="/tags/FAQ/" style="font-size: 10px;">FAQ</a> <a href="/tags/IRC/" style="font-size: 10px;">IRC</a> <a href="/tags/Translation/" style="font-size: 13px;">Translation</a> <a href="/tags/android/" style="font-size: 10px;">android</a> <a href="/tags/api/" style="font-size: 10px;">api</a> <a href="/tags/assembly/" style="font-size: 10px;">assembly</a> <a href="/tags/awk/" style="font-size: 11px;">awk</a> <a href="/tags/batch/" style="font-size: 14px;">batch</a> <a href="/tags/blog/" style="font-size: 10px;">blog</a> <a href="/tags/book/" style="font-size: 10px;">book</a> <a href="/tags/c/" style="font-size: 15px;">c</a> <a href="/tags/c/" style="font-size: 19px;">c++</a> <a href="/tags/cache/" style="font-size: 10px;">cache</a> <a href="/tags/crash/" style="font-size: 10px;">crash</a> <a href="/tags/database/" style="font-size: 17px;">database</a> <a href="/tags/debug/" style="font-size: 12px;">debug</a> <a href="/tags/dot/" style="font-size: 10px;">dot</a> <a href="/tags/driver/" style="font-size: 10px;">driver</a> <a href="/tags/emacs/" style="font-size: 11px;">emacs</a> <a href="/tags/exploit/" style="font-size: 10px;">exploit</a> <a href="/tags/file-system/" style="font-size: 10px;">file system</a> <a href="/tags/filesystem/" style="font-size: 12px;">filesystem</a> <a href="/tags/flowchart/" style="font-size: 10px;">flowchart</a> <a href="/tags/gcc/" style="font-size: 10px;">gcc</a> <a href="/tags/git/" style="font-size: 12px;">git</a> <a href="/tags/google/" style="font-size: 11px;">google</a> <a href="/tags/graphviz/" style="font-size: 11px;">graphviz</a> <a href="/tags/hexo/" style="font-size: 10px;">hexo</a> <a href="/tags/hosts/" style="font-size: 10px;">hosts</a> <a href="/tags/iscsi/" style="font-size: 14px;">iscsi</a> <a href="/tags/java/" style="font-size: 10px;">java</a> <a href="/tags/javascript/" style="font-size: 10px;">javascript</a> <a href="/tags/job/" style="font-size: 10px;">job</a> <a href="/tags/json/" style="font-size: 10px;">json</a> <a href="/tags/kernel/" style="font-size: 14px;">kernel</a> <a href="/tags/linux/" style="font-size: 14px;">linux</a> <a href="/tags/lisp/" style="font-size: 10px;">lisp</a> <a href="/tags/lua/" style="font-size: 10px;">lua</a> <a href="/tags/makefile/" style="font-size: 10px;">makefile</a> <a href="/tags/malloc/" style="font-size: 10px;">malloc</a> <a href="/tags/math/" style="font-size: 11px;">math</a> <a href="/tags/maxima/" style="font-size: 10px;">maxima</a> <a href="/tags/memory/" style="font-size: 11px;">memory</a> <a href="/tags/memory-overflow/" style="font-size: 10px;">memory overflow</a> <a href="/tags/mtrace/" style="font-size: 10px;">mtrace</a> <a href="/tags/netdisk/" style="font-size: 10px;">netdisk</a> <a href="/tags/network/" style="font-size: 20px;">network</a> <a href="/tags/others/" style="font-size: 18px;">others</a> <a href="/tags/pandoc/" style="font-size: 10px;">pandoc</a> <a href="/tags/performance/" style="font-size: 16px;">performance</a> <a href="/tags/person/" style="font-size: 11px;">person</a> <a href="/tags/protobuf/" style="font-size: 11px;">protobuf</a> <a href="/tags/python/" style="font-size: 10px;">python</a> <a href="/tags/rsync/" style="font-size: 10px;">rsync</a> <a href="/tags/sed/" style="font-size: 11px;">sed</a> <a href="/tags/shell/" style="font-size: 15px;">shell</a> <a href="/tags/skype/" style="font-size: 11px;">skype</a> <a href="/tags/sms/" style="font-size: 10px;">sms</a> <a href="/tags/source/" style="font-size: 11px;">source</a> <a href="/tags/ssh/" style="font-size: 10px;">ssh</a> <a href="/tags/stack/" style="font-size: 10px;">stack</a> <a href="/tags/storage/" style="font-size: 15px;">storage</a> <a href="/tags/study/" style="font-size: 10px;">study</a> <a href="/tags/svn/" style="font-size: 11px;">svn</a> <a href="/tags/sync/" style="font-size: 10px;">sync</a> <a href="/tags/test/" style="font-size: 11px;">test</a> <a href="/tags/time/" style="font-size: 10px;">time</a> <a href="/tags/tools/" style="font-size: 15px;">tools</a> <a href="/tags/valgrind/" style="font-size: 10px;">valgrind</a> <a href="/tags/vi/" style="font-size: 10px;">vi</a> <a href="/tags/vim/" style="font-size: 14px;">vim</a> <a href="/tags/virtual/" style="font-size: 11px;">virtual</a> <a href="/tags/wget/" style="font-size: 10px;">wget</a> <a href="/tags/windows/" style="font-size: 11px;">windows</a> <a href="/tags/wireshark/" style="font-size: 10px;">wireshark</a> <a href="/tags/write/" style="font-size: 13px;">write</a> <a href="/tags/xml/" style="font-size: 10px;">xml</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Archives</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/04/">April 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/03/">March 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/02/">February 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/01/">January 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/11/">November 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/10/">October 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/09/">September 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/08/">August 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/07/">July 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/06/">June 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/03/">March 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/02/">February 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/01/">January 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/12/">December 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/11/">November 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/09/">September 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/08/">August 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/07/">July 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/06/">June 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/05/">May 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/04/">April 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/03/">March 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/11/">November 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/10/">October 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/09/">September 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/08/">August 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/07/">July 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/06/">June 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/05/">May 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/04/">April 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/03/">March 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/02/">February 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/01/">January 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2012/12/">December 2012</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2012/09/">September 2012</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Recent Posts</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2016/04/27/include-what-you-use/">使用IWYU整理头文件引用</a>
          </li>
        
          <li>
            <a href="/2016/04/24/understand-gcc-assembly-output/">understand gcc assembly output</a>
          </li>
        
          <li>
            <a href="/2016/04/24/speed-up-cplusplus-compilation/">speed up c++ compilation</a>
          </li>
        
          <li>
            <a href="/2016/04/18/hexo/">Hexo</a>
          </li>
        
          <li>
            <a href="/2016/04/13/malloc/">malloc</a>
          </li>
        
      </ul>
    </div>
  </div>

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2016 Matrix207<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>
    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
    <a href="/about" class="mobile-nav-link">About</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>