<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>storage technology | Matrix207&#39;s Blog</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="###&amp;#x4ECE;&amp;#x7814;&amp;#x53D1;&amp;#x89D2;&amp;#x5EA6;&amp;#x8C08;&amp;#x5B58;&amp;#x50A8;&amp;#x6280;&amp;#x672F;&amp;#x7684;&amp;#x5B66;&amp;#x4E60;
&amp;#x5BF9;&amp;#x4E8E;&amp;#x7814;&amp;#x53D1;&amp;#x4EBA;&amp;#x5458;&amp;#xFF0C;&amp;#x5B58;&amp;#x50A8;&amp;#x6280;&amp;#x672F;&amp;#x7">
<meta property="og:type" content="article">
<meta property="og:title" content="storage technology">
<meta property="og:url" content="http://matrix207.github.com/2014/07/18/storage-technology/index.html">
<meta property="og:site_name" content="Matrix207's Blog">
<meta property="og:description" content="###&amp;#x4ECE;&amp;#x7814;&amp;#x53D1;&amp;#x89D2;&amp;#x5EA6;&amp;#x8C08;&amp;#x5B58;&amp;#x50A8;&amp;#x6280;&amp;#x672F;&amp;#x7684;&amp;#x5B66;&amp;#x4E60;
&amp;#x5BF9;&amp;#x4E8E;&amp;#x7814;&amp;#x53D1;&amp;#x4EBA;&amp;#x5458;&amp;#xFF0C;&amp;#x5B58;&amp;#x50A8;&amp;#x6280;&amp;#x672F;&amp;#x7">
<meta property="og:updated_time" content="2016-04-17T17:41:08.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="storage technology">
<meta name="twitter:description" content="###&amp;#x4ECE;&amp;#x7814;&amp;#x53D1;&amp;#x89D2;&amp;#x5EA6;&amp;#x8C08;&amp;#x5B58;&amp;#x50A8;&amp;#x6280;&amp;#x672F;&amp;#x7684;&amp;#x5B66;&amp;#x4E60;
&amp;#x5BF9;&amp;#x4E8E;&amp;#x7814;&amp;#x53D1;&amp;#x4EBA;&amp;#x5458;&amp;#xFF0C;&amp;#x5B58;&amp;#x50A8;&amp;#x6280;&amp;#x672F;&amp;#x7">
  
    <link rel="alternate" href="/atom.xml" title="Matrix207&#39;s Blog" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">Matrix207&#39;s Blog</a>
      </h1>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
          <a class="main-nav-link" href="/about">About</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="Search"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://matrix207.github.com"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-storage-technology" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2014/07/18/storage-technology/" class="article-date">
  <time datetime="2014-07-17T16:00:00.000Z" itemprop="datePublished">2014-07-18</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      storage technology
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>###<a href="http://blog.csdn.net/liuaigui/article/details/5333752" target="_blank" rel="external">&#x4ECE;&#x7814;&#x53D1;&#x89D2;&#x5EA6;&#x8C08;&#x5B58;&#x50A8;&#x6280;&#x672F;&#x7684;&#x5B66;&#x4E60;</a></p>
<p>&#x5BF9;&#x4E8E;&#x7814;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x5B58;&#x50A8;&#x6280;&#x672F;&#x7684;&#x5B66;&#x4E60;&#x5185;&#x5BB9;&#x975E;&#x5E38;&#x4E4B;&#x591A;&#x3002;&#x6211;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x628A;&#x5B83;&#x4EEC;&#x5927;&#x81F4;&#x5206;&#x4E3A;&#x4EE5;&#x4E0B;8&#x9879;&#x5185;&#x5BB9;&#xFF1A;</p>
<ol>
<li>&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#xFF1A;UNIX/Linux/Windows&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#xFF0C;&#x8981;&#x6C42;&#x719F;&#x6089;&#x751A;&#x81F3;&#x7CBE;&#x901A;&#x3002;</li>
<li>&#x5F00;&#x53D1;&#x6280;&#x672F;&#xFF1A;C/C++&#xFF0C;&#x7F51;&#x7EDC;&#x7F16;&#x7A0B;&#xFF0C;&#x591A;&#x8FDB;&#x7A0B;/&#x591A;&#x7EBF;&#x7A0B;&#xFF0C;&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;&#x3002;&#x5982;&#x679C;&#x80FD;&#x638C;&#x63E1;&#x5185;&#x6838;&#x5F00;&#x53D1;&#x3001;&#x9A71;<br>&#x52A8;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x5219;&#x66F4;&#x4F73;&#x3002;</li>
<li>&#x5B58;&#x50A8;&#x57FA;&#x7840;&#xFF1A;&#x78C1;&#x76D8;&#x3001;RAID&#x9635;&#x5217;&#x3001;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7B49;&#x5B58;&#x50A8;&#x76F8;&#x5173;&#x786C;&#x4EF6;&#x548C;&#x8F6F;&#x4EF6;&#x7684;&#x5B89;&#x88C5;&#x3001;&#x914D;&#x7F6E;&#x3001;&#x8C03;&#x8BD5;&#x3002;</li>
<li>&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#xFF1A;RAID, DAS, SAN, NAS, CAS&#x7B49;&#xFF0C;&#x5BF9;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x7684;&#x539F;&#x7406;&#x4EE5;&#x53CA;&#x5B9E;&#x73B0;&#x6280;&#x672F;&#x719F;&#x6089;&#x3002;</li>
<li>&#x5B58;&#x50A8;&#x534F;&#x8BAE;&#xFF1A;TCP/IP, SCSI, iSCSI, NFS/CIFS&#x7B49;, &#x719F;&#x6089;&#x8FD9;&#x4E9B;&#x5B58;&#x50A8;&#x76F8;&#x5173;&#x534F;&#x8BAE;&#x3002;</li>
<li>&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF1A;VFS, EXTx/NTFS/FAT32&#x7B49;&#x78C1;&#x76D8;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;, NFS/CIFS&#x7F51;&#x7EDC;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;, Lustre/GFS/AFS<br>&#x7B49;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x638C;&#x63E1;&#x539F;&#x7406;&#x548C;&#x5B9E;&#x73B0;&#x6280;&#x672F;&#xFF0C;&#x80FD;&#x591F;&#x9605;&#x8BFB;&#x6E90;&#x7801;&#x5219;&#x66F4;&#x597D;&#x3002;</li>
<li>&#x5B58;&#x50A8;&#x6280;&#x672F;&#xFF1A;Deduplication, SSD, HSM, Virtualization, Snapshot, Replication, CDP<br>, VTL, Thin Provision&#x7B49;&#x7B49;&#xFF0C;&#x5C3D;&#x91CF;&#x591A;&#x8DDF;&#x8E2A;&#x6700;&#x65B0;&#x5B58;&#x50A8;&#x6280;&#x672F;&#x8FDB;&#x5C55;&#xFF0C;&#x591A;&#x591A;&#x76CA;&#x5584;&#x3002;</li>
<li>&#x5B58;&#x50A8;&#x67B6;&#x6784;&#xFF1A;&#x638C;&#x63E1;&#x4E0D;&#x540C;&#x884C;&#x4E1A;&#x7684;&#x5B58;&#x50A8;&#x9700;&#x6C42;&#xFF0C;&#x80FD;&#x591F;&#x6839;&#x636E;&#x5B9E;&#x9645;&#x9700;&#x6C42;&#x63D0;&#x51FA;&#x5B58;&#x50A8;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5E76;&#x8FDB;&#x884C;&#x5B58;<br>&#x50A8;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x3001;&#x8BBE;&#x8BA1;&#x548C;&#x5B9E;&#x73B0;&#x3002;</li>
</ol>
<p>&#x5B58;&#x50A8;&#x7814;&#x53D1;&#x4EBA;&#x5458;&#x6210;&#x957F;&#x5927;&#x81F4;&#x53EF;&#x5206;&#x4E3A;&#x56DB;&#x4E2A;&#x7EA7;&#x522B;&#xFF1A;</p>
<ol>
<li>&#x5B58;&#x50A8;&#x521D;&#x7EA7;&#x7814;&#x53D1;&#xFF1A;&#x638C;&#x63E1;1&#x3001;2&#x3001;3&#x9879;&#x5B58;&#x50A8;&#x5185;&#x5BB9;&#xFF0C;&#x5728;&#x4E2D;&#x9AD8;&#x7EA7;&#x5B58;&#x50A8;&#x7814;&#x53D1;&#x6307;&#x5BFC;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x5B58;&#x50A8;&#x7814;&#x53D1;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x5B58;&#x50A8;&#x4E2D;&#x7EA7;&#x7814;&#x53D1;&#xFF1A;&#x638C;&#x63E1;4&#x3001;5&#x9879;&#x5B58;&#x50A8;&#x5185;&#x5BB9;&#xFF0C;&#x53EF;&#x4EE5;&#x5E26;&#x9886;&#x56E2;&#x961F;&#x8FDB;&#x884C;&#x7814;&#x53D1;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E76;&#x6307;&#x5BFC;&#x521D;&#x7EA7;&#x7814;&#x53D1;&#x3002;</li>
<li>&#x5B58;&#x50A8;&#x9AD8;&#x7EA7;&#x7814;&#x53D1;&#xFF1A;&#x638C;&#x63E1;6&#x3001;7&#x9879;&#x5B58;&#x50A8;&#x5185;&#x5BB9;&#xFF0C;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x5B58;&#x50A8;&#x65B0;&#x6280;&#x672F;&#x7684;&#x7814;&#x7A76;&#xFF0C;&#x5BF9;&#x73B0;&#x6709;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x4F18;<br>&#x5316;&#x6539;&#x8FDB;&#xFF0C;&#x539F;&#x578B;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x3002;</li>
<li>&#x5B58;&#x50A8;&#x7814;&#x53D1;&#x4E13;&#x5BB6;&#xFF1A;&#x638C;&#x63E1;8&#x9879;&#x5B58;&#x50A8;&#x5185;&#x5BB9;&#xFF0C;&#x5B58;&#x50A8;&#x524D;&#x6CBF;&#x6280;&#x672F;&#x7814;&#x7A76;&#xFF0C;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x89C4;&#x5212;&#x4E0E;&#x67B6;&#x6784;&#xFF0C;&#x5BF9;&#x5B58;&#x50A8;&#x53D1;<br>&#x5C55;&#x8D8B;&#x52BF;&#x6709;&#x7740;&#x5F88;&#x597D;&#x7684;&#x7406;&#x89E3;&#x548C;&#x6D1E;&#x5BDF;&#x3002;</li>
</ol>
<p>10000&#x5C0F;&#x65F6;&#x6CD5;&#x5219; (The 10,OOO Hour Rule)&#xFF0C;&#x7B80;&#x5355;&#x5730;&#x8BF4;&#xFF0C;&#x4EFB;&#x4F55;&#x4EBA;&#x8981;&#x5728;&#x4EFB;&#x4F55;&#x9886;&#x57DF;&#x51FA;&#x7C7B;&#x62D4;&#x8403;&#xFF0C;&#x8131;&#x9896;<br>&#x800C;&#x51FA;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x8BA4;&#x771F;&#x6295;&#x5165;10000&#x5C0F;&#x65F6;&#x4EE5;&#x4E0A;&#x3002;10000&#x5C0F;&#x65F6;&#x662F;&#x4E00;&#x4E2A;&#x7A81;&#x7834;&#x7684;&#x4E34;&#x754C;&#x70B9;&#x3002;&#x4EE5;&#x6BCF;&#x5929;10&#x4E2A;&#x5C0F;&#x65F6;&#x7B97;<br>&#xFF0C;10000&#x5C0F;&#x65F6;&#x76F8;&#x5F53;&#x4E8E;&#x4E09;&#x5E74;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x8981;&#x505A;&#x6210;&#x529F;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x4F60;&#x5C31;&#x8981;&#x6BCF;&#x5929;10&#x5C0F;&#x65F6;&#x6295;&#x5165;&#xFF0C;&#x6301;&#x7EED;3&#x5E74;<br>&#x3002;&#x5982;&#x679C;&#x6BCF;&#x5929;&#x53EA;&#x6709;5&#x5C0F;&#x65F6;&#xFF0C;&#x90A3;&#x4E48;&#x9700;&#x8981;6&#x5E74;&#x3002;&#x5982;&#x679C;&#x6BCF;&#x5929;3&#x5C0F;&#x65F6;&#xFF0C;&#x5219;&#x9700;&#x8981;10&#x5E74;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x6210;&#x4E3A;&#x5B58;<br>&#x50A8;&#x9886;&#x57DF;&#x7684;&#x4E13;&#x5BB6;&#xFF0C;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x6377;&#x5F84;&#x53EF;&#x8D70;&#xFF0C;&#x53EA;&#x6709;&#x575A;&#x6301;&#x5B66;&#x4E60;&#x3001;&#x5B9E;&#x8DF5;&#x3001;&#x601D;&#x8003;&#x3002;3&#x5E74;&#x3001;5&#x5E74;&#x3001;8&#x5E74;&#x3001;10&#x5E74;&#x540E;<br>&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x4ECD;&#x5728;&#x8FFD;&#x6C42;&#x65E2;&#x5B9A;&#x76EE;&#x6807;&#xFF0C;&#x5B9A;&#x4F1A;&#x6709;&#x6240;&#x6210;&#x5C31;&#x3002;</p>
<p>&#x201C;&#x539A;&#x79EF;&#x800C;&#x8584;&#x53D1;&#x201D;&#xFF0C;&#x4E0E;&#x6240;&#x6709;&#x5B58;&#x50A8;&#x540C;&#x884C;&#x5171;&#x52C9;&#xFF01;</p>
<p>###<a href="http://blog.csdn.net/liuaigui/article/details/5368300" target="_blank" rel="external">&#x5B58;&#x50A8;&#x5B66;&#x4E60;&#x4E4B;&#x8DEF;</a></p>
<ul>
<li>0&#x3001;&#x5B58;&#x50A8;&#x5165;&#x95E8;</li>
</ul>
<p>&#x3000;&#x9886;&#x8DEF;&#x4EBA;&#x7684;&#x4F5C;&#x7528;&#x5F88;&#x5927;&#xFF0C;&#x8FD9;&#x4E2A;&#x4EBA;&#x53EF;&#x80FD;&#x662F;&#x4F60;&#x505A;&#x7814;&#x7A76;&#x751F;&#x7684;&#x5BFC;&#x5E08;&#xFF0C;&#x6216;&#x8005;&#x5DE5;&#x4F5C;&#x4E2D;&#x7684;tutor&#xFF0C;&#x6216;&#x8005;&#x662F;&#x670B;&#x53CB;&#x3001;<br>&#x540C;&#x4E8B;&#x3002;&#x6307;&#x70B9;&#x8FF7;&#x6D25;&#xFF0C;&#x5B66;&#x4E60;&#x548C;&#x7814;&#x7A76;&#x8FC7;&#x7A0B;&#x4E2D;&#x5C06;&#x5C11;&#x8D70;&#x5F88;&#x591A;&#x5F2F;&#x8DEF;&#xFF0C;&#x7ECF;&#x9A8C;&#x7684;&#x4EF7;&#x503C;&#x8FD9;&#x5728;&#x8FD9;&#x91CC;&#x4F53;&#x73B0;&#x3002;&#x5982;&#x679C;&#x4F60;&#x662F;<br>&#x5B58;&#x50A8;&#x521D;&#x5B66;&#x8005;&#xFF0C;&#x8D76;&#x5FEB;&#x53BB;&#x5BFB;&#x627E;&#x4F60;&#x7684;&#x9886;&#x8DEF;&#x4EBA;&#x3002;&#x5F53;&#x7136;&#x81EA;&#x5B66;&#x6210;&#x624D;&#x7684;&#x4F8B;&#x5B50;&#x4E3E;&#x4E0D;&#x80DC;&#x4E3E;&#xFF0C;&#x8FD8;&#x662F;&#x9760;&#x81EA;&#x5DF1;&#x6765;&#x505A;&#x6743;&#x8861;&#x3002;</p>
<ul>
<li>1&#x3001;&#x5B58;&#x50A8;&#x56FE;&#x4E66;</li>
</ul>
<p>&#x3000;&#x5B66;&#x4E60;&#x5B58;&#x50A8;&#x7684;&#x57FA;&#x7840;&#x7406;&#x8BBA;&#x6700;&#x76F4;&#x63A5;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x8BFB;&#x4E66;&#x3002;&#x76F8;&#x5BF9;&#x4E8E;&#x8BA1;&#x7B97;&#x4E0E;&#x7F51;&#x7EDC;&#x6280;&#x672F;&#xFF0C;&#x5B58;&#x50A8;&#x6280;&#x672F;&#x53D1;&#x5C55;&#x662F;&#x76F8;<br>&#x5BF9;&#x843D;&#x540E;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x56FE;&#x4E66;&#x65B9;&#x9762;&#x4E5F;&#x8981;&#x5C11;&#x5F88;&#x591A;&#xFF0C;&#x56FD;&#x5185;&#x7684;&#x66F4;&#x5C11;&#xFF0C;&#x800C;&#x4E14;&#x5927;&#x591A;&#x662F;&#x7FFB;&#x8BD1;&#x6216;&#x6539;&#x7F16;&#x7684;&#x3002;&#x6211;&#x8BFB;&#x8FC7;&#x7684;&#x56FD;<br>&#x5185;&#x5B58;&#x50A8;&#x56FE;&#x4E66;&#x6709;&#xFF1A;</p>
<ul>
<li>&#x7F51;&#x7EDC;&#x5B58;&#x50A8;&#x6280;&#x672F;    &#x6E05;&#x534E;&#x5927;&#x5B66;&#x51FA;&#x7248;&#x793E;</li>
<li>&#x7F51;&#x7EDC;&#x5B58;&#x50A8;&#x6280;&#x672F;&#x5BFC;&#x8BBA;    &#x6E05;&#x534E;&#x5927;&#x5B66;&#x51FA;&#x7248;&#x793E;</li>
<li>SAN&#x5B58;&#x50A8;&#x533A;&#x57DF;&#x7F51;&#x7EDC;    &#x673A;&#x68B0;&#x5DE5;&#x4E1A;&#x51FA;&#x7248;&#x793E;</li>
<li>&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5907;&#x4EFD;&#x4E0E;&#x707E;&#x96BE;&#x6062;&#x590D;    &#x7535;&#x5B50;&#x5DE5;&#x4E1A;&#x51FA;&#x7248;&#x793E;</li>
<li>&#x57FA;&#x4E8E;&#x5BF9;&#x8C61;&#x7684;&#x7F51;&#x7EDC;&#x5B58;&#x50A8;    &#x7535;&#x5B50;&#x5DE5;&#x4E1A;&#x51FA;&#x7248;&#x793E;</li>
<li>IPSAN&#x6743;&#x5A01;&#x6307;&#x5357;    &#x4E2D;&#x56FD;&#x7535;&#x529B;&#x51FA;&#x7248;&#x793E;</li>
<li>&#x6210;&#x5C31;&#x5B58;&#x50A8;&#x4E13;&#x5BB6;&#x4E4B;&#x8DEF;    &#x6E05;&#x534E;&#x5927;&#x5B66;&#x51FA;&#x7248;&#x793E;</li>
<li>&#x4FE1;&#x606F;&#x5B58;&#x50A8;&#x4E0E;&#x7BA1;&#x7406;    &#x4EBA;&#x6C11;&#x90AE;&#x7535;&#x51FA;&#x7248;&#x793E;</li>
<li>&#x5927;&#x8BDD;&#x5B58;&#x50A8;    &#x6E05;&#x534E;&#x5927;&#x5B66;&#x51FA;&#x7248;&#x793E;    </li>
<li>&#x6570;&#x636E;&#x91CD;&#x73B0;    &#x6E05;&#x534E;&#x5927;&#x5B66;&#x51FA;&#x7248;&#x793E;</li>
</ul>
<ul>
<li>2&#x3001;&#x5B58;&#x50A8;&#x8D44;&#x6E90;</li>
</ul>
<p>&#x3000;&#x7F51;&#x7EDC;&#x8D44;&#x6E90;&#x4E5F;&#x662F;&#x5B66;&#x4E60;&#x5B58;&#x50A8;&#x7684;&#x91CD;&#x8981;&#x8D44;&#x6E90;&#xFF0C;&#x800C;&#x4E14;&#x80FD;&#x591F;&#x5F88;&#x597D;&#x5730;&#x8DDF;&#x8E2A;&#x5B58;&#x50A8;&#x7684;&#x6700;&#x8FD1;&#x53D1;&#x5C55;&#x52A8;&#x6001;&#x3002;&#x6211;&#x5E38;&#x8BBF;&#x95EE;&#x7684;URL&#x6709;&#xFF1A;</p>
<ul>
<li>InfoStor: <a href="http://www.infostor.com" target="_blank" rel="external">http://www.infostor.com</a>  </li>
<li>SINA: <a href="http://www.snia.org/home" target="_blank" rel="external">http://www.snia.org/home</a>  </li>
<li>Gartner: <a href="http://www.gartner.com/technology/home.jsp" target="_blank" rel="external">http://www.gartner.com/technology/home.jsp</a>  </li>
<li>SanSky: <a href="http://www.sansky.net/" target="_blank" rel="external">http://www.sansky.net/</a>  </li>
<li>DoStor: <a href="http://www.dostor.com/" target="_blank" rel="external">http://www.dostor.com/</a>  </li>
<li>WatchStor: <a href="http://www.watchstor.com/" target="_blank" rel="external">http://www.watchstor.com/</a>  </li>
</ul>
<p>&#x53E6;&#x5916;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x56FD;&#x9645;&#x4E0A;&#x5B58;&#x50A8;&#x4F1A;&#x8BAE;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<ul>
<li>SDC&#xFF0C;Storage Developer Conference&#x3000;(2009,<a href="http://www.snia.org/events/storage-developer2009/presentations" target="_blank" rel="external">http://www.snia.org/events/storage-developer2009/presentations</a>)</li>
<li>FAST, File and Storage Technologies (<a href="http://www.usenix.org/events/fast/" target="_blank" rel="external">http://www.usenix.org/events/fast/</a>)</li>
</ul>
<ul>
<li><p>3&#x3001;&#x5B58;&#x50A8;&#x5B9E;&#x8DF5;</p>
<p>&#x5927;&#x5B66;&#x4E2D;&#x6211;&#x4EEC;&#x6700;&#x7F3A;&#x662F;&#x4F30;&#x8BA1;&#x5C31;&#x662F;&#x5B9E;&#x8DF5;&#x3002;&#x5B9E;&#x8DF5;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x66F4;&#x6DF1;&#x523B;&#x5730;&#x7406;&#x89E3;&#x548C;&#x638C;&#x63E1;&#x7406;&#x8BBA;&#xFF0C;&#x5E76;&#x4E14;&#x83B7;&#x5F97;<br>&#x5C06;&#x7406;&#x8BBA;&#x8FDB;&#x884C;&#x5B9E;&#x73B0;&#x548C;&#x5E94;&#x7528;&#x7684;&#x80FD;&#x529B;&#x3002;&#x5B9E;&#x8DF5;&#x6709;&#x5F88;&#x591A;&#x65B9;&#x5F0F;&#xFF0C;&#x6BD4;&#x5982;&#x81EA;&#x5DF1;&#x52A8;&#x624B;&#x8FDB;&#x884C;&#x5B58;&#x50A8;&#x8F6F;&#x786C;&#x4EF6;&#x7684;&#x8C03;&#x8BD5;&#x3001;&#x5B58;<br>&#x50A8;&#x7CFB;&#x7EDF;&#x96C6;&#x4F18;&#x5316;&#x6539;&#x8FDB;&#x3001;&#x5F00;&#x53D1;&#x4E00;&#x4E9B;&#x8F6F;&#x4EF6;&#x3001;&#x9605;&#x8BFB;&#x5B58;&#x50A8;&#x8F6F;&#x4EF6;&#x6E90;&#x7801;&#x7B49;&#x7B49;&#x3002;&#x5B9E;&#x8DF5;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#xFF0C;&#x591A;&#x591A;&#x76CA;&#x5584;&#xFF0C;&#x5C3D;<br>&#x91CF;&#x627E;&#x673A;&#x4F1A;&#x591A;&#x505A;&#x3002;&#x6E90;&#x4EE3;&#x7801;&#x9664;&#x4E86;Linux kernel&#x5916;&#xFF0C;www.sourceforge.net&#x662F;&#x6700;&#x597D;&#x7684;&#x53BB;&#x5904;&#xFF0C;&#x53EF;&#x4EE5;&#x8BFB;<br>VFS&#x3001;EXT2/3/4&#x3001;Soft RAID&#x3001;LVM&#x3001;FDISK&#x3001;NFS/CIFS&#x3001;SCSI/iSCSI&#x3001;FUSE&#x3001;AFS&#x3001;LUSTRE&#x7B49;&#x7B49;&#x3002;</p>
</li>
<li><p>4&#x3001;&#x5B58;&#x50A8;&#x4EA4;&#x6D41;</p>
</li>
</ul>
<p>&#x3000;&#x725B;&#x4EBA;&#x5927;&#x591A;&#x90FD;&#x662F;&#x559C;&#x6B22;&#x4E0E;&#x4EBA;&#x5206;&#x4EAB;&#x7684;&#xFF0C;&#x4F60;&#x4E5F;&#x4E0D;&#x8981;&#x62C5;&#x5FC3;&#x5206;&#x4EAB;&#x81EA;&#x5DF1;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x522B;&#x4EBA;&#x5C31;&#x8D85;&#x8D8A;&#x4F60;&#x4E86;&#x3002;&#x80FD;&#x628A;&#x81EA;<br>&#x5DF1;&#x7684;&#x4E1C;&#x897F;&#x8BF4;&#x5F97;&#x8BA9;&#x522B;&#x4EBA;&#x660E;&#x767D;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5BF9;&#x81EA;&#x5DF1;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x63D0;&#x5347;&#x3002;&#x7269;&#x4EE5;&#x7C7B;&#x805A;&#xFF0C;&#x4EBA;&#x4EE5;&#x7FA4;&#x5206;&#x3002;&#x73B0;&#x5728;&#x7F51;&#x7EDC;&#x4E0D;<br>&#x8981;&#x592A;&#x65B9;&#x4FBF;&#xFF0C;&#x627E;&#x4E00;&#x7FA4;&#x5174;&#x8DA3;&#x76F8;&#x6295;&#x7684;&#x4EBA;&#xFF0C;&#x591A;&#x591A;&#x4EA4;&#x6D41;&#xFF0C;&#x5927;&#x5BB6;&#x5171;&#x540C;&#x8FDB;&#x6B65;&#x5C31;&#x4F55;&#x7B49;&#x7684;&#x597D;&#x4E8B;&#x3002;&#x800C;&#x4E14;&#x540C;&#x65F6;&#x53EF;&#x4EE5;&#x5EFA;<br>&#x7ACB;&#x4EBA;&#x8109;&#xFF0C;&#x8BF4;&#x4E0D;&#x5B9A;&#x54EA;&#x5929;&#x5FD7;&#x540C;&#x9053;&#x5408;&#x7684;&#x4EBA;&#xFF0C;&#x5C31;&#x4E00;&#x8D77;&#x505A;&#x5171;&#x4E8B;&#x6216;&#x521B;&#x4E1A;&#x4E86;&#x3002;</p>
<ul>
<li>5&#x3001;&#x5B58;&#x50A8;&#x601D;&#x8003;</li>
</ul>
<p>&#x3000;&#x5B66;&#x800C;&#x4E0D;&#x601D;&#x5219;&#x7F54;&#xFF0C;&#x601D;&#x800C;&#x4E0D;&#x5B66;&#x5219;&#x8D3B;&#x3002;&#x5F53;&#x5DF2;&#x7ECF;&#x638C;&#x63E1;&#x4E86;&#x4E00;&#x4E9B;&#x5B58;&#x50A8;&#x7406;&#x8BBA;&#x548C;&#x5B9E;&#x8DF5;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x9047;&#x5230;&#x53D1;<br>&#x5C55;&#x7684;&#x74F6;&#x9888;&#xFF0C;&#x9700;&#x8981;&#x9009;&#x62E9;&#x4E00;&#x4E24;&#x4E2A;&#x65B9;&#x5411;&#x8FDB;&#x884C;&#x6DF1;&#x5165;&#x5B66;&#x4E60;&#x548C;&#x7814;&#x7A76;&#x3002;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x624D;&#x80FD;&#x6709;&#x7CBE;&#x529B;&#x53BB;&#x5206;&#x6790;&#x548C;&#x601D;&#x8003;&#x7406;<br>&#x8BBA;&#x548C;&#x6280;&#x672F;&#x4E0A;&#x4F18;&#x70B9;&#x4E0E;&#x4E0D;&#x8DB3;&#xFF0C;&#x7EE7;&#x800C;&#x4E0D;&#x65AD;&#x5B9E;&#x8DF5;&#x548C;&#x601D;&#x8003;&#x3002;&#x4ECE;&#x800C;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x8FBE;&#x5230;&#x4E00;&#x4E2A;&#x66F4;&#x9AD8;&#x7684;&#x5C42;&#x6B21;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;<br>&#x80FD;&#x4F1A;&#x53D1;&#x73B0;&#x4E00;&#x4E9B;&#x673A;&#x4F1A;&#x3002;</p>
<ul>
<li>6&#x3001;&#x5B58;&#x50A8;&#x7ECF;&#x9A8C;</li>
</ul>
<p>&#x3000;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x770B;&#x5230;&#x62DB;&#x8058;&#x4FE1;&#x606F;&#x4E0A;&#x8981;&#x6C42;8&#xFF0D;10&#x5E74;&#x7684;&#x76F8;&#x5173;&#x5DE5;&#x4F5C;&#x7ECF;&#x9A8C;&#x3002;&#x4E0D;&#x7BA1;&#x662F;&#x5931;&#x8D25;&#x8FD8;&#x662F;&#x6210;&#x529F;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x5BF9;<br>&#x672A;&#x6765;&#x7684;&#x5DE5;&#x4F5C;&#x90FD;&#x5F88;&#x6709;&#x610F;&#x4E49;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5931;&#x8D25;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x5C06;&#x5927;&#x5927;&#x63D0;&#x6210;&#x529F;&#x7684;&#x51E0;&#x7387;&#x3002;&#x5BF9;&#x641E;&#x5B58;&#x50A8;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x6700;&#x597D;<br>&#x80FD;&#x627E;&#x673A;&#x4F1A;&#x8FDB;&#x5165;&#x5B58;&#x50A8;&#x884C;&#x4E1A;&#x7684;&#x516C;&#x53F8;&#x6216;&#x7814;&#x7A76;&#x673A;&#x6784;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD9;&#x5BF9;&#x7ECF;&#x9A8C;&#x7684;&#x63D0;&#x5347;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x6B63;&#x89C4;&#x519B;<br>&#xFF0C;&#x662F;&#x9002;&#x5E94;&#x5E02;&#x573A;&#x7528;&#x6237;&#x9700;&#x6C42;&#x7684;&#xFF0C;&#x800C;&#x81EA;&#x5DF1;&#x7684;&#x5B66;&#x4E60;&#x548C;&#x7814;&#x7A76;&#xFF0C;&#x90FD;&#x662F;&#x51FA;&#x81EA;&#x81EA;&#x8EAB;&#x9700;&#x6C42;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5728;&#x516C;&#x53F8;&#x5DE5;&#x4F5C;<br>&#xFF0C;&#x6216;&#x8005;&#x81EA;&#x5DF1;&#x521B;&#x4E1A;&#xFF0C;&#x7528;&#x6237;&#x9700;&#x6C42;&#x662F;&#x505A;&#x4EA7;&#x54C1;&#x7684;&#x6839;&#x672C;&#x51FA;&#x53D1;&#x70B9;&#xFF0C;&#x8FD9;&#x4E2A;&#x610F;&#x8BC6;&#x8981;&#x5C3D;&#x65E9;&#x57F9;&#x517B;&#x3002;</p>
<ul>
<li>7&#x3001;&#x5B58;&#x50A8;&#x8D8B;&#x52BF;</li>
</ul>
<p>&#x3000;&#x719F;&#x6089;&#x5386;&#x53F2;&#xFF0C;&#x628A;&#x63E1;&#x73B0;&#x5728;&#xFF0C;&#x9884;&#x6D4B;&#x672A;&#x6765;&#x3002;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x5BF9;&#x5B58;&#x50A8;&#x6280;&#x672F;&#x7684;&#x8FC7;&#x53BB;&#x548C;&#x73B0;&#x5728;&#x90FD;&#x975E;&#x5E38;&#x719F;&#x6089;&#x548C;&#x6DF1;&#x5165;&#x7406;<br>&#x89E3;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x6B63;&#x786E;&#x5730;&#x5BF9;&#x5B58;&#x50A8;&#x7684;&#x672A;&#x6765;&#x8D8B;&#x52BF;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x548C;&#x9884;&#x6D4B;&#xFF0C;&#x638C;&#x63E1;&#x5148;&#x673A;&#x548C;&#x5546;&#x673A;&#x3002;&#x8FD9;&#x79CD;&#x4EBA;<br>&#x662F;&#x5927;&#x725B;&#xFF0C;&#x6216;&#x8BB8;&#x6211;&#x4EEC;&#x5F88;&#x96BE;&#x8FBE;&#x5230;&#x8FD9;&#x4E2A;&#x5C42;&#x6B21;&#xFF0C;&#x4F46;&#x81F3;&#x5C11;&#x5927;&#x725B;&#x63D0;&#x51FA;&#x5F88;&#x591A;&#x65B0;&#x7684;&#x89C2;&#x70B9;&#x548C;&#x6982;&#x5FF5;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x5F88;&#x5FEB;<br>&#x7406;&#x89E3;&#x548C;&#x8BA4;&#x540C;&#x3002;</p>
<ul>
<li>8&#x3001;&#x5B58;&#x50A8;&#x521B;&#x65B0;</li>
</ul>
<p>&#x3000;&#x521B;&#x65B0;&#x662F;&#x9700;&#x8981;&#x524D;&#x63D0;&#x6761;&#x4EF6;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x524D;&#x9762;&#x7684;&#x5B66;&#x4E60;&#x3001;&#x5B9E;&#x8DF5;&#x3001;&#x601D;&#x8003;&#xFF0C;&#x5B58;&#x50A8;&#x521B;&#x65B0;&#x6839;&#x672C;&#x65E0;&#x4ECE;&#x8C08;&#x8D77;&#x3002;&#x521B;<br>&#x65B0;&#x53EF;&#x80FD;&#x662F;&#x7406;&#x8BBA;&#x521B;&#x65B0;&#x548C;&#x6280;&#x672F;&#x521B;&#x65B0;&#xFF0C;&#x4E3B;&#x8981;&#x51FA;&#x53D1;&#x70B9;&#x5C31;&#x662F;&#x8981;&#x89E3;&#x51B3;&#x548C;&#x6539;&#x8FDB;&#x76EE;&#x524D;&#x7406;&#x8BBA;&#x6216;&#x6280;&#x672F;&#x4E0A;&#x5B58;&#x5728;&#x7684;&#x7F3A;&#x9677;<br>&#x4E0E;&#x4E0D;&#x8DB3;&#xFF0C;&#x8FD9;&#x81EA;&#x7136;&#x5C31;&#x8981;&#x6C42;&#x6211;&#x4EEC;&#x5BF9;&#x73B0;&#x6709;&#x7684;&#x4E1C;&#x897F;&#x975E;&#x5E38;&#x719F;&#x6089;&#x3002;&#x8FBE;&#x5230;&#x53EF;&#x4EE5;&#x6DF1;&#x5165;&#x601D;&#x8003;&#x548C;&#x5BFB;&#x6C42;&#x521B;&#x65B0;&#x7684;&#x5C42;&#x6B21;&#xFF0C;<br>&#x6211;&#x60F3;&#x5927;&#x6982;&#x89C4;&#x5F8B;&#x6027;&#x7684;&#x4E1C;&#x897F;&#x5C31;&#x5F88;&#x5C11;&#x4E86;&#x3002;&#x6210;&#x529F;&#x6709;&#x65F6;&#x662F;&#x9700;&#x8981;&#x70B9;&#x8FD0;&#x6C14;&#xFF0C;&#x4F46;&#x524D;&#x671F;&#x7684;&#x529F;&#x8BFE;&#x662F;&#x8981;&#x505A;&#x597D;&#x7684;&#xFF0C;&#x6210;&#x529F;<br>&#x8FD8;&#x662F;&#x7737;&#x987E;&#x6709;&#x5145;&#x5206;&#x51C6;&#x5907;&#x7684;&#x4EBA;&#x7684;&#x3002;</p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://matrix207.github.com/2014/07/18/storage-technology/" data-id="cin6a5ujw008h3ciztx1ffgfv" class="article-share-link">Share</a>
      
      
    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2014/07/28/data-structures-relation-to-image/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          data structures relation to image
        
      </div>
    </a>
  
  
    <a href="/2014/07/18/jni-on-linux/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">jni on linux</div>
    </a>
  
</nav>

  
</article>

</section>
        
          <aside id="sidebar">
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Categories</h3>
    <div class="widget">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/debug/">debug</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/git/">git</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/kernel/">kernel</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/linux/">linux</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/math/">math</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/windows/">windows</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tag Cloud</h3>
    <div class="widget tagcloud">
      <a href="/tags/ARP/" style="font-size: 10px;">ARP</a> <a href="/tags/Auto-Compile/" style="font-size: 10px;">Auto Compile</a> <a href="/tags/Batch-File/" style="font-size: 10px;">Batch File</a> <a href="/tags/C/" style="font-size: 10px;">C</a> <a href="/tags/Emacs/" style="font-size: 10px;">Emacs</a> <a href="/tags/FAQ/" style="font-size: 10px;">FAQ</a> <a href="/tags/ICMP/" style="font-size: 10px;">ICMP</a> <a href="/tags/IRC/" style="font-size: 10px;">IRC</a> <a href="/tags/Linux/" style="font-size: 10px;">Linux</a> <a href="/tags/NetworkStack/" style="font-size: 12.5px;">NetworkStack</a> <a href="/tags/Notepad/" style="font-size: 10px;">Notepad++</a> <a href="/tags/Translation/" style="font-size: 17.5px;">Translation</a> <a href="/tags/WinIO/" style="font-size: 10px;">WinIO</a> <a href="/tags/api/" style="font-size: 10px;">api</a> <a href="/tags/arp/" style="font-size: 10px;">arp</a> <a href="/tags/auto-compile/" style="font-size: 10px;">auto compile</a> <a href="/tags/awk/" style="font-size: 12.5px;">awk</a> <a href="/tags/batch/" style="font-size: 20px;">batch</a> <a href="/tags/blat/" style="font-size: 12.5px;">blat</a> <a href="/tags/blog/" style="font-size: 10px;">blog</a> <a href="/tags/book/" style="font-size: 10px;">book</a> <a href="/tags/dot/" style="font-size: 10px;">dot</a> <a href="/tags/exploit/" style="font-size: 10px;">exploit</a> <a href="/tags/flowchart/" style="font-size: 10px;">flowchart</a> <a href="/tags/gedit/" style="font-size: 10px;">gedit</a> <a href="/tags/git/" style="font-size: 15px;">git</a> <a href="/tags/github/" style="font-size: 12.5px;">github</a> <a href="/tags/google/" style="font-size: 10px;">google</a> <a href="/tags/graphviz/" style="font-size: 12.5px;">graphviz</a> <a href="/tags/hardware-monitor/" style="font-size: 10px;">hardware monitor</a> <a href="/tags/hexo/" style="font-size: 10px;">hexo</a> <a href="/tags/iscsi/" style="font-size: 20px;">iscsi</a> <a href="/tags/javascript/" style="font-size: 10px;">javascript</a> <a href="/tags/jekyll/" style="font-size: 10px;">jekyll</a> <a href="/tags/kernel/" style="font-size: 10px;">kernel</a> <a href="/tags/kvm/" style="font-size: 12.5px;">kvm</a> <a href="/tags/linux/" style="font-size: 10px;">linux</a> <a href="/tags/lisp/" style="font-size: 10px;">lisp</a> <a href="/tags/mac/" style="font-size: 10px;">mac</a> <a href="/tags/mail/" style="font-size: 10px;">mail</a> <a href="/tags/malloc-abc/" style="font-size: 10px;">malloc abc</a> <a href="/tags/mathematician/" style="font-size: 10px;">mathematician</a> <a href="/tags/maxima/" style="font-size: 10px;">maxima</a> <a href="/tags/mtrace/" style="font-size: 10px;">mtrace</a> <a href="/tags/mysql/" style="font-size: 10px;">mysql</a> <a href="/tags/net-snmp/" style="font-size: 10px;">net-snmp</a> <a href="/tags/netbios/" style="font-size: 10px;">netbios</a> <a href="/tags/network/" style="font-size: 10px;">network</a> <a href="/tags/nodejs/" style="font-size: 10px;">nodejs</a> <a href="/tags/novels/" style="font-size: 10px;">novels</a> <a href="/tags/opennebula/" style="font-size: 10px;">opennebula</a> <a href="/tags/org-mode/" style="font-size: 10px;">org mode</a> <a href="/tags/pandoc/" style="font-size: 10px;">pandoc</a> <a href="/tags/plugin/" style="font-size: 10px;">plugin</a> <a href="/tags/python/" style="font-size: 10px;">python</a> <a href="/tags/raid/" style="font-size: 10px;">raid</a> <a href="/tags/rsync/" style="font-size: 10px;">rsync</a> <a href="/tags/sed/" style="font-size: 12.5px;">sed</a> <a href="/tags/shell/" style="font-size: 17.5px;">shell</a> <a href="/tags/skype/" style="font-size: 12.5px;">skype</a> <a href="/tags/source-analyze/" style="font-size: 10px;">source analyze</a> <a href="/tags/sqlite/" style="font-size: 10px;">sqlite</a> <a href="/tags/ssh/" style="font-size: 10px;">ssh</a> <a href="/tags/study/" style="font-size: 10px;">study</a> <a href="/tags/svn/" style="font-size: 17.5px;">svn</a> <a href="/tags/tunnel/" style="font-size: 10px;">tunnel</a> <a href="/tags/valgrind/" style="font-size: 12.5px;">valgrind</a> <a href="/tags/vi/" style="font-size: 10px;">vi</a> <a href="/tags/vim/" style="font-size: 17.5px;">vim</a> <a href="/tags/wget/" style="font-size: 10px;">wget</a> <a href="/tags/wifi/" style="font-size: 10px;">wifi</a> <a href="/tags/wireless-tools/" style="font-size: 10px;">wireless-tools</a> <a href="/tags/wpa-supplicant/" style="font-size: 10px;">wpa_supplicant</a> <a href="/tags/xml/" style="font-size: 10px;">xml</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Archives</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/04/">April 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/03/">March 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/02/">February 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/01/">January 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/11/">November 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/10/">October 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/09/">September 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/08/">August 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/07/">July 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/06/">June 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/03/">March 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/02/">February 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/01/">January 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/12/">December 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/11/">November 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/09/">September 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/08/">August 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/07/">July 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/06/">June 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/05/">May 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/04/">April 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/03/">March 2014</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/11/">November 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/10/">October 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/09/">September 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/08/">August 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/07/">July 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/06/">June 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/05/">May 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/04/">April 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/03/">March 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/02/">February 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2013/01/">January 2013</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2012/12/">December 2012</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2012/09/">September 2012</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Recent Posts</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2016/04/18/hexo/">Hexo</a>
          </li>
        
          <li>
            <a href="/2016/04/13/malloc/">malloc</a>
          </li>
        
          <li>
            <a href="/2016/03/12/performance-optimization-of-cplusplus/">performance optimization of C++</a>
          </li>
        
          <li>
            <a href="/2016/03/09/stack-trace-when-program-crash/">stack trace when program crash</a>
          </li>
        
          <li>
            <a href="/2016/03/09/database-knowledges/">Database knowledges</a>
          </li>
        
      </ul>
    </div>
  </div>

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2016 Matrix207<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>
    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
    <a href="/about" class="mobile-nav-link">About</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>